[{"category": ["business"], "category2": ["none"], "author": [], "headline": ["Silk Road linked to six drug overdose deaths"], "image": ["http://ichef.bbci.co.uk/news/200/media/images/82591000/jpg/_82591833_025595642-2.jpg"], "content": ["<p class=\"story-body__introduction\">Six people who died from overdoses bought drugs via the online Silk Road marketplace, claims the US government.</p>", "<p>Sited on the dark web, the Silk Road was a marketplace for illegal drugs that was closed in 2013, after the FBI arrested its creator - Ross Ulbricht.</p>", "<p>The claim was made in court papers filed by the US government prior to the sentencing hearing for Mr Ulbricht. </p>", "<p>Mr Ulbricht was convicted of narcotics and money laundering charges in February 2015.</p>", "<p>The maximum sentence he faces for these crimes is life in jail.</p>", "<p>In its testimony at the 15 May hearing, the US is also planning to let parents of two of the deceased testify.</p>", "<p>Defence lawyers acting for Mr Ulbricht are seeking to delay the sentencing hearing while they evaluate the evidence the US government has amassed to make its claims about overdose deaths. </p>", "<p>Lawyer Joshua Dratel, who is representing Mr Ulbricht, said the information provided by the US government was \"woefully incomplete\". Mr Dratel is asking for a delay of a month while he gathers expert witnesses and other testimony to counter the claims. </p>", "<p>In defence court papers <a href=\"http://arstechnica.com/tech-policy/2015/04/25/feds-6-died-as-a-result-of-overdosing-from-silk-road-purchased-drugs/\" class=\"story-body__link-external\">quoted by tech news site Ars Technica</a>, Mr Dratel said it planned to argue that the Silk Road had in place policies that tried to limit the risk faced by those buying drugs.</p>", "<p>The Silk Road was in operation from 2011 to 2013 and was available via the Tor dark web network. Payments for drugs and other services on the site were made with bitcoins. Mr Ulbricht is believed to have made about $18m (£12m) from running the site.</p>"], "link": "http://www.bbc.co.uk/news/technology-32480601#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa"},
{"category": ["hardware"], "category2": ["none"], "author": ["By Richard Westcott"], "headline": ["Rail signal upgrade 'could be hacked to cause crashes'"], "image": ["http://ichef.bbci.co.uk/news/200/media/images/82528000/jpg/_82528056_43799909-3ba8-4087-9e78-4641e050b952.jpg"], "content": ["<p class=\"story-body__introduction\">A hi-tech signalling system that will eventually control all of Britain's trains could potentially be hacked to cause a serious crash, according to a scientist who advises the government.</p>", "<p>Prof David Stupples told the BBC that plans to replace ageing signal lights with new computers could leave the rail network exposed to cyber-attacks.</p>", "<p>UK tests of the European Rail Traffic Management System are under way.</p>", "<p>Network Rail, which is in charge of the upgrade, acknowledges the threat.</p>", "<p>\"We know that the risk [of a cyber-attack] will increase as we continue to roll out digital technology across the network,\" a spokesman told the BBC.</p>", "<p>\"We work closely with government, the security services, our partners and suppliers in the rail industry and external cybersecurity specialists to understand the threat to our systems and make sure we have the right controls in place.\"</p>", "<p>Once the ERTMS is up and running, computers will dictate critical safety information including how fast the trains should go and how long they will take to stop.</p>", "<p>It is scheduled to take command of trains on some of the UK's busy intercity routes by the 2020s. </p>", "<p>The system is already used in other parts of the world and there are no reported cases of it being affected by cyber-attacks.</p>", "<p>In fact, it is designed to make networks safer by reducing the risk of driver mistakes. </p>", "<p>But Prof Stupples - an expert in networked electronic and radio systems at City University in London - said if someone hacked into the system they could cause a \"nasty accident\" or \"major disruption\".</p>", "<p>\"It's the clever malware [malicious software] that actually alters the way the train will respond,\" he explained.</p>", "<p>\"So, it will perhaps tell the system the train is slowing down, when it's speeding up.\"</p>", "<p>\"Governments aren't complacent\", the professor added. </p>", "<p>\"Certain ministers know this is absolutely possible and they are worried about it. Safeguards are going in, in secret, but it's always possible to get around them.\"</p>", "<p>He added that he had spoken up to raise awareness of the threat.</p>", "<p>\"We keep security arrangements under constant review to take account of the threat and any new challenges we face,\" responded a spokeswoman for the Department of Transport.</p>", "<p>According to the professor, the system is well protected against outside attack, but he says danger could come from a rogue insider.</p>", "<p>\"The weakness is getting malware into the system by employees. Either because they are dissatisfied or being bribed or coerced,\" he explained.</p>", "<p>He added that part of the reason that transport systems had not already been hacked as frequently as financial institutions and media organisations was that much of the technology involved was currently too old to be vulnerable. </p>", "<p>All of that will change in the coming years, as aircraft, cars and trains become progressively more computerised and connected, he said.</p>", "<p>Independent security expert Graham Cluley agreed that the sector could be vulnerable.</p>", "<p>\"Seeing as we have seen nuclear enrichment facilities targeted with state-sponsored malware attacks and 'massive damage' done to a German steelworks, you have to ask yourself whether it is likely that a train signal system would be any better defended?\" he asked.</p>", "<p>\"The most obvious danger is going to be human.</p>", "<p>\"The risk is that staff will either be deliberately and clandestinely assisting attackers or - most likely - make poor decisions, such as plugging in a device that is malware-infected that could expose the system's security.\"</p>", "<p>Prof Stupples said he was working with Cranfield University to develop a security system that would tell when a train or other mode of transport was acting oddly.</p>", "<p>\"It would take it back into a safe state,\" he explained.</p>"], "link": "http://www.bbc.co.uk/news/technology-32402481#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa"},
{"category": ["gaming"], "category2": ["business"], "author": [], "headline": ["Valve boss responds on game 'mod' row"], "image": ["http://ichef.bbci.co.uk/news/200/media/images/82597000/jpg/_82597677_bc56047c-ed36-487e-8547-bbb2c198a122.jpg"], "content": ["<p class=\"story-body__introduction\">Valve boss Gabe Newell has defended the company's decision to let developers of some game modifications or 'mods' charge for their creations.</p>", "<p>The decision provoked strong criticism on social media and in the forums of Valve's Steam game service.</p>", "<p>Mr Newell said Valve was keeping an eye on the early days of the system to make sure it worked well.</p>", "<p>One early change would give mod makers more control over what they charge for their code.</p>", "<p>Mods add all kinds of extras to games, including weapons, armour and pets. The most ambitious add new enemies and even entire levels.</p>", "<p>\"Our goal is to make modding better for the authors and gamers,\" <a href=\"https://www.reddit.com/r/gaming/comments/33uplp/mods_and_steam/\" class=\"story-body__link-external\">wrote Mr Newell in the Reddit Q&amp;A</a>. \"If something doesn't help with that, it will get dumped.\"</p>", "<p>He said one of the first changes would be the introduction of an option that lets mod authors put a donate button on their code. In addition, Valve would also stop deleting discussions about the issue on Steam forums.</p>", "<p>Prior to the change introduced last week, most of the mods made for games on Steam were free. Creators could only get paid if their mod was included in official features for a Valve game. </p>", "<p>The new system, introduced via the Steam Workshop, gives mod makers the opportunity to get paid by people who download and install their creation. The Elder Scrolls V: Skyrim was the first game for which paid mods were available. Other games are expected to follow.</p>", "<p>Many people criticised Valve for putting a price tag on something that had traditionally been free. Some said Valve's move was \"completely idiotic\" and would \"poison\" the modding world. </p>", "<p>In his defence, Mr Newell pointed out that Valve had a long history of supporting mods. For instance, he said, many of the company's core developers started out making extras and add-ons for earlier games. In addition, some of Valve's most popular titles started as mods to existing titles. </p>", "<p>\"Right now I'm more optimistic that this will be a win for authors and gamers, but we are always going to be data driven,\" he said.</p>", "<p>\"As a baseline, Valve loves mods (see Team Fortress, Counter-Strike, and Dota),\" wrote Mr Newell. \"The open nature of PC gaming is why Valve exists, and is critical to the current and future success of PC gaming.\"</p>", "<p>Many contributors to the Reddit thread were unhappy with the way cash for Skyrim mods was being split between makers, Valve and studio Bethesda who created the original game. Currently, 75% of the cash goes to Valve and Bethesda, with the last quarter going to the developer.</p>", "<p>Mr Newell said the revenue split ratio was set by the original maker of a game, not Valve. The split could be different on other games.</p>", "<p>Other issues to do with quality control, content theft and refunds were not tackled by Mr Newell. He also did not comment on claims that some modders had lost access to other tools they relied on because those add-ons had become paid-for extensions.</p>"], "link": "http://www.bbc.co.uk/news/technology-32480606#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa"},
{"category": ["mobileTablet"], "category2": ["hardware"], "author": ["By Leo Kelion"], "headline": ["Lenovo and Acer smartphones pack huge batteries"], "image": ["http://ichef.bbci.co.uk/news/200/media/images/82596000/jpg/_82596321_0979e90d-83ab-4f63-bf9c-aab4545ab446.jpg"], "content": ["<p class=\"story-body__introduction\">Lenovo and Acer have both unveiled smartphones with much larger than normal batteries.</p>", "<p>A total of three devices from the two companies contain cells with 4,000 milliamp-hour (mAh) capacities.</p>", "<p>That is more than a third higher than the components used in Samsung and Apple's latest flagship phones.</p>", "<p>Customer surveys have repeatedly highlighted a desire for improved battery life at the top of shopper's most wished for smartphone features.</p>", "<p>But until now, batteries of this size have been more commonly found in tablets rather than 5.5in (14cm)-screened phones.</p>", "<p>\"People are constantly engaged with their screens and the screen uses the most power,\" explained Ben Wood from the tech consultancy CCS Insight.</p>", "<p>\"And the biggest challenge right now is that people are also consuming more video content, thanks to the spread of 4G networks, meaning phone battery life is really getting hammered.</p>", "<p>\"With the bigger brands people are willing to accept some trade-offs for the phones to appear as slim and slick as possible.</p>", "<p>\"But everyone else is looking for a way of trying to differentiate their devices. And Lenovo and Acer, in particular, have an eye on the business market where employers want their workers to be available for as many hours as possible.\"</p>", "<p>China-based Lenovo says its new K80 offers up to 33 hours of talk-time and its A5000 up to 35 hours. Both figures are based on the use of a 2G network, which is less energy-intensive than a 3G or 4G connection.</p>", "<p>Taiwan's Acer has yet to provide a comparable figure for its Liquid X2, which is also unusual for supporting up to three Sim cards at once.</p>", "<p>\"Following market feedback, we know that battery life is a priority for our customers,\" ST Liew, president of Acer's smartphone business division, told the BBC.</p>", "<p>\"The 4,000mAh battery is perfect for frequent travellers as it eliminates concerns regarding power, allowing users to be constantly connected whilst on-the-go without the need to carry a charger on a daily basis.\"</p>", "<p>The firms are not the first to use bigger lithium-ion batteries to make their phones stand out.</p>", "<p>Last year Motorola developed the Moto Maxx, ahead of its takeover by Lenovo. The handset features a 3,900 mAh battery, which the company said should allow it to survive two days between charges.</p>", "<p>And earlier this month Huawei announced the P8 Max with a 4,360mAh battery - although the size of the device's 6.8in (17.3cm) display means that many people would consider it more a call-enabled tablet than a phone.</p>", "<p>Some lesser-known handset-makers have opted to fit even bigger, bulkier parts. </p>", "<p>Philips's Android-powered Xenium W6610, released last year, has a 5,300mAh cell, allowing it to endure up to three days of heavy use. </p>", "<p>And the recently-released Elephone P5000 currently claims the lead with a 5350mAh battery, which the Chinese company says is large enough to let it stretch to four days of \"continuous use\".</p>", "<p>At a time when it has become the norm for manufacturers to build smartphones with non-removable batteries, it might be expected that those with bigger capacities would enjoy stronger sales.</p>", "<p>But one analyst said that despite what shoppers tell surveys, when it comes to buying a personal handset they tend to prioritise other issues such as photo quality, brand or cost.</p>", "<p>\"If a handset fails to last a minimum of a day then it won't sell, but once you get past that it doesn't really drive demand,\" said Tim Coulling from the market research firm Canalys.</p>", "<p>\"Most people have at least one opportunity to charge their phone within that time period and there is also a market in battery packs for power-users.</p>", "<p>\"The other thing is that the more battery life you have the more you end up using your phone anyway. It's like a pay cheque - no matter how much money you have you always spend it.\"</p>"], "link": "http://www.bbc.co.uk/news/technology-32479717#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa"},
{"category": ["software"], "category2": ["none"], "author": [], "headline": ["Grandmother denied $41.8m casino jackpot payout"], "image": ["http://ichef.bbci.co.uk/news/200/media/images/82590000/jpg/_82590801_82590126.jpg"], "content": ["<p class=\"story-body__introduction\">An 90-year-old woman from Illinois who thought she had won $41.8m (£27.6m) on a video penny slot machine, has been denied the bonus after losing a court case.</p>", "<p>Grandmother Pauline McKee was playing the Miss Kitty game at a casino when she won 185 credits, or $1.85. </p>", "<p>But a message appeared on screen saying she had also won a bonus worth $41,797,550.16.</p>", "<p>The casino refused to pay out, saying the award was a computer glitch.</p>", "<p>Ms McKee, who has 13 grandchildren, sued the casino but <a href=\"http://www.iowacourts.gov/About_the_Courts/Supreme_Court/Supreme_Court_Opinions/Recent_Opinions/20150424/14-0802.pdf\" class=\"story-body__link-external\">the Iowa Supreme Court eventually threw out her case</a>.</p>", "<p>\"I had my doubts from the start, because that's a lot of money for a penny machine,\" she told the <a href=\"http://www.chicagotribune.com/news/local/breaking/chi-iowa-casino-error-20150424-story.html\" class=\"story-body__link-external\">Chicago Tribune</a>. </p>", "<p>\"I was hoping to help my children out financially, but it wasn't meant to be.\"</p>", "<p>The casino argued that the on-screen rules clearly indicated that \"malfunction voids all pays and plays\".</p>", "<p>At the time of the dispute, the Iowa Racing and Gaming Commission (IRGC)  secured the machine and carried out an investigation, sending the hardware and software to an independent testing laboratory.</p>", "<p>The investigators found that the software was programmed to allow a bonus of up to $10,000, but they couldn't work how the multi-million bonus message had occurred.</p>", "<p>The machine's maker, Aristocrat Technologies, said it had been aware of this type of error in the display and suggested \"component degradation over time may increase the susceptibility to this rare occurrence\".</p>", "<p>The company had alerted casinos to the glitch in 2010 and recommended that they disable the bonus facility as a precautionary measure. The casino evidently had not done this.</p>", "<p>The IRGC concluded that the bonus display was \"not valid\" and that \"the slot machine game malfunctioned.\"</p>", "<p>Ms McKee sued the casino in 2012 claiming breach of contract and consumer fraud.</p>", "<p>The court unanimously sided with the casino in 2013, but the case dragged on when Ms McKee's lawyers argued that the IRGC had no jurisdiction in disputes between casinos and their patrons.</p>", "<p>They also questioned whether the machine had really \"malfunctioned\", as the IRGC had concluded, and whether she had really entered into a contract when playing the game.</p>", "<p>There have been similar cases in the US involving erroneous bonus displays.</p>", "<p>In 2009, a player \"won\" a bonus of $1m that had appeared on screen, only for a Mississippi court to throw out the claim.</p>", "<p>In this case, the game rules limited payouts to $8,000. </p>", "<p>The doughty Ms McKee saw her case finally rejected by the Iowa Supreme Court on 24 April.</p>"], "link": "http://www.bbc.co.uk/news/business-32479759#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa"}]