[{"category": ["software"], "category2": ["tvs"], "author": [" Matt Smith "], "headline": [" Is it Daenerys, or Daeneres? Microsoft Word knows, even if you don’t "], "image": ["http://icdn2.digitaltrends.com/image/game-of-thrones-seas5-015-640x0.jpg"], "content": ["<article class=\"m-content \" itemprop=\"articleBody\" data-scope=\"content\"> <p>In an interview with Conan O’Brien last year, George R.R. Martin let slip that he uses a word processor from the 1980s, WordStar 4.0, to write his famous fantasy series. The main reason for this? Spellcheck. With names like Daenerys, Targaryen and Clegane flying about, a modern program’s spell-checking feature can become quite the frustration for an author looking to create an authentic fantasy settings.</p> <p>Martin may no longer have reason to fear Office, though, as the world’s most popular word processor now recognizes <em>most</em> names from the <em>Game of Thrones</em> universe. These include fan favorites like Daenerys, Tyrion and Arya, among many others. Only minor characters are left out, such as Mossador, Gared and Mycah.</p> <p>You might think this would be common, but in fact the breadth of Office’s love for the <em>A Song of Ice and Fire</em> series is unusual. Fans of <em>The Lord of the Rings</em> have long had to deal with the fact important characters like Gimli and Arwen aren’t recognized. You’ll also see red squiggles under Star War’s most famous bounty hunters, Boba Fett and Greedo. In fact, no other work of science fiction or fantasy has more names recognized by Microsoft Office.</p> <p><strong>Related</strong>: <a href=\"http://www.digitaltrends.com/movies/the-first-four-episodes-of-game-of-thrones-season-5-leak-online/\">Episodes from Game of Thrones’ fifth season leak online</a></p> <p>Microsoft, <a href=\"http://www.slate.com/blogs/future_tense/2015/04/24/microsoft_word_recognizes_the_spelling_of_game_of_thrones_characters_names.html?wpsrc=fol_tw&amp;linkId=13787530\" target=\"_blank\">in an official response</a>, has made it clear that this isn’t just an easter egg. The company stated “we regularly update the spellers to keep them fresh, including additions from the latest, most frequent names from movies, books, and TV shows.” But why do so many names in Martin’s books appear, while some characters from other fantasy words are left out? This apparently has to do with the “data sources” that Microsoft combs when considering words to add to its dictionary. The company didn’t reveal what those sources are, but apparently the recent surge in popularity of <em>A Song of Ice and Fire</em> was noticed as it combed for words to add.</p> <p>That’s unlikely to lure Martin to a newer machine — it doesn’t solve the problem for new characters and locations, after all — but it’s good news for anyone planning to write their own recap, review or fan-fiction based on the popular books or TV series. The word processor will even correct you, if you happen to miss-spell Daenerys as Daynerys, Daeneri, or some other combination. That’s sure to save you from some nasty comments.</p> </article>"], "link": "http://www.digitaltrends.com/computing/game-of-thrones-microsoft-word-spellcheck/"},
{"category": ["tvs"], "category2": ["none"], "author": [" Rick Marshall "], "headline": [" Here’s the first look at Jared Leto as The Joker "], "image": ["http://icdn5.digitaltrends.com/image/jared-leto-joker-640x0.jpg"], "content": ["<article class=\"m-content \" itemprop=\"articleBody\" data-scope=\"content\"> <p>After a series of teases via Twitter, <em>Suicide Squad</em> director David Ayer and Warner Bros. Pictures finally released the first official image of Jared Leto’s version of The Joker as he’ll appear in the film.</p> <p>Ayer posted the photo to Twitter on Friday, the 75th anniversary of Joker’s first appearance in comics (in the April 25, 1940, issue of <em>Batman</em> #1) and it’s an understatement to say that the new version of Batman’s arch enemy is a significant departure from what we’ve seen in comics and movies so far.</p> <blockquote class=\"twitter-tweet\" width=\"500\"><p>The Suicide Squad wishes you a Happy Anniversary Mr. J! <a href=\"https://twitter.com/hashtag/Joker75?src=hash\">#Joker75</a> <a href=\"https://twitter.com/hashtag/SuicideSquad?src=hash\">#SuicideSquad</a> <a href=\"https://twitter.com/WarnerBrosEnt\">@WarnerBrosEnt</a> <a href=\"https://twitter.com/DCComics\">@DCComics</a> <a href=\"http://t.co/LZXz0x947Q\">pic.twitter.com/LZXz0x947Q</a></p> <p>&amp;mdash; David Ayer (@DavidAyerMovies) <a href=\"https://twitter.com/DavidAyerMovies/status/591761248859123713\">April 25, 2015</a></p></blockquote> <p><script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></p> <p>Covered in tattoos — many of them featuring artwork from Joker’s comic-book appearances — and offering a grin ornamented by a grill of silver caps on his front teeth, Leto’s Joker seems to share only the pale skin and green hair of previous iterations, and it remains to be seen how his characterization will compare with the iconic interpretations of the character produced by Jack Nicholson, Heath Ledger, and Cesar Romero over the years. It’s also unknown what role Joker will play in the film, which follows a group of DC Comics supervillains who are forced to undertake dangerous missions for a secret government agency.</p> <p>As is so often the case these days, the image spawned a flood of photoshopped parodies, memes, and commentary on social media in the 48 hours after it arrived online.</p> <p>Leto’s pose in the photo was frequently compared to Macauley Culkin’s famous <em>Home Alone</em> image.</p> <blockquote class=\"twitter-tweet\" width=\"500\"><p>I don&amp;#39;t like the direction <a href=\"https://twitter.com/wbpictures\">@wbpictures</a> is going with <a href=\"https://twitter.com/hashtag/JaredLeto?src=hash\">#JaredLeto</a> and <a href=\"https://twitter.com/hashtag/TheJoker?src=hash\">#TheJoker</a> <a href=\"https://twitter.com/hashtag/SuicideSquad?src=hash\">#SuicideSquad</a> <a href=\"https://twitter.com/hashtag/DCComics?src=hash\">#DCComics</a> <a href=\"https://twitter.com/hashtag/HomeAlone?src=hash\">#HomeAlone</a> <a href=\"http://t.co/BAoVYWuZTE\">pic.twitter.com/BAoVYWuZTE</a></p> <p>&amp;mdash; Michael Fewx (@Fewxie) <a href=\"https://twitter.com/Fewxie/status/591783084858552321\">April 25, 2015</a></p></blockquote> <p><script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></p> <p>While others had some fun with Joker’s fondness for ink.</p> <blockquote class=\"twitter-tweet\" width=\"500\"><p>I don&amp;#39;t know what everyone is upset about. That new Joker looks awesome. <a href=\"http://t.co/XisqKWeLU2\">pic.twitter.com/XisqKWeLU2</a></p> <p>&amp;mdash; Brian Altano (@agentbizzle) <a href=\"https://twitter.com/agentbizzle/status/591802468700266496\">April 25, 2015</a></p></blockquote> <p><script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></p> <p>And some even pondered what this could mean for Ben Affleck’s interpretation of Batman in the film.</p> <blockquote class=\"twitter-tweet\" width=\"500\"><p>First the picture of the new Joker and now the new Bruce Wayne? Amazing: <a href=\"http://t.co/xi997gBwsY\">pic.twitter.com/xi997gBwsY</a></p> <p>&amp;mdash; Jason Anarchy (@DrinkingQuest) <a href=\"https://twitter.com/DrinkingQuest/status/591818257063084033\">April 25, 2015</a></p></blockquote> <p><script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></p> <p>There were yet others who tried to offer some context for Leto’s version of Joker in the over-arching history of the character.</p> <blockquote class=\"twitter-tweet\" width=\"500\"><p>This pretty much sums it up <a href=\"https://twitter.com/hashtag/Joker?src=hash\">#Joker</a> <a href=\"http://t.co/VlHbOj6Bf2\">pic.twitter.com/VlHbOj6Bf2</a></p> <p>&amp;mdash; Connor McLeod (@Connor_Mcleod27) <a href=\"https://twitter.com/Connor_Mcleod27/status/591921533045596160\">April 25, 2015</a></p></blockquote> <p><script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script></p> <p>Although the general reaction to Leto’s version of Joker hasn’t been altogether positive, it’s worth noting that the initial response to Ledger’s version of Joker from <em>The Dark Knight</em> wasn’t wholly positive, either — and we know how that turned out. Still, with the studio’s take on Superman in <em>Man Of Steel</em> already a polarizing topic among hardcore and mainstream fans alike, it’s quickly becoming clear that Warner Bros. is more than willing to challenge what we know — and will accept — from our favorite DC Comics heroes and villains.</p> <p>Written and directed by David Ayer, <em>Suicide Squad</em> is scheduled to hit theaters August 5, 2016.</p> </article>"], "link": "http://www.digitaltrends.com/movies/jared-leto-joker-suicide-squad-2/"},
{"category": ["hardware"], "category2": ["business"], "author": [" Jenny McGrath "], "headline": [" New rumors about the Tesla home battery’s price and leasing program "], "image": ["http://icdn6.digitaltrends.com/image/tesla-home-battery-640x0.jpg"], "content": ["<article class=\"m-content \" itemprop=\"articleBody\" data-scope=\"content\"> <p>Though the U.S. installed 30 percent more solar photovoltaics in 2014 than it did in the previous year, according to the <a href=\"http://www.seia.org/research-resources/solar-market-insight-report-2014-q4\" target=\"_blank\">Solar Energy Industries Association</a>, they still only account for <a href=\"http://www.eia.gov/tools/faqs/faq.cfm?id=427&amp;t=3\" target=\"_blank\">0.4 percent</a> of electricity generated in the United Sates. Part of the problem is the current state of battery technology, which makes storing electricity generated by renewable energy sources a problem. With Tesla’s upcoming April 30 announcement, the company is expected to introduce a battery that will help homeowners store 10- to 15-kilowatt-hours of energy.</p> <p>Solar panels absorb light during the day, and power companies buy the excess from homeowners with panels who have no way to store it. But that means that nighttime energy use has to come from another source, typically whatever the local power company uses: nuclear, coal, hydro, etc. A battery that could store the energy the photovoltaics capture during the day would improve the cost-benefit analysis of installing the panels for a typical U.S. home, which uses around 30-kilowatt-hours of electricity <a href=\"http://www.eia.gov/tools/faqs/faq.cfm?id=97&amp;t=3\" target=\"_blank\">per day</a>. While the price of solar energy systems dropped between 12 and 15 percent in 2013, there’s still a ways to go before meeting the <a href=\"http://energy.gov/eere/sunshot/mission\" target=\"_blank\">Department of Energy’s SunShot Initiative’s</a> goal of $0.06 per kilowatt-hour for total installation cost.</p> <p><strong> Related: </strong><a href=\"http://www.digitaltrends.com/cars/google-sees-ride-sharing-as-key-to-driverless-car-market/\">Google sees ride sharing, solar power in the future of its self driving car</a></p> <p>While the details of the Tesla announcement are still under wraps, the $13,000 batteries may actually be available for lease instead of purchase, according to <a href=\"http://www.theguardian.com/technology/2015/apr/25/tesla-battery-home-elon-musk\" target=\"_blank\">The Guardian</a>, who got the information from investment analyst Trip Chowdhry. Three-hundred customers of SolarCity, a company of which Tesla CEO Elon Musk is chairman and in which he holds a stake, were able to lease batteries with a 50-percent rebate, thanks to Pacific Gas &amp; Electric. Following a $1,500 initial payment, customers would make $15 monthly payments for 10 years before returning the battery to SolarCity.</p> <p>Whether or not Tesla decides to stick with this leasing plan when it rolls out the home battery to a wider audience remains to be seen. Stay tuned for more details when the company makes its announcement April 30.</p> </article>"], "link": "http://www.digitaltrends.com/home/tesla-may-lease-its-13000-home-battery/"},
{"category": ["software"], "category2": ["tvs"], "author": [" Steve Smith "], "headline": [" ESPN sues Verizon over FiOS custom TV plans "], "image": ["http://icdn5.digitaltrends.com/image/xbox-fios-mobile-interface-640x0.jpg"], "content": ["<article class=\"m-content \" itemprop=\"articleBody\" data-scope=\"content\"> <p>After we reported last week that Verizon had officially launched its FiOS custom TV platform with ESPN missing from the core package, it was only a matter of time before the Worldwide Leader in Sports got the lawyers involved.</p> <p>ESPN has decided to take legal action against Verizon over an alleged breach of contract. “Among other issues, our contracts clearly provide that neither ESPN nor ESPN2 may be distributed in a separate sports package,” the company said in a statement. “ESPN is at the forefront of embracing innovative ways to deliver high-quality content and value to consumers on multiple platforms, but that must be done in compliance with our agreements. We simply ask that Verizon abide by the terms of our contracts.”</p> <p><strong>Related: </strong><a href=\"http://www.digitaltrends.com/home-theater/verizon-custom-fios-tv-espn-complaint/\">Verizon launches cord cutter-aimed FiOS Custom TV amid ESPN backlash (Update)</a></p> <p>Verizon wants to add both ESPN channels as part of a $10 sports pack that customers will be able to add to their existing subscription. But since Disney, who owns ESPN, doesn’t want to unbundle the sports giant from other channels like ABC, History, and A&amp;E, they’re going to let the lawyers do the talking. They also have backup from Fox Sports and NBC, who’ve stated that they were unhappy with Verizon’s plans for allowing viewers to choose what channels they want based on what they actually watch.</p> <p>As for Verizon’s stance, Verizon CFO Francis Shammo had this to say on company’s earnings call, “It’s all about consumer choice. I mean, if you look at the TV bundles today, most people only on average watch 17 channels. So this a way to give consumers what they want on a choice basis.”</p> <p>If you’re still interested in the custom FiOS TV plan, it’s going to run you $54.99 a month, and will include two channel packs to choose from. Customers can mix and match packs from seven different genres, including Kids, Pop Culture, Lifestyle, Entertainment, and News &amp; Info, as well as Sports and Sports Plus. Each pack will have 10 to 17 channels.</p> </article>"], "link": "http://www.digitaltrends.com/movies/espn-sues-verizon-over-fios-custom-tv-plans/"},
{"category": ["hardware"], "category2": ["none"], "author": [" Aliya Barnwell "], "headline": [" SoloShot2 tripod can be your robot film crew "], "image": ["http://icdn6.digitaltrends.com/image/soloshot-dirtbike-640x0.jpg"], "content": ["<article class=\"m-content \" itemprop=\"articleBody\" data-scope=\"content\"> <p>You’re about to do something completely badass, or otherwise worthy of being filmed (since as they say, if there’s no picture, it didn’t happen). Or maybe you’re finally following your dream of becoming greater than Spielberg. Either way, that’s where the <a href=\"http://shop.soloshot.com/#\" target=\"_blank\">SoloShot2 </a>comes in. It’s a robot, and unless you hang out with professional cameramen, the SoloShot is a way better cameraman than any of your friends.</p> <p>In the most basic sense, SoloShot is a robotic camera base for a tripod that comes with a smart tag that the base can track. The base can pan 360 degrees at 80 degrees per second and tilt 140 degrees at 35 degrees per second, and can do all of this while following and focusing on the tag, which the video subject can simply strap on. Between 10 and 2,000 feet, the tag can be detected for automatic zoom. It’s also waterproof and shock resistant for extreme kayakers, swimmers, surprise rainstorms, and other wet conditions. The base <em>isn’t</em> waterproof or shock resistant, though, so treat it gently and keep it covered.</p> <a class=\"wp-image-756493\" href=\"http://icdn7.digitaltrends.com/image/soloshot-tag-830x533.jpg\"><img class=\"aligncenter size-full wp-image-756493\" src=\"http://icdn7.digitaltrends.com/image/soloshot-tag-830x533.jpg\" alt=\"Soloshot tag\" width=\"830\" height=\"533\"></a> <p>Up to 10 SoloShot bases and tags can be strung together to film multiple angles or subjects. Picture it — pun intended — as a robotic production crew that offers no complaints and requires no lunch breaks. You can also track multiple tags using one base.</p> <p>Using the Camera Controller accessory, the tag itself can act as a remote control. Change your zoom settings or toggle on and off from a distance. With DSLRs the tag can trigger burst shots of up to 45 seconds. SoloShot is also a great choice for nature studies or time-lapse photography; it’s perfect to set up in a blind to monitor animals that avoid people, and it’s easy to pre-program pan and tilt degrees over a given time period.</p> <a class=\"wp-image-756494\" href=\"http://icdn9.digitaltrends.com/image/soloshot-watersports-2-959x639.jpg\" style=\"width: 830px;\"><span class=\"zoom-button\"></span><img class=\"aligncenter wp-image-756494\" src=\"http://icdn9.digitaltrends.com/image/soloshot-watersports-2-959x639.jpg\" alt=\"soloshot watersports 2\" width=\"830\" height=\"553\"></a> <p>The SoloShot is darn cool, but it needs a camera to work. It supports up to 5 lbs, and the controller works with both <a href=\"http://www.soloshot.com/dslr-compatible-cameras/\" target=\"_blank\">DSLR </a>cameras and <a href=\"http://www.soloshot.com/help/cameracontrollerfirmware/\" target=\"_blank\">camcorders</a> with a standard quarter-inch tripod thread. If you don’t have a camera, you can get the SoloShot2 bundle that comes with a base and tag, a Sony CX405 Camcorder, a camera controller and a tripod.</p> <p>There are some limitations; the base has to be stationary, so no shots from a moving car or boat. It also won’t work inside; outdoor use only. Still, all the things SoloShot2 <em>can </em>do come in really handy for solo artists and extreme athletes who need an on-call cameraman.</p> <p>The bundle with everything is $650, and you can get different setups or buy additional bases, tags and controllers if you need them. Awesome SoloShot2 creations should be showing up on YouTube at any moment.</p> </article>"], "link": "http://www.digitaltrends.com/photography/soloshot-tripods-can-robot-film-crew/"},
{"category": ["hardware"], "category2": ["none"], "author": [" Jon Martindale "], "headline": [" Thermaltake water-cooling radiators wipe the sweat off your computer’s brow "], "image": ["http://icdn2.digitaltrends.com/image/radiators11-640x0.jpg"], "content": ["<article class=\"m-content \" itemprop=\"articleBody\" data-scope=\"content\"> <p>Although you may occasionally worry about whether your cooling system has sprung a leak, one of the best ways to build yourself a quiet, but high-performing gaming system is to use a water loop. If you decide to go down that road though, picking which components to use can lead you into a minefield of indecision, which may result in you just opting for a pre-built kit for convenience.</p> <p>Thermaltake is hoping that’s not a road you go down, as it’s announced two new ranges of WC radiators, designed with performance enthusiasts in mind.</p> <p>The first, the thinner range of R Series radiators – less that 50mm wide – is available in 120mm, 180mm, 240mm, 360mm, and 540mm sizes, the last of which should give plenty of surface area for heat dispersion. All of them use a single 13-set, flat-tube design.</p> <p>Related: <a href=\"http://www.digitaltrends.com/computing/heres-why-you-should-liquid-cool-your-cpu/\">Pipe dream: Watercooling your PC is finally cheap, quiet and easy</a></p> <p>The thicker Pacific RL range features a dual-row, 13-set, flat-tube system and comes in similar sizes, adding nuanced variants like the 420mm and 480mm radiators to the range. It also comes in a giant 560mm option, for those extra large cases.</p> <p>Both new ranges from Thermaltake feature G1/4″ threads and rigid connections which should make the system leak-resistant. The chief characteristic distinguishing these products from those of the firm’s competitors is that they were brazed at a temperature of 1022 degrees Fahrenheit, rather than soldered. According to the manufacturer, this should result in an even heat transfer from water to radiator, though of course how valid that is outside of TT’s own labs remains to be seen.</p> <p>Unfortunately there’s no announced pricing or availability information for these radiators, but judging by TT’s previous watercooling loops, expect the triple radiators to be at least $100, with the larger ones a reasonable chunk more.</p> </article>"], "link": "http://www.digitaltrends.com/computing/thermaltake-radiators-high-watercooling/"},
{"category": ["gaming"], "category2": ["software"], "author": [" Brad Bourque "], "headline": [" Three years after the announcement of Steam for Linux, the platform is still growing "], "image": ["http://icdn2.digitaltrends.com/image/steamlinux-640x0.jpg"], "content": ["<article class=\"m-content \" itemprop=\"articleBody\" data-scope=\"content\"> <p>It used to be that Windows was essentially the only option for computer gaming. Then, three years ago, Valve announced SteamPlay, and Mac OS X and Linux were able to join in on the Steam-powered fun too. As hordes of Linux-powered gamers flocked to games like <em>Team Fortress 2</em> and <em>Garry’s Mod</em> as they found their way onto the new OS,<em> </em>it was clear that Valve was onto something, and all of a sudden gaming without Windows was tangible, and very exciting.</p> <p>New adoption of a platform is always a bit of a “chicken or the egg” problem, where game companies won’t develop for Linux since there’s a distinct lack of video card drivers, but video card manufacturers won’t work on drivers, since there aren’t any games to be played. Steam spurred the whole process on though, by releasing a slew of its most successful games, notably the free-to-play <em>Team Fortress 2. </em>The Linux crowd is enthusiastic and eager to get software running on their systems, which led to more user-driven support and drivers for hardware to be ported over.</p> <img class=\"aligncenter size-large wp-image-558823\" src=\"http://icdn2.digitaltrends.com/image/counterstrike-3-640x640.jpg\" alt=\"CounterStrike 3\" width=\"640\" height=\"426\"> <p>Today, there are over 1,100 Linux-compatible titles on the Steam Marketplace – among them are some of the most popular games on Steam, including entries in the Portal, Counter-Strike, and Borderlands series<em>. </em>This massive expansion of games that work on non-Windows platforms has even inspired Valve to create their own Linux distribution, SteamOS, with Big Picture as the main UI, and a standard desktop underneath for when you put down the controller for a keyboard and mouse.</p> <p>We’ve seen several iterations of the Debian Wheezy-based SteamOS platform come and go since its announcement. Although it has limited hardware and game compatibility, you can download the beta to see the living room version of Steam and Big Picture in action, as well as run many of your favorite games. It’s been awhile since the announcement though, and some glaring issues have pushed hardware manufacturers prepping Steamboxes to install Windows on them and sell them anyway.</p> <a class=\"wp-image-728850\" href=\"http://icdn4.digitaltrends.com/image/steamvr-750x427.jpg\" style=\"width: 640px;\"><span class=\"zoom-button\"></span><img class=\"aligncenter size-large wp-image-728850\" src=\"http://icdn4.digitaltrends.com/image/steamvr-640x640.jpg\" alt=\"steamvr\" width=\"640\" height=\"364\"></a> <p>With SteamPlay for Linux finally hitting its stride, there’s a prime opportunity for Valve, and gamers, to get outside of the Microsoft ecosystem that’s kept gaming in its pocket for so many years. They may never totally escape, mostly due to the ingrained use of DirectX in big gaming companies, but smaller game companies, and developers who rely on Source for their engine, already have an easy time porting over to the Linux.</p> <p>Valve has repeatedly shown that it listens to its users, and responds quickly to their support (or lack thereof) for an idea. In this case, the demand has been for continued expansion of the Linux offerings on Steam, and developers have heeded the call. We hope they’ll continue to do so.</p> </article>"], "link": "http://www.digitaltrends.com/computing/steam-linux-three-years/"},
{"category": ["hardware"], "category2": ["none"], "author": [" Brad Bourque "], "headline": [" Leaked table of Intel’s sixth-generation processors packs few surprises "], "image": ["http://icdn2.digitaltrends.com/image/intel-logo-3-640x0.jpg"], "content": ["<article class=\"m-content \" itemprop=\"articleBody\" data-scope=\"content\"> <p>While Broadwell chips have barely found their way into the newest computers, rumors are spreading that Intel is already preparing to release their next major product, Skylake. These chips will bring new performance levels, and according to Chinese blog <a href=\"http://benchlife.info/will-support-ddr4-and-ddr3l-10-skylake-model-confirm-and-hand-on-04232015/\" target=\"_blank\">Benchlife</a>, will launch with a small run of Core i5 and Core i7 processors in three different power ratings.</p> <p>Following the same naming convention they’ve used for the last few generations of Intel Core chips, the Skylake processors have a few different variations. The first is the T line, like the Intel Core i5-6600T, which is designed for ultra-low power consumption, the kind you might find in a home theater PC. These are rated for a thermal design power of 35 watts.</p> <p><strong>Related</strong>: <a href=\"http://www.digitaltrends.com/computing/intel-core-m-efficiency-notebook-tested/\">Testing the battery life of Intel’s Core M processors</a></p> <p>The standard run of chips don’t have a letter at the end, and are mostly standard desktop chips that target a 65 watt TDP. For enthusiasts looking for a bit more punch Intel offers the K series, which is unlocked out of the box, so you can overclock them from the BIOS easily. These have a TDP of 95 watts.</p> <a class=\"wp-image-756819\" href=\"http://icdn4.digitaltrends.com/image/skylake-974x356.jpg\" style=\"width: 640px;\"><span class=\"zoom-button\"></span><img class=\"aligncenter size-large wp-image-756819\" src=\"http://icdn6.digitaltrends.com/image/skylake-640x640.jpg\" alt=\"skylake\" width=\"640\" height=\"233\"></a> <p>Back in 2007, Intel decided to follow what they called a new “tick-tock” business model. In this release plan, each “tick” steps down the size of a chip to a smaller die size, sometimes adding new processing power, but mostly focusing on shrinking the processor’s physical size. Each “tock” changes the micro-architecture of the chip, usually bringing new features and faster speeds, without changing the size from the previous model.</p> <p><strong>Related: </strong><a href=\"http://www.digitaltrends.com/computing/analyst-predicts-intel-new-methods-moores-law/\">Intel may introduce quantum wells to enforce Moore’s Law</a></p> <p>While the Broadwell chips brought down the size of Haswell-era processors, Skylake chips will be based off an updated design. That should mean markedly increased performance, and new functionality, including support for DDR4 and RAM in a wide variety of systems. What else the new Skylake architecture will bring remains to be seen, but according to Benchlife, the chips will be officially announced at the Intel Developer Forum in August of this year, so we don’t have long to wait to find out.</p> </article>"], "link": "http://www.digitaltrends.com/computing/intel-skylake-leak/"},
{"category": ["gaming"], "category2": ["software"], "author": [" Brad Jones "], "headline": [" See the minimum system requirements for Call of Duty: Black Ops III "], "image": ["http://icdn6.digitaltrends.com/image/black-ops-iii-640x0.png"], "content": ["<article class=\"m-content \" itemprop=\"articleBody\" data-scope=\"content\"> <p>Following months of speculation as to the future of the franchise, last week saw Treyarch officially unveil <em>Call of Duty: Black Ops III</em> with an <a href=\"http://www.digitaltrends.com/gaming/cod-black-ops-3-teaser-ember/\">intriguing reveal trailer</a>. Now, the developers have released the minimum system specifications for the title’s PC release.</p> <p>The timing of this information being might raise a few eyebrows — it’s a little early, considering the game isn’t scheduled to release until November. However, the reasoning behind the decision to share the required specifications now is likely linked to plans for a multi-player beta ahead of the title’s release.</p> <p>Here’s what you’ll need to play:</p> <ul> <li><strong>OS:</strong> Windows 7 64-Bit / Windows 8 64-Bit / Windows 8.1 64-Bit</li> <li><strong>Processor:</strong> Intel Core i3-530 @ 2.93 GHz / AMD Phenom™ II X4 810 @ 2.60 GHz</li> <li><strong>Memory:</strong> 6 GB RAM</li> <li><strong>Sound Card:</strong> DirectX Compatible</li> <li><strong>Video Card:</strong> GeForce GTX 470 @ 1GB / Radeon HD 6970 @ 1GB</li> <li><strong>DirectX:</strong> Version 11</li> <li><strong>Network:</strong> Broadband Internet connection</li> </ul> <p>This information isn’t all too surprising, as for the most part the specifications are in line with those required for the last installment in the series, <em>Advanced Warfare</em>. Since that title was the franchise’s real debut on the PlayStation 4 and Xbox One after the cross-platform <em>Ghosts</em>, it follows that <em>Black Ops III</em> wouldn’t offer as great an improvement under the hood.</p> <p><strong>Related: </strong><a href=\"http://www.digitaltrends.com/gaming/deus-ex-mankind-divided-news/\"><em>Deus Ex: Mankind Divided</em> is coming soon to PlayStation 4, Xbox One, and PC</a></p> <p>Compared to this year’s releases, the new Call of Duty stands out for its hefty memory requirements. <em>Mortal Kombat X</em> and <em>Grand Theft Auto V</em> are similar in terms of being high-profile console titles ported to the PC, but they only require 3GB and 4GB respectively, compared to the 6GB needed for <em>Black Ops III</em>.</p> <p><em>Black Ops III</em> is the first Treyarch-developed <em>Call of Duty</em> title since <em>Black Ops II</em> released in 2012. It’s expected to contain the series’ biggest Zombies mode to date, as well as some of the exo-suit gameplay mechanics introduced in last year’s <em>Advanced Warfare</em>.</p> <p><em>Call of Duty: Black Ops III</em> is expected to release on November 6, 2015.</p> </article>"], "link": "http://www.digitaltrends.com/computing/see-minimum-system-requirements-call-duty-black-ops-iii/"},
{"category": ["tvs"], "category2": ["none"], "author": [" Drew Prindle "], "headline": [" Cut the cord with confidence: Here are the best media streaming sites "], "image": ["http://icdn2.digitaltrends.com/image/best-media-streaming-services-3-970x0.png?ver=2"], "content": ["<article class=\"m-content \" itemprop=\"articleBody\" data-scope=\"content\"> <p>Streaming movies and TV shows from the internet has caught on fast. There’s no shortage of content to stream these days, and there are tons of different services out there vying for your attention. But with so many services out there offering up am ever-evolving slew of programming, how do you know which one to subscribe to?</p> <p>This article is intended to be a concise comparison of some of the top streaming services available. Below, you’ll find them stacked against each other and compared in the areas of content selection, pricing, and availability to help you find the service that best suits your needs.</p> <p><strong>Related: </strong><a href=\"http://www.digitaltrends.com/home-theater/netflix-hulu-plus-amazon-instant-video/\">Battle of the streaming giants: Netflix vs. Amazon Instant vs. Hulu Plus </a></p> <div class=\"item-grid cols-1\"> <div> <h3><a href=\"https://www.netflix.com/us-en/\" target=\"_blank\">Netflix</a></h3> <img class=\"aligncenter wp-image-754867 size-full\" src=\"//s3.amazonaws.com/digitaltrends-uploads-prod/2015/04/netflix-header-pic-2.png\" alt=\"Netflix Browse Screen\" width=\"970\" height=\"647\"> <p>We’ll start with the obvious. Even if you were living in a cave for the past decade, you probably still had Netflix deliver DVD’s to your stone mailbox. Back in 1997, that’s exactly how the company got its start, but after realizing that physical media was dying off, it rapidly adapted its business model to focus more on instantly-available streaming content. The company has been king of the media streaming jungle ever since.</p> <p><strong>Content</strong>: Netflix doesn’t specify the number of movies and shows available in their library beyond just saying that it numbers in the thousands, which is vague, but nonetheless accurate. Netflix has the most robust content library of any streaming service out there. The selection leans more toward feature-length movies, but its collection of TV shows is constantly growing and improving. Netflix even offers its own highly successful TV shows, including <em>Orange Is the New Black</em>, and <em>House of Cards. </em>2015 promises even more from Netflix, with successful productions of <em>Bloodline </em>and <em>Daredevil</em>.</p> <p><strong>Price</strong>: Netflix streaming service starts at $9 a month for new customers, and also gives you the option to get physical DVD’s sent to your mailbox one at a time for the same price – but seriously, who wants to do that anymore? Netflix also offers a $12 “platinum plan,” which unlocks Netflix’s growing collection of 4K content, and expands the number of devices that can stream at once to four.</p> <p><strong>Availability</strong>: Hardware compatibility is off the charts high. Because Netflix got into the streaming game early, it’s been picked up by all kinds of devices. You can get it on everything from gaming consoles, to streaming boxes, to your smartphone. Nearly every mainstream app store has a Netfilx app.</p> <p><strong>Verdict</strong>: Netflix is a solid choice. The content selection continues to grow over time with a good number of new releases each week. The library of TV shows isn’t as robust as what you’ll find on Hulu, but Netflix is completely ad-free.</p> </div> <div> <h3><a href=\"http://www.amazon.com/gp/video/primesignup?tag=googhydr-20&amp;hvadid=43548486648&amp;hvpos=1t1&amp;hvexid=&amp;hvnetw=g&amp;hvrand=11942854126565821900&amp;hvpone=&amp;hvptwo=&amp;hvqmt=b&amp;hvdev=c&amp;ref=pd_sl_9lkx4do8le_b\" target=\"_blank\">Amazon Prime Instant Video</a></h3> <img class=\"aligncenter wp-image-754852 size-full\" src=\"//s3.amazonaws.com/digitaltrends-uploads-prod/2015/04/amazon-header-pic-1.png\" alt=\"Amazon Prime Instant Video Browse\" width=\"970\" height=\"647\"> <p>Amazon: it started with selling books online, and now it’s the Walmart of the Internet. Amazon sells everything, and a few years ago the company broke into the media streaming market with Amazon Prime Instant Video.</p> <p><strong>Content: </strong>Amazon’s streaming site started off as a pay-per-view service, but as it gained traction, it expanded to include subscription-based on-demand video streaming to Amazon Prime subscribers. The library used to be small in comparison to that of Netflix, but recently Amazon has been using its industry clout to sign partnerships with companies like Epix and Warner Bros. The content library has ballooned as a result and includes Amazon Studio exclusives like <em>Alpha House </em>and <em>Transparent.</em></p> <p><strong>Price</strong>: Amazon Prime Instant Video comes as part of the Amazon Prime bundle, which costs either $99 a year or $8.25 per month. If you order a lot of merchandise from Amazon, Prime is a no-brainer. In addition to the streaming services, you also get free two-day shipping on your Amazon orders. This is easily the best deal in the bunch, even if you don’t order stuff from Amazon.</p> <p><strong>Availability</strong>: APIV is available on most major set-top streaming boxes, as well as most major gaming consoles, tablets, and smartphones.</p> <p><strong>Verdict</strong>: Amazon puts pretty much everything at your fingertips – whether it’s instant streaming content, pay-per view movies and shows, or digital media you can buy and own. Based on how quickly Amazon’s service has grown in the past year alone, it’s likely that APIV will continue to expand its content library and availability to rival or surpass that of Netflix. Time will tell.</p> </div> <div> <h3><a href=\"http://www.hulu.com/plus/specialoffer1?cmp=5373&amp;mkwid=PpepViYq&amp;pcrid=66213213875&amp;utm_source=google&amp;utm_campaign=BND%7CCore%7CHulu+Plus&amp;utm_medium=cpc&amp;utm_term=hulu%20plus&amp;gclid=CjwKEAjwjd2pBRDB4o_ymcieoAQSJABm4egobp7_ZhJ-d8Th5DMHLqWQE4W5ssEx_C6D5vetJKDQOBoC8tLw_wcB&amp;dclid=COnMzd2Hi8UCFQsWhQodqRcAaA\" target=\"_blank\">Hulu Plus</a></h3> <img class=\"aligncenter wp-image-754856 size-full\" src=\"//s3.amazonaws.com/digitaltrends-uploads-prod/2015/04/Hulu-Plus-header-pic-1.png\" alt=\"Hulu Plus Browse\" width=\"970\" height=\"647\"> <p>Hulu was created in 2007 as a joint venture between veteran media broadcasters NBC Universal, Fox Broadcasting, and Disney-ABC. The media streaming service was originally completely free, but rolled out subscription-based Hulu Plus after the service gained a massive following.</p> <p><strong>Content</strong>: Hulu has a modest selection of movies, but no other streaming service can hold a candle to its library of TV shows. Netflix and Amazon tend to get TV shows after the season ends, or after they’ve gone off the air completely – but Hulu, in addition to having a long list of older shows and programs, posts new episodes of shows currently playing on cable just days (and sometimes hours) after they air. The only downside is that even though you pay for Hulu Plus, you’ll still be forced to sit through ads.</p> <p><strong>Price</strong>: Hulu has tons of free content that might satisfy the needs of the occasional TV watcher, but if you want access to Hulu’s full and regularly-updated library of current shows, a Hulu Plus subscription is the only way to go. It’ll cost you $7.99 per month, which is considerably cheaper than cable, but it’s also generally a day or two behind.</p> <p><strong>Availability</strong>: Hulu is everywhere. You can get it on just about every set-top streaming box, internet-enabled TV, smartphone, or tablet.</p> <p><strong>Verdict: </strong>Hulu Plus is great for TV. You’ll get access to a Hulu’s large library of TV shows and even some full-length movies. And it’s constantly updating. Unlike Netflix and Amazon, the most recent TV show episodes usually appear on Hulu the day after airing.</p> </div> <div> <h3><a href=\"https://www.sling.com/\" target=\"_blank\">Sling TV</a></h3> <div class=\"m-credited-image alignnone\"> <a class=\"wp-image-715454\" href=\"http://icdn2.digitaltrends.com/image/dish-sling-tv-app-1500x1000.jpg?ver=4\" style=\"width: 970px;\"><span class=\"zoom-button\"></span><img class=\" wp-image-715454 aligncenter\" src=\"http://icdn2.digitaltrends.com/image/dish-sling-tv-app-1500x1000.jpg?ver=4\" alt=\"DISH-Sling-TV-app\" width=\"970\" height=\"647\" data-image-id=\"715454\"></a> <div class=\"m-image-credit\" data-image-id=\"715454\">Rich Shibley/Digital Trends</div> </div> <p>Sling is the newcomer to this bunch. Released in 2015 as a supplement to subscription sites like Hulu and Netflix, Sling will stream live TV from networks like ESPN, Comedy Central, AMC, and TNT. There’s no contract or cancellation fees.</p> <p><strong>Content: </strong>Originally for cord-cutters looking to gain access to ESPN without paying a cable subscription, Sling now has over 200 channels in 18 languages and is continually adding more. ESPN alone might be enough for sport fans to ditch their cable subscription. You can upgrade your subscription to include HBO Live to stream <em>Game of Thrones. </em></p> <p><strong>Price: </strong>Baseline services with Sling will cost you $20 per month. It’s significantly more expensive than Netflix and Amazon Instant, but far less expensive than regular cable subscriptions that’ll run you between $60-90 per month. You can add bundles of additional networks for $5 per package. HBO live will cost an additional $15.</p> <p><strong>Availability: </strong>Sling’s availability is limited. You can download the app and run it on your Amazon Fire TV Box and Stick and Roku TVs as well as most Apple devices running on iOS 7 or later, and the Xbox One.</p> <p><strong>Verdict: </strong>Sling is ideal for sports fans and cord cutters, but it’s not an alternative to your 85-channel cable subscription. However, those who just want ESPN and ESPN 2 without dropping a premium for cable, Sling TV is worth a shot, considering it doesn’t require signing any contract and offers a far lower price than traditional cable subscriptions.</p> </div> <div> <h3><a href=\"https://www.youtube.com/\" target=\"_blank\">YouTube</a></h3> <img class=\" size-full wp-image-754862 aligncenter\" src=\"http://icdn5.digitaltrends.com/image/youtube-header-pic-1-970x647.png\" alt=\"Youtube header pic 1\" width=\"970\" height=\"647\"> <p>Here’s a fun fact: YouTube was founded on Valentines Day in 2005 – which could be why everyone fell in love with it. Google bought the site for around 1.6 billion dollars just a year after its inception, and since then the simple video hosting service has amassed an unfathomably large user base. Just don’t read the comments.</p> <p><strong>Content:</strong> YouTube hosts just about everything that isn’t porn. You can find everything on here from small children pondering existentialism while loopy on nitrous oxide, to Joe Rogan’s reaction to two women eating each other’s excrement out of a cup. Sure, there’s a lot of junk and downright weird stuff on here, but the site also boasts a healthy library of both free and pay-per-view movies.</p> <p><strong>Price:</strong> YouTube is mostly free, but if you use the site’s video-on-demand service, you can expect to pay anywhere from $0.99 to $3.99 for each flick you rent. You’ll have 2 days to watch the movies once you start it, and every rental will expire after 30 days. Alternatively, you can also purchase movies from YouTube and have access to them forever. Purchase prices are generally as low as $9.99 and usually not higher than $19.99.</p> <p><strong>Availability:</strong> Absolutely everywhere. If it has a color display and can connect to the Internet, chances are good that it can play YouTube videos.</p> <p><strong>Verdict:</strong> There are going to be those nights when you can’t find anything to watch, so you just start YouTube’ing random topics that pop into your head. No matter how big the libraries of Netflix, Hulu, and Amazon get, they’ll never have trampoline accident compilations or footage of people lighting their farts on fire – and for those reasons, YouTube will always enjoy a spot on the video-streaming podium.</p> </div> <div> <h3><a href=\"http://www.apple.com/itunes/?cid=wwa-us-kwg-music-itu\" target=\"_blank\">iTunes</a></h3> <img class=\"aligncenter wp-image-754876 size-full\" src=\"//s3.amazonaws.com/digitaltrends-uploads-prod/2015/04/iTunes-header-pic-1.png\" alt=\"iTunes Browse\" width=\"970\" height=\"647\"> </div> <div> <h3><a href=\"https://play.google.com/store/movies?hl=en\" target=\"_blank\">Google Play</a></h3> <img class=\" size-full wp-image-755714 aligncenter\" src=\"http://icdn5.digitaltrends.com/image/google-play-header-pic-1-970x647.png\" alt=\"Google play header pic 1\" width=\"970\" height=\"647\"> <p>Google continues their quest for domination with Google Play. The media hub has a great selection of newly released movies and TV shows are usually available the day after airing. They’ve even been known to offer a free movie once in a blue moon. I downloaded the <em>Lord of the Rings: Fellowship of the Ring</em> for the great price of zero dollars. So keep your eye out.</p> <p><strong>Content: </strong>Google Play has a good selection of new releases. They’re also pretty good with current TV shows. Their on-demand format is similar to Vudu or iTunes, and at this point, Google Play is a great supplement to sites like Netflix and Amazon Instant Video.</p> <p><strong>Price: </strong>Renting a movie will cost $5 for HD and $4 for standard definition. With rentals, you’ll have two days to watch movies once you start it, and rentals will expire after 30 days. Buying movies will almost always cost less than $20 and you’ll have the option to stream in HD.</p> <p><strong>Availability: </strong>Google Play will stream in HD quality on every Android device running 4.0 or later. This includes the Android TV box and Android TV. It also works with Google Chromecast and Playstation 4. Other devices (including Apple products) can still stream movies from Google Play in SD.</p> <p><strong>Verdict: </strong>Google Play is great for new movies, but the fact that Google Play isn’t available on every device doesn’t bode well. The pay-per-content model is great for getting the newest releases but those rental fees will add up quick. But it’s a good place to start, if you’re looking for a movie. They often have killer deals.</p> <p>We’ve already covered services from Google, Amazon, and major TV broadcasters, so this list just wouldn’t be complete without any mention of Apple’s streaming service. Apple realized long ago that physical media was dying and was among the first companies to create a digital music storefront for MP3’s. Over the years, it quickly became clear that DVD’s would soon be a thing of the past and Apple started building its video library as well.</p> <p><strong>Content:</strong> iTunes has a solid collection of both movies and TV shows. You’ll find a good number of new releases in the store as well as a sizable library of older flicks and series that are no longer on the air.</p> <p><strong>Price:</strong> The iTunes Store operates on a pay-per-content model, so even though it has a large selection of media, you can expect to pay more here than you would for a subscription-based service. Apple gives you the option of renting or buying movies TV episodes, and if you know you’ll want to catch every episode of a particular show, you can purchase a MultiPass, which gives you access to one episode plus the next 15 episodes for a fixed price.</p> <p><strong>Availability</strong>: iTunes is a downloadable app for most mobile devices and computers, but is generally missing from any streaming box that isn’t an Apple TV.</p> <p><strong>Verdict</strong>: Apple scores big points for content selection and purchase options, but gets demerits for not being readily available on every device. The pay-per-content scheme also gets expensive if you consume a lot of movies and TV, so we suggest using iTunes to fill in the gaps left by Amazon, Netflix, and Hulu.</p> </div> <div> <h3><a href=\"http://www.vudu.com/\" target=\"_blank\">Vudu</a></h3> <img class=\" size-full wp-image-754879 aligncenter\" src=\"http://icdn3.digitaltrends.com/image/vudu-header-pic-1-970x647.png\" alt=\"vudu header pic 1\" width=\"970\" height=\"647\"> <p>Amazon may be the Walmart of the Internet, but that’s not stopping Walmart from getting in on the online streaming game. Vudu is Walmart’s pay-per-content store, and the brick-and-mortar behemoth is giving all it has to make sure that Vudu becomes a household name.</p> <p><strong>Content</strong>: Vudu has content comparable to what you’ll find on the YouTube or iTunes video marketplace. It’s a hodgepodge of movies and TV shows, but overall the content veers toward more feature-length movies. Walmart does a good job of offering new releases at around the same time that they come out on DVD. Vudu will also host any Ultra Violet digital copies that may be available with the movies you buy with a free digital locker service.</p> <p><strong>Price</strong>: Vudu is a pay-per content store, so you can expect to pay just as much for a digital movie rental as you would for a physical copy. Digital rentals typically start around $3.99, and go up from there depending on the video and audio quality you want. 1080p movies with Dolby Digital Plus surround usually go for $5.99</p> <p><strong>Availability</strong>: You can get Vudu on Xbox 360, Play Station 3, Mac, and just about any set-top streaming box. Vudu smartphone apps are also available on iOS, Android, and Windows Phone.</p> <p><strong>Verdict</strong>: Although it’s definitely not as good as the others listed on this page, it still makes the top five simply because it has more to offer than services like Epix and<br> Crackle, to which we’ll give an honorable mention.</p> </div> </div> <h3>Conclusion</h3> <p>Amazon and Netflix are definitely the two best choices for movie watchers, Hulu Plus is the undisputed winner when it comes to TV shows, and Sling TV is best for Live TV. We recommend a combination to get the most bang for your buck. Sports fans will want to combine Netflix or Amazon Instant with Sling TV, and if you’ve got stock in currently-airing TV, you’ll also want to consider Hulu Plus. There’s a bit too much of an overlap in content between Netflix and Amazon to make it sensible to subscribe to both.</p> <p>YouTube and iTunes are great for filling in the gaps. If you can’t find what you’re looking for in your subscription-based streaming library, there’s a high likelihood that you can find it in a pay-per content store like iTunes or Vudu. Mix and match TV streaming services for the best results!</p> <p><strong>Updated April, 22, 2015: </strong><em>This article has been updated since it was originally published to include Sling TV and reflect design and price changes in Netflix, Hulu, and Vudu. </em></p> </article>"], "link": "http://www.digitaltrends.com/home-theater/best-media-streaming-services-version-1429724876/"},
{"category": ["wearables"], "category2": ["none"], "author": [" Brian Heater "], "headline": [" What becomes of the Misfits and FitBits of the world after the Apple Watch? Apps. "], "image": ["http://icdn6.digitaltrends.com/image/wear-next-042515-970x0.jpg"], "content": ["<article class=\"m-content \" itemprop=\"articleBody\" data-scope=\"content\"> <div class=\"m-above-content-banner\"><a href=\"http://www.digitaltrends.com/topic/wear-next/\"><img src=\"http://icdn2.digitaltrends.com/image/url-5195eac47839a862e71bb9f732a9aa7d.png\" class=\"dt-above-content-banner\"></a></div><p>Last week I devoted <a href=\"http://www.digitaltrends.com/features/the-next-great-wearable-doesnt-need-to-do-more-it-needs-to-transform/\">a fair chunk</a> of column space to Misfit, suggesting the company’s modular approach to wearables was a bit ahead of its time. Later it the week, it made an unexpected move: <a href=\"http://blog.misfit.com/?p=1582\" target=\"_blank\">Misfit launched an app for the Apple Watch</a>.</p> <p>It caught me a bit off-guard. After all, isn’t fueling a competitor’s ecosystem counterproductive?</p> <div class=\"simplePullQuote h-nonessential\"><p>Early last year, FitBit made its app compatible with the iPhone, without the need for a separate band.</p> </div> <p>Not exactly. Wearables are still finding their groove with consumers, but some level of consolidation seems like a fairly reasonable bet in the months ahead. With the biggest names in consumer electronics currently battling it out in earnest, the harsh realities of capitalism mean that some of the current crop might not make it in the long run. Misfit was hedging its bets, and it’s not the only one.</p> <p>Early last year, FitBit made its app compatible with the iPhone, without the need for a separate band. Granted, the setup didn’t offer quite as many features as actually wearing a FitBit device, but it was hard not to view the move as sign of things to come.</p> <p>Later in the year, JawBone, which had its own successful UP line of fitness bands, announced compatibility with Android Wear. Fitness trackers aren’t direct competitors with smartwatches in terms of pricing, but the space they occupy appears to be steadily shrinking as more advanced wearables perform many of the same functions.</p> <h3>It’s not just a band, it’s an ecosystem</h3> <p>If modular wearables are the future, as I suggested last week, we can foresee a time when big, bulky wearables have gone the way of the dodo in favor of discreet, embedded sensors. Should that future come to fruition, the smartphone will likely continue to be the key piece to the puzzle. A variety of sensors collecting various bits of data across our bodies still require a device to serve as a mainframe. Misfit is once again taking things a step further by integrating aspects of home automation into its offering.</p> <a class=\"wp-image-756447\" href=\"http://icdn2.digitaltrends.com/image/misfitwatchapp_1-1500x1000.jpg\" style=\"width: 640px;\"><span class=\"zoom-button\"></span><img class=\"aligncenter size-large wp-image-756447\" src=\"http://icdn4.digitaltrends.com/image/misfitwatchapp_1-640x640.jpg\" alt=\"misfit apple watch app\" width=\"640\" height=\"426\"></a> <p>This is good news for smartphone makers, of course — and could also prove a boon for the company that is able to lock users into their wearable software ecosystem right now. Companies like FitBit, Misfit and Jawbone almost certainly don’t want us thinking about their current hardware offerings as the gateway to a software-focused future. They’d much rather convince you to purchase an activity tracker now with the assumption that the category will stick around for good.</p> <div class=\"simplePullQuote h-nonessential\"><p>How will fitness companies make money with apps?</p> </div> <p>Once you’ve picked one up, if you’re satisfied with the software experience, perhaps you’ll be a customer for life — even as the definition of what you’re consuming continually changes. After committing to a user-interface and a proprietary fitness social network, it’s that much more difficult to change allegiances — especially if that move means losing all of the fitness data you’ve been tracking over the years.</p> <p>There is some precedence for this. The e-reader market springs to mind. Look at companies like Kobo and Barnes &amp; Noble with the Nook, which branched out from devoted e-readers to software applications. Like fitness apps, these sync information across devices and operating systems, eventually freeing users to take advantage of their offerings without the need for e-readers at all, as they used the Kobo or Nook app on their smartphone or tablet.</p> <h3>Shaking the money out of an app</h3> <p>It’s not a one-to-one comparison, and the contrast does present some interesting questions, chief among them is monetization. For e-reader manufacturers, the money was never in the e-reader as much as it was in books – they earned a cut every time someone bought one.</p> <p>How will fitness companies make money with apps? There are a lot of possibilities. Advertising, in-app purchases and charging for the app all come to mind, but at the moment, none seem particularly plausible as a standalone revenue stream. The answer is, of course, data. Think about how much advertisers and research groups are willing to pay for user search and surfing analytics. Now imagine that kind of information in a real-world setting.</p> <div class=\"dtads-inject-hook\" style=\"display:none\"></div> <p>We’re talking about sensors tracking user movements, habits, location and all manner of different metrics feeding into a single app and database. It’s a sort of a holy grail for the companies out there currently looking to sell you things. The more you know about a consumer, the easier it is to make a sale — and this is about as close as we can come at the moment to cracking open a skull and reading what’s inside.</p> <p>This isn’t an attempt at fear mongering — the information will no doubt be gathered anonymously and many companies will almost certainly offer an opt-in, based on past and present privacy fears about data collection. But collecting data will almost certainly play a role in the business model of wearable companies moving ahead.</p> <p>Of course, all of that’s still a ways off. The fitness trackers still sell. But it’s easy to see how a confluence of factors could lead to a leveling off and the eventual erosion of the category, making room for future innovations in the space. And who can blame manufacturers for trying to get out in front of that curve?</p> </article>"], "link": "http://www.digitaltrends.com/wearables/why-fitbit-and-misfit-apps-will-save-them-from-smartwatches/"},
{"category": ["software"], "category2": ["mobileTablet"], "author": [" Andy Boxall ", " Malarie Gokey "], "headline": [" Android Lollipop updates: Samsung’s Galaxy Note 4 at T-Mobile gets Android 5.0 "], "image": ["http://icdn3.digitaltrends.com/image/android-lollipop-statue-970x0.jpg?ver=3"], "content": ["<article class=\"m-content \" itemprop=\"articleBody\" data-scope=\"content\"> <p>Android 5.0 Lollipop is here, and that means a mad scramble is on as manufacturers rush to update their existing phones to the new version of Google’s operating system. Well, “scramble” and “rush” may be relative terms here, since bringing out an update can be a plodding affair, sometimes taking months for it to show up.</p> <p>To make sure you’re fully informed, we’ve pulled together all the official news, and the rumors, concerning 5.0 Lollipop’s arrival on your smartphone or tablet of choice. Check it out below.</p> <p><em><strong>Updated on 04-27-2015 by Malarie Gokey:</strong> Added Lollipop upgrade news for the Samsung Galaxy Note 4 at T-Mobile.</em></p> <h3>Sony</h3> <a class=\"wp-image-653604\" href=\"http://icdn2.digitaltrends.com/image/sony-xperia-z3-colors-1000x667.jpg?ver=2\" style=\"width: 325px;\"><span class=\"zoom-button\"></span><img class=\"alignright wp-image-653604 size-medium\" src=\"http://icdn2.digitaltrends.com/image/sony-xperia-z3-colors-325x325.jpg?ver=2\" alt=\"Sony Xperia Z3 Colors\" width=\"325\" height=\"325\"></a> <p>In December, Sony confirmed its intention to start a wider Android 5.0 update soon. A tweet from the official Xperia account reiterated the company’s plan to bring Android 5.0 to the Xperia Z3 and the Xperia Z2 in early 2015. <a href=\"http://blogs.sonymobile.com/2015/03/16/starting-our-android-5-0-lollipop-rollout-xperia-z3-xperia-z3-compact/\" target=\"_blank\">Sony</a> quickly followed up on its promise with the announcement that Android 5.0 Lollipop is on its way first to Xperia Z3 and Z3 Compact phones in Europe, starting on March 16.</p> <p>The update will initially reach the Nordic and Baltic countries, and will then head out to all other Z3 owners. Sony also stated that the Xperia Z2 and other devices will get the update very soon now. You can check <a href=\"https://twitter.com/SonyMobileNews\" target=\"_blank\">Sony’s Twitter</a> account for updates.</p> <p><strong>Related:</strong> <a href=\"http://www.digitaltrends.com/mobile/google-nexus-2014-android-lollipop-revealed/\">Google goes Lollipop crazy with new Nexus hardware</a></p> <p>Sony has previously said that many of its premium models will eventually be updated to Android 5.0 Lollipop. It confirmed the following phones will be getting the new software: The Xperia Z, Xperia ZL, Xperia ZR, Xperia Z1, Xperia Z1S, Xperia Z Ultra, Xperia Z1 Compact, Xperia Z2, Xperia Z3, Xperia Z3V, and the Xperia Z3 Compact.</p> <p>The company is not avoiding its tablet duties either, and will bring Android 5.0 to the Xperia Tablet Z, the Xperia Z2 Tablet, and the new Xperia Z3 Tablet Compact. The Google Play Edition of the Xperia Z Ultra has already been updated.</p> <h3>Samsung</h3> <p>The first phone to get Lollipop in the U.S. was the Galaxy S5 sold through <a href=\"http://www.verizonwireless.com/support/knowledge-base-110458/\" target=\"_blank\">Verizon</a>. The carrier announced the update in early February, along with an explanation of the software’s new look and features. Verizon says the update should roll out to all S5 owners before the end of the month. Until then, all you can do is hit the refresh button repeatedly while you wait for the update to hit your device. <a href=\"http://www.verizonwireless.com/dam/support/pdf/system_update/benefits-galaxy-note-3-4-14-15.pdf?null\" target=\"_blank\">Verizon’s Galaxy Note 3</a> is also getting the update now.</p> <p>Galaxy S5 owners on T-Mobile’s network started receiving the upgrade to 5.0 in mid-February, according to <a href=\"http://www.tmonews.com/2015/02/android-5-0-lollipop-update-now-available-for-t-mobile-galaxy-s5/\" target=\"_blank\">TmoNews</a>. The new software is available as an over-the-air update that’s about 1GB in size. AT&amp;T owners of the Galaxy S5 and <a href=\"http://www.att.com/esupport/softwareUpdateArticle.jsp?sid=KB419415&amp;cv=820\" target=\"_blank\">Galaxy S4</a> also received Lollipop on April 7. That release was quickly followed by the introduction of the update for the <a href=\"http://www.att.com/esupport/softwareUpdateArticle.jsp?sid=KB425050&amp;cv=820\" target=\"_blank\">Galaxy S5 Active</a> and the <a href=\"http://www.att.com/esupport/article.jsp?sid=KB425941&amp;cv=820\" target=\"_blank\">Galaxy Alpha</a>. Around the end of April, the <a href=\"https://support.t-mobile.com/docs/DOC-16486\" target=\"_blank\">Galaxy Note 4</a> on the Uncarrier’s network also got Lollipop 5.0.</p> <p>Galaxy S5 owners throughout Europe are also slowly but surely receiving the Lollipop update, with the remaining U.S. phones close behind. The release will be dependent on the speed with which networks approve the new firmware.</p> <p><a href=\"http://www.android-hilfe.de/original-firmwares-fuer-samsung-galaxy-s4-i9505/662011-i9505-stock-rom-29-01-15-i9505xxuhoa7-5-0-1-a.html#post8612674\" target=\"_blank\">One German user</a> of the Galaxy S4 actually received the Lollipop update after he sent it in with a broken screen to get repaired by Samsung. Of course, the update isn’t available to most users, but this story is an indication it may hit Galaxy S4 handsets in Europe soon. The news was first spotted and translated into English by <a href=\"http://www.sammobile.com/2015/02/18/samsung-customer-care-in-germany-is-providing-android-lollipop-to-the-galaxy-s4/\" target=\"_blank\">SamMobile</a>.</p> <a class=\"wp-image-642409\" href=\"http://icdn2.digitaltrends.com/image/galaxy-s5-electric-blue-front-1000x667.jpg?ver=2\" style=\"width: 325px;\"><span class=\"zoom-button\"></span><img class=\"alignright wp-image-642409 size-medium\" src=\"http://icdn4.digitaltrends.com/image/galaxy-s5-electric-blue-front-325x325.jpg?ver=2\" alt=\"Galaxy S5 Electric Blue Front\" width=\"325\" height=\"325\"></a> <p>Galaxy Note 4 and Note Edge owners, get ready, because the Android 5.0 update for your phone has started to arrive. It’s now rolling out on the AT&amp;T and <a href=\"http://support.sprint.com/support/article/Find_and_update_the_software_version_on_your_Samsung_Galaxy_Note_4/WServiceAdvisory_542_GKB79435?INTNAV=SU:DP:OV:UG:SamsungGalaxyNote4:FindAndUpdateTheSoftwareVersionOnYourSamsungGalaxy\" target=\"_blank\">Sprint</a> versions of the Galaxy Note 4. Only <a href=\"http://www.droid-life.com/2015/03/24/att-galaxy-note-4-appears-to-be-receiving-update-to-lollipop/\" target=\"_blank\">some AT&amp;T users</a> are seeing the update, so stay patient as it makes its way to you. Previously, it was only sent out to Note 4 owners in Poland, according to a report from <a href=\"http://www.sammobile.com/2015/02/11/samsung-starts-lollipop-update-galaxy-note-4-sm-n910c-in-polen/\" target=\"_blank\">SamMobile</a>. The over-the-air update is likely to take several months to complete there. Manufacturers often send out software updates in stages to ensure everything is running correctly.</p> <p>In addition, some Galaxy Note Edge owners in Australia have spotted the Lollipop 5.0 update download available on their phones via an over the air update, reports <a href=\"http://www.sammobile.com/2015/02/17/samsung-galaxy-note-edge-starts-receiving-android-5-0-1-lollipop-ota-update-in-australia/\" target=\"_blank\">SamMobile</a>. So if you live in Australia, and you’ve got an Edge, you may indeed have an edge over other consumers. Check out your software update options to see if it’s come your way yet.</p> <p><a href=\"http://www.sammobile.com/2014/12/04/samsung-galaxy-s5-sm-g900f-receives-android-5-0-lollipop-update/\" target=\"_blank\">SamMobile</a> states Samsung has given its own Android user interface a visual makeover to bring it in line with Google’s Material Design, introduced with 5.0 Lollipop, plus a selection of new features.</p> <h3>LG</h3> <p><img class=\"alignleft wp-image-659638 size-medium\" src=\"http://icdn3.digitaltrends.com/image/lg-g3-press-hi-res-colors-970x646-c-325x325.jpg?ver=1\" alt=\"lg-g3-press-hi-res-colors-970x646-c\" width=\"325\" height=\"325\">LG’s Lollipop updates have finally made it to the four major U.S. carriers on its 2014 flagship device, the G3. The first update came from AT&amp;T for the LG G3, reported <a href=\"http://www.androidauthority.com/att-lg-g3-lollipop-update-586490/\" target=\"_blank\">Android Authority</a>. The over the air update is 689.53MB in size and rolled out to G3 owners as of February 10. <a href=\"http://www.att.com/esupport/softwareUpdateArticle.jsp?sid=KB423381&amp;cv=820#fbid=aGc4zyKo02f\" target=\"_blank\">AT&amp;T</a> also made the update available for the LG G2.</p> <p>Sprint also announced that the LG G3 is primed and ready to receive Android 5.0. <a href=\"http://newsroom.sprint.com/blogs/devices-apps-and-services/lg-g3-from-sprint-gets-android-lollipop-update.htm\" target=\"_blank\">According to the carrier</a>, Lollipop will be delivered as an over-the-air update to all G3 owners, though odds are the update will be staggered instead of delivered all at once. Sprint’s <a href=\"http://support.sprint.com/support/article/Find_and_update_the_software_version_on_your_LG_G2/WServiceAdvisory_542_GKB55011\" target=\"_blank\">LG G2</a> also got the upgrade to 5.0 in late April.</p> <p><a href=\"https://support.t-mobile.com/docs/DOC-11935\" target=\"_blank\">T-Mobile</a> promised the LG G3 will get Lollipop around April 7, though some users will see it earlier than others. Now, the Uncarrier is also sending the <a href=\"https://support.t-mobile.com/docs/DOC-7591\" target=\"_blank\">update to the LG G2</a>. However, the rollout could span from April 14 to May 22, T-Mobile warns.</p> <p><a href=\"http://www.verizonwireless.com/dam/support/pdf/system_update/benefits-lg-g3-4-13-15.pdf?null\" target=\"_blank\">Verizon</a> finally joined the party in April, and added the LG G3 to the list of devices that can now download the Android 5.0 Lollipop update.</p> <p>Reports of Android 5.0 arriving on <a href=\"http://www.phonearena.com/news/LG-G-Pro-2-starts-getting-Lollipop-5.0.1-over-the-air-in-Europe_id65804\" target=\"_blank\">the LG G Pro 2</a> in parts of Europe also started to spread in February, following its launch in South Korea at the beginning of the month.</p> <p>LG was a little behind schedule with its updates. In October 2014, the firm sent out a tweet regarding the G3 smartphone from the <a href=\"https://twitter.com/LGUK/status/527084599663673344\" target=\"_blank\">LG Electronics UK Twitter account,</a> saying that the G3 would get its Lollipop update before the end of the year.</p> <p>LG said G3 owners in Poland would be first on the list, with the process expected to start from November 10. <a href=\"http://www.lgnewsroom.com/newsroom/contents/64765\" target=\"_blank\">According to LG’s blog</a>, “other key markets will follow in the near future.” On December 8, a French network published its <a href=\"http://smartphones.sfr.fr/android/tableau-des-mises-a-jour-smartphones-decembre-2014/?sfrcpid=t3_genmob_netwks_td_1806294&amp;ectrans=1\" target=\"_blank\">software update schedule</a>, and the LG G3 was listed as being underway. As always, the update will be a staggered release which will depend on network cooperation.</p> <p>A <a href=\"http://www.mylgphones.com/european-lg-g3-d855-android-5-0-lollipop-software-updated85520e.html\" target=\"_blank\">list of European countries</a> where the G3 would receive Android 5.0 was leaked in mid-December. The UK, Austria, Germany, Italy, and Spain were among those mentioned, with December 12 down as the start date. Subsequently, <a href=\"http://digipassion.com/2014/12/lg-g3-android-lollipop-update-seeding-in-india.html\" target=\"_blank\">reports gathered</a> that G3 phones in India would get an Android 5.0 update before the end of the month.</p> <h3>Next page: When are updates coming from Google, Motorola, and others?</h3> </article>"], "link": "http://www.digitaltrends.com/mobile/android-5-0-lollipop-update-news/"},
{"category": ["mobileTablet"], "category2": ["none"], "author": [" Andy Boxall "], "headline": [" The Oppo R7 smartphone is real, it may have a bezel-free screen, and it’s coming soon "], "image": ["http://icdn2.digitaltrends.com/image/oppo-r5-camera-640x0.jpg?ver=3"], "content": ["<article class=\"m-content \" itemprop=\"articleBody\" data-scope=\"content\"> <p>Chinese smartphone manufacturer Oppo may be working on a new device with an almost bezel free touchscreen. A variety of leaks show a large phone with a screen that reaches the edge of the body, much like the Sharp Aquos Crystal released last year.</p> <p><em><strong>Updated on 04-27-2015 by Andy Boxall:</strong> Added in an official teaser for the Oppo R7.</em></p> <h3>Two phones possible at rumored May 20 launch</h3> <p>Following weeks of rumors, Oppo has shared its first teaser image regarding its next smartphone release. Posted on to the company’s <a href=\"https://www.facebook.com/Oppo/photos/a.184452371695141.46105.180203662120012/574857332654641/?type=1\" target=\"_blank\">official Facebook page</a>, it doesn’t give much away, but does confirm the phone will be called the R7. A cryptic message is shared with the picture, saying, “If you count on what you want, and do what you need, you’ll receive both and lose nothing.” We’re then told the “R7 is coming.”<a class=\"wp-image-756633\" href=\"http://icdn2.digitaltrends.com/image/oppo-r7-teaser-720x480.jpg\" style=\"width: 640px;\"><span class=\"zoom-button\"></span><img class=\"aligncenter size-large wp-image-756633\" src=\"http://icdn4.digitaltrends.com/image/oppo-r7-teaser-640x640.jpg\" alt=\"Oppo R7 Teaser\" width=\"640\" height=\"426\"></a></p> <p><a href=\"http://www.thebinarytrend.com/oppo-r7-oppo-r7-plus/\" target=\"_blank\">An anonymous Chinese source</a> recently stated the Oppo R7 would launch on May 20, and also speculated Oppo may announce two R7 phones on the day. The regular R7 is the one seen in the leaks here, while a second R7 Plus — which we assume will have a bigger screen — is also possible. No technical details are known about the R7 Plus, or whether it will feature the same bezel-free display we expect on the R7.</p> <h3>Leaked videos and pictures show off the R7</h3> <p>Even though the official name of the device is still up for debate, we’ve seen every detail of the mystery device in leaked pictures and videos. The latest video from a website called <a href=\"http://www.mobile-dad.com/a/286/12799.html\" target=\"_blank\">Mobile Dad</a> shows what the leaker claims is the Oppo R7 in action. The phone is up and running, and the video zooms right in to show the bezel-free screen.</p> <div id=\"dt-video-container-3906739982\" class=\"do-enforce-ratio\" style=\"width: 100%;height: ;\" data-ratio=\"1.77\"><iframe width=\"100%\" height=\"100%\" src=\"https://www.youtube.com/embed/ZQSIPrAYzdE?feature=oembed&amp;start=53\" frameborder=\"0\" allowfullscreen></iframe></div> <p><a href=\"http://www.weibo.com/2561744167/CdFGsa5gz?from=page_1006062561744167_profile&amp;wvr=6&amp;mod=weibotime&amp;type=comment#_rnd1429263732852\" target=\"_blank\">Leaked pictures</a> have given us a better look at the next smartphone Chinese manufacturer Oppo could launch.There’s no indication this is final, though. Check out the new images below, which show what’s expected to be a 5.5-inch touchscreen fitted to a potentially 4.85mm thick body. Combine that with the bezel-less screen, and the phone is looking very special indeed.</p> <div id=\"gallery-2\" class=\"gallery galleryid-740867 gallery-columns-3 gallery-size-medium\"><dl class=\"gallery-item\"> <dt class=\"gallery-icon landscape\"> <a href=\"http://www.digitaltrends.com/mobile/oppo-curved-bezel-free-screen-phone/attachment/oppo-bezel-less-r7-leak/\"><img width=\"325\" height=\"325\" src=\"http://icdn2.digitaltrends.com/image/url-d0cc7fa73bfa293d6469e8f17dbb3455-325x325-c.jpg\" class=\"attachment-medium wp-image-752575\" alt=\"Oppo Bezel Less R7 Leak\"></a> </dt></dl><dl class=\"gallery-item\"> <dt class=\"gallery-icon landscape\"> <a href=\"http://www.digitaltrends.com/mobile/oppo-curved-bezel-free-screen-phone/attachment/oppo-bezel-less-r7-leak-front/\"><img width=\"325\" height=\"325\" src=\"http://icdn4.digitaltrends.com/image/url-180ec1b765cc2385277b72081a3d1f48-325x325-c.jpg\" class=\"attachment-medium wp-image-752576\" alt=\"Oppo Bezel Less R7 Leak Front\"></a> </dt></dl><dl class=\"gallery-item\"> <dt class=\"gallery-icon landscape\"> <a href=\"http://www.digitaltrends.com/mobile/oppo-curved-bezel-free-screen-phone/attachment/oppo-bezel-less-r7-leak-top/\"><img width=\"325\" height=\"325\" src=\"http://icdn6.digitaltrends.com/image/url-0e2dd7b0123e02b231a058945c6315e2-325x325-c.jpg\" class=\"attachment-medium wp-image-752577\" alt=\"Oppo Bezel Less R7 Leak Top\"></a> </dt></dl><br style=\"clear: both\"> </div> <p>Before the leaked images and the above hands-on video surfaced, another video showing the Oppo smartphone in action was also released. Putting aside any fears the initial leaked pictures were fakes, the video proves the phone is at the very least, a working prototype. Check out the moment where a promo video is played on the device, and the full extent of the screen’s image is revealed.</p> <iframe src=\"http://v.qq.com/iframe/player.html?vid=q01493wzc6a&amp;tiny=0&amp;auto=0\" width=\"640\" height=\"500\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe> <p>The first images of the bezel-less phone came a short while before the video, and were <a href=\"http://www.anzhuo.cn/4457\" target=\"_blank\">published on a Chinese website</a>, where it was stated the screen measures 5.5-inches. Nothing else about the phone’s specs are mentioned. We can speculate though, as the company has already pledged to use the <a href=\"http://www.digitaltrends.com/mobile/snapdragon-810-coming-to-sony-moto-oppo-lumia-phones/\">Qualcomm Snapdragon 810 processor</a> in future hardware, and has talked about <a href=\"http://www.digitaltrends.com/mobile/oppo-smartphones-to-use-camera-and-design-to-standout/\">including innovative cameras</a> to make its new phones stand out from the crowd. However, if the screen looks like this, then we’d pay attention regardless of how cool the camera is.<br> <a class=\"wp-image-740874\" href=\"http://icdn2.digitaltrends.com/image/oppo-bezelless-screen-leak-1000x667.jpg\" style=\"width: 640px;\"><span class=\"zoom-button\"></span><img class=\"aligncenter size-large wp-image-740874\" src=\"http://icdn4.digitaltrends.com/image/oppo-bezelless-screen-leak-640x640.jpg\" alt=\"Oppo Bezelless Screen Leak\" width=\"640\" height=\"426\"></a></p> <h3>Cunning tech may fool us the phone has a bezel-less screen</h3> <p>Recently, <a href=\"http://www.gsmarena.com/exclusive_oppo_display_technology_may_be_the_key_to_bezeless_devices-news-11634.php\" target=\"_blank\">an Oppo patent</a> was discovered showing an unusual way of creating a curved, bezel-free display, but without the massive expense associated with phones like the Galaxy Note Edge. According to the patent, a normal screen is hidden under a specially shaped transparent panel, which projects the image in a clever way, fooling us into thinking there’s no bezel on the phone. This could explain why in one picture, the screen appears curved at the edge, but not in the other.</p> <p><strong>Related:</strong> <a href=\"http://www.digitaltrends.com/wearables/oppo-fast-charge-smartwatch-news/\">Oppo’s first smartwatch may recharge in the time it takes to brush your teeth</a></p> <p>It’s not certain whether the pictured phone uses this technology, or is even a model planned for production, but it’s certainly very eye-catching. Oppo’s not the only one working on minimizing the bezel on its phones either. Aside from the <a href=\"http://www.digitaltrends.com/mobile/galaxy-s6-vs-galaxy-s6-edge/\">new Galaxy S6 Edge</a>, LG has shown a display panel <a href=\"http://www.digitaltrends.com/mobile/lg-shows-off-nearly-bezel-free-screen/\">with a 0.7mm bezel</a>, and we’re expecting a similarly edge-free phone, perhaps <a href=\"http://www.digitaltrends.com/mobile/zte-nubia-z9-news/\">called the Nubia Z9</a>, from ZTE very soon.</p> <p><strong>Previous updates:</strong></p> <p><em><strong>Updated on 04-23-2015 by Andy Boxall:</strong> Added in rumors of a May launch date, and talk of a second R7 Plus model.</em></p> <p><em><strong>Updated on 04-21-2015 by Malarie Gokey:</strong> Added in a hands-on video showing what appears to be the Oppo R7.</em></p> <p><em><strong>Updated on 04-17-2015 by Andy Boxall:</strong> Added in new pictures showing the bezel-less Oppo phone in more detail.</em></p> <p><em><strong>Updated on 03-24-2015 by Andy Boxall:</strong> Added in a short video showing the Oppo smartphone in action</em></p> </article>"], "link": "http://www.digitaltrends.com/mobile/oppo-curved-bezel-free-screen-phone/"},
{"category": ["hardware"], "category2": ["none"], "author": [" Trevor Mogg "], "headline": [" More bans roll in for the selfie stick, now Wimbledon tennis championships says ‘no’ "], "image": ["http://icdn2.digitaltrends.com/image/selfie-stick-3-970x0.jpg"], "content": ["<article class=\"m-content \" itemprop=\"articleBody\" data-scope=\"content\"> <p>The selfie stick is picking up bans left, right and center these days, making it perhaps the most unloved tech accessory of all time as far as tourist sites and sports events are concerned.</p> <p>The Wimbledon Tennis Championships is the latest high-profile venue to slap a ban on the smartphone-wielding extendable pole. Speaking to the <a href=\"http://www.thesundaytimes.co.uk/sto/news/article1548844.ece?CMP=OTH-gnws-standard-2015_04_25\" target=\"_blank\">Sunday Times</a>, a spokesperson for the event said the decision to prohibit use of the stick was taken because of its “nuisance value” and to stop it interfering with spectators’ enjoyment of the event.</p> <p><strong>Related:</strong> <a href=\"http://www.digitaltrends.com/mobile/apple-bans-selfie-stick-from-wwdc-2015/\">Apple bans selfie sticks from WWDC</a></p> <p>A recently released guide [<a href=\"http://www.wimbledon.com/pdf/Ticket_Holders_Guide_2015.pdf\" target=\"_blank\">pdf</a>] for those with tickets for the prestigious tennis contest, which kicks off at the end of June, says, “In common with many other sports and entertainment events, The Championships will not allow selfie sticks into the grounds.”<a class=\"wp-image-756954\" href=\"http://icdn2.digitaltrends.com/image/selfie-stick-ban-2-408x430.jpg\" style=\"width: 325px;\"><span class=\"zoom-button\"></span><img class=\"alignright wp-image-756954\" src=\"http://icdn4.digitaltrends.com/image/selfie-stick-ban-2-640x640.jpg\" alt=\"selfie stick ban\" width=\"325\" height=\"342\"></a></p> <p>The organizing committee has even taken the time to design a little selfie-stick-ban symbol (pictured) to remind enthusiastic owners of the gadget to leave it in their bag and use their extendable arm instead.</p> <p>The move by Wimbledon’s organizers to forbid use of the stick follows similar action taken by popular tourist venues around the world, including the Museum of Modern Art in New York City, the National Gallery in Washington DC, and the Getty Center in Los Angeles. The Palace of Versailles near Paris also prohibits use of the retractable metal rod, as do a number of arenas and stadiums in Australia.</p> <p>As the bans roll in thick and fast, the much-maligned selfie stick looks set to spend an increasing amount of time packed away in bags rather than towering over the heads of grinning groups of friends, a reality that’s actually likely to please many.</p> <p><em>[Image: <a href=\"https://www.flickr.com/photos/paulafunnell/7474605200/in/photolist-coviHs-covptE-cov8Qw-covaQu-covmy7-covd8A-covfuh-covtAm-covnRw-covgP1-covvJ1-couZNA-covrtm-covw9Q-couU5N-covnho-covjaf-covgod-covbjE-covm5W-cov8oE-cov4F5-cov9B9-cov6mu-covpE9-covaju-couYTm-cov74G-covuYh-cov3o5-cov7to-covhfA-covtbq-couYcN-covet1-couUxW-covdy5-covfVo-couV5h-covq6j-covwBj-cov4dL-covk3J-covhGs-cov977-covrUJ-cov7WN-cov63s-covkEs-cov5nf\" target=\"_blank\">Paula Funnell</a>]</em></p> </article>"], "link": "http://www.digitaltrends.com/mobile/wimbledon-tennis-championships-says-no-to-the-selfie-stick/"},
{"category": ["gaming"], "category2": ["none"], "author": [" Kristofer Wouk "], "headline": [" Fire up your Lancers: Gears of War remaster headed to Xbox One "], "image": ["http://icdn4.digitaltrends.com/image/gears-of-war-logo-640x0.jpg"], "content": ["<article class=\"m-content \" itemprop=\"articleBody\" data-scope=\"content\"> <p>To many people, <em>Gears of War</em> was one of the original defining experiences of the Xbox 360. As the series went on, it began to feel like more of the same, but there is a still a special place in many gamers’ hearts for the first game.</p> <p>Both fans of the series and those who have never played it will soon get to play <em>Gears of War</em> in higher definition and at 60 frames per second, as it is the latest game to be remastered for a modern console — the Xbox One in this case. Details are scant, but the remake has been confirmed by both <a href=\"http://www.polygon.com/2015/4/24/8490745/gears-of-war-xbox-one-anniversary-remake\" target=\"_blank\">Polygon</a> and <a href=\"http://kotaku.com/report-gears-of-war-remaster-coming-to-xbox-one-1700059889\" target=\"_blank\">Kotaku</a>.</p> <p>After the release of <em>Halo: The Master Chief Collection</em>, many wondered whether a similar collection featuring the Gears of War games would see release, especially since Microsoft acquired the series in 2014. Rod Fergusson of Black Tusk Studios — the company Microsoft had assigned future development on the series to — denied the rumors.</p> <p>“I love the passion, but there’s no Marcus Fenix Collection,” Fergusson <a href=\"https://twitter.com/GearsViking/status/578553820344545281\" target=\"_blank\">tweeted in March</a>, “We ARE working on other exciting Gears projects. I’ll see you at E3.”</p> <p><strong>Related:</strong> <a href=\"http://www.digitaltrends.com/gaming/halo-3-odst-master-chief-collection-may/\">Halo 3: ODST and new map coming to Master Chief Collection next month</a></p> <p>While several individuals playing a multiplayer test build have confirmed that it is indeed a remaster, it is only the first game in the series, not a collection. Further, there is currently some confusion over who is developing the game.</p> <p>The easy assumption is that Black Rock would be working on the remaster, but some are claiming that Splash Damage, the developer of <em>Brink,</em> the upcoming <em>Dirty Bomb</em>, is working on the <em>Gears of War</em> remaster. A company job listing saying that it is working on a “very well-known and highly popular AAA title with next gen technology” and Fergusson’s tweet both lend this some modicum of credibility.</p> <p>The re-release will include a visual upgrade as well as new cut scenes from animation studio Plastic Wax, <a href=\"http://www.polygon.com/2015/4/24/8490745/gears-of-war-xbox-one-anniversary-remake\" target=\"_blank\">Polygon reports</a>. The current test build that several sources have played is multiplayer only and features a variety of game modes.</p> <p>There is no word on a possible release date, but it seems likely that more will be announced <a href=\"https://www.e3expo.com\" target=\"_blank\">at E3 in June</a>.</p> </article>"], "link": "http://www.digitaltrends.com/gaming/gears-of-war-xbox-one-remaster/"},
{"category": ["hardware"], "category2": ["none"], "author": [" Kristofer Wouk "], "headline": [" uBeam wants to make wireless charging as easy as connecting to Wi-Fi "], "image": ["http://icdn6.digitaltrends.com/image/shutterstock-wireless-charging-640x0.jpg"], "content": ["<article class=\"m-content \" itemprop=\"articleBody\" data-scope=\"content\"> <p>Many of us can’t possibly imagine life without our smartphones, but they aren’t without their problems. Although the phones are continuing to get more powerful, battery life isn’t keeping up.  But what if you could charge them almost anywhere and it was as simple as connecting to Wi-Fi?</p> <p>That’s exactly what wireless charging startup uBeam is aiming for. Last year <a href=\"http://www.digitaltrends.com/mobile/ubeam-wireless-charging-might-soon-ubiquitous-wi-fi/\">we reported</a> that uBeam had produced a fully functional prototype of its ultrasonic wireless charging platform. Now the company has refined its early prototypes into something more consumer-friendly, and venture capitalists are all over it.</p> <p>After receiving $3.2 million in seed funding followed by a $10 million investment from Upfront Ventures last year, uBeam is looking at raising $50 million or more, <a href=\"http://techcrunch.com/2015/04/26/kill-the-cord/\" target=\"_blank\">according to TechCrunch</a>. Part of this is related to developing the technology itself, but that isn’t all that uBeam has up its sleeve.</p> <p><strong>Related:</strong> <a href=\"http://www.digitaltrends.com/home/ikea-wants-to-sell-you-furniture-with-wireless-charging-hubs/\">Charge your phone wirelessly with these new Ikea lamps and tables</a></p> <p>Instead of simply selling its wireless charging case and charging stations directly to consumers, uBeam is looking at partnering with retail locations, fast food chains, airlines, and others to provide wireless charging much in the same way that those locations currently offer Wi-Fi.</p> <p>StarBucks is said to be especially close to signing a deal with uBeam, but Starwood hotels and Virgin are also mentioned. In addition to these retailers, uBeam is said to be talking with hardware manufacturers like Apple and Samsung. Whether this is about providing built-in wireless charging or simply partnering to sell wireless charging cases as accessories is unknown, but it’s hard not to get excited about the possibilities.</p> <p>Unlike current wireless charging systems, which require the device being charged to remain stationary on a mat, uBeam’s ultrasonic transduction works at a range of around 15 feet, and there is no need for the devices to sit still. They can be operated even as they continue to charge.</p> <p>There are still many problems to be solved before this technology becomes fit for daily use, but at least we are now at the beginning. And it might be the beginning of the end as well, at least as far as power cords are concerned.</p> </article>"], "link": "http://www.digitaltrends.com/cool-tech/ubeam-wireless-charging-starbucks/"},
{"category": ["gaming"], "category2": ["none"], "author": [" Kristofer Wouk "], "headline": [" Silent Hills is dead, according to everyone but Konami "], "image": ["http://icdn2.digitaltrends.com/image/silent-hills-970x0.jpg"], "content": ["<article class=\"m-content \" itemprop=\"articleBody\" data-scope=\"content\"> <p>April has been a rough month for fans looking forward to <em>Silent Hills</em>. Earlier this month, the Kojima Productions <a href=\"http://www.digitaltrends.com/gaming/kojima-silent-hills-removed/\">logo was removed</a> from the game’s website, and it was reported over the weekend that <em>P.T.</em>, the “playable teaser” for the game, is going to be removed from the PlayStation Store this week.</p> <p>Considering the rampant rumors of <em>Silent Hills</em> co-director Hideo Kojima’s impending exit from Konami, fans began to fear for the worst. Then an attendee at the San Francisco Film Festival <a href=\"https://twitter.com/tvsmatthackney/status/592177537427447808\" target=\"_blank\">tweeted</a> that Guillermo del Toro, who was to co-direct the game with Kojima, said of the series: “It’s not gonna happen and that breaks my greasy heart.”</p> <p>Shortly thereafter, <em>Walking Dead</em> actor Norman Reedus, who lent both his image and voice to the game, echoed that sentiment, <a href=\"https://twitter.com/wwwbigbaldhead/status/592412551457198080\" target=\"_blank\">tweeting</a>: “Super bummed about this was really looking forward to it. Hopefully it’ll come back around. Sorry everyone.”</p> <p><strong>Related:</strong> <a href=\"http://www.digitaltrends.com/gaming/konami-announces-more-metal-gear/\">Konami is making more Metal Gear games, with or without the series’ creator</a></p> <p>While it was later revealed that del Toro was speaking only of collaborating with Kojima, as was reported to a source <a href=\"http://www.ign.com/articles/2015/04/26/guillermo-del-toro-touches-on-his-collaboration-with-kojima\" target=\"_blank\">speaking to IGN</a>, things still weren’t looking good for the series. On Monday, Konami finally offered a response to the rumors. As to <em>Silent Hills</em>’ immediate future, all the company had to say is “we will continue to develop the Silent Hill series,” <a href=\"http://www.eurogamer.net/articles/2015-04-26-silent-hills-is-dead-actor-norman-reedus-confirms\" target=\"_blank\">according to Eurogamer</a>.</p> <p>The company used similarly terse language in addressing other rumors, saying that Norman Reedus’ image disappeared from the website because its contract period with him had expired, and that <em>P.T.</em> is being removed from the PlayStation store because its distribution period has ended.</p> <p>What Konami <em>didn’t</em> say is that <em>Silent Hills</em> is still in the works. Even if the game is still in development, without Kojima and del Toro on board, it isn’t going to be the same game that fans have been anxiously awaiting. If <em>Silent Hills</em> isn’t dead, it’s likely alive in name only.</p> <p>For a glimpse at what might have been, PS4 owners can continue to download <em>P.T.</em> from the PlayStation Store until April 29.</p> </article>"], "link": "http://www.digitaltrends.com/gaming/silent-hills-cancelation-rumors/"},
{"category": ["hardware"], "category2": ["none"], "author": [" Jonathan Keane "], "headline": [" Intel may turn to Quantum Wells to enforce Moore’s Law "], "image": ["http://icdn2.digitaltrends.com/image/intel-processor-970x0.jpg?ver=1"], "content": ["<article class=\"m-content \" itemprop=\"articleBody\" data-scope=\"content\"> <p>Moore’s Law, coined in April 1965 by Gordon Moore who would go on to co-found Intel, stated that the number of transistors in a chip would double every year. He would revise that law a few years later to every two years. The law has driven the advance of technology at a rapid pace, right up to our latest smartphones.</p> <p>As chips have become increasingly powerful and faster, however, manufacturers have struggled to keep up the pace. Analysts have questioned how much longer Moore’s Law can go, on but one analyst suggests that Intel will adapt by trying new techniques, such as a technology called a quantum well.</p> <p><strong>Related</strong>: <a href=\"http://www.digitaltrends.com/computing/moores-law-celebrates-fiftieth-birthday/\">Moore’s Law celebrates its 50th birthday</a></p> <p>David Kanter, writing for his own site, <a href=\"http://www.realworldtech.com/intel-10nm-qwfet/\" target=\"_blank\">Real World Tech</a>, predicts that Intel will develop 10nm Quantum Well Field Transistors (QWFET) instead of the FinFET transistors currently used. The technology is difficult to understand or explain without a PhD in physics, but here’s the basics.</p> <p>A quantum well occurs when trapped electrons take on a quantum state, which causes them to only exist at discrete energy levels. This is useful, since it allows greater control over the electron’s behavior. The QWFET uses this quantum well effect, and is also built in three dimensions, so it retains the favorable characteristics of three dimensional FinFET transistors.</p> <p>QWFETs look set to be scaled down to 0.5V. That will outperform a standard FinFETs, which by comparison can be scaled down to 0.7V. If accomplished, this would lead to transistors that require less power to achieve a particular level of performance. That helps Intel chase Moore’s Law, as it means more transistors can be packed into a certain power envelope. Combined with a reduction in production process to 10nm, QWFETs should provide a sharp increase in efficiency.</p> <p>Kanter goes on to predict that Intel will begin producing these 10nm QWFETs later this year or in early 2016. If for some reason the technology can’t be ramped up in time for the 10nm chips, they’ll be delayed and used as 7nm transistors in 2017 or 2018. He has been tracking the research of Intel for years, noting that the company has been researching quantum wells for over a decade and also points out a paper by <a href=\"http://blogs.intel.com/technology/2010/11/enforcing_moores_law_through_t/\" target=\"_blank\">Intel researchers writing about QWFETs</a> back in 2010.</p> <p>“Once Intel’s researchers showed that it was possible to create FinFET QWFETs,” writes Kanter, “it became clear to me that this technology was headed out of research, into development, and ultimately into processors that would be on the market.”</p> <p>Kanter says he first made these predictions privately back in 2012 to friends but has now decided to go public. He provides a detailed prediction on what he believes Intel’s process will be, even forecasting what materials will be used to be combined with silicon.</p> <p><strong>Related</strong>: <a href=\"http://www.digitaltrends.com/computing/new-details-revealed-about-intels-upcoming-60-core-behemoth/\">Intel has a crazy 60-core processor in the works</a></p> <p>He anticipates that Intel will use InGaAs (Indium Gallium Arsenide) or InSb (indium tin) for the n-type channel and strained germanium for the p-type channel.</p> <p>Intel hasn’t commented on any of Kanter’s remarks. Other industry heavyweights like Samsung and Taiwan Semiconductor Manufacturing Company (TSMC) have stayed relatively quiet on their own research into new materials. In any case, Intel would be well ahead of the competition, as usual. Most other chip foundries are just now starting to use the FinFET design Intel put into production several years ago.</p> <p>The supposed slowing down of Moore’s Law has caused the industry to look at new methods and materials, such as <a href=\"http://www.bloomberg.com/news/videos/2015-02-17/gallium-nitride-is-it-the-silicon-replacement-\" target=\"_blank\">Gallium Natride (GaN)</a>, which was exhibited earlier this year by Efficient Power Conversion.</p> <p>Kanter is also keen to point out that this is all “informed speculation” on his part and concedes that he may be wrong too and it will be some time before we find out. “In reality, it will take months or years for Intel and the rest of the industry to reveal their plans for 10nm and 7nm,” he writes.</p> <div class=\"simplePullQuote h-nonessential\"><p>QWFETs may help notebook battery life continue its improvement, making all day endurance the rule.</p> </div> <p>If he’s correct, though, the impact could be dramatic. Intel’s transition to FinFETs in 2012 was followed by a rapid reduction in average power draw and, therefor, improvement in notebook battery life. In our testing,<a href=\"http://www.digitaltrends.com/computing/has-laptop-battery-life-really-improved/\"> we discovered notebook endurance has improved by two and a half hours</a> on average over the last three years. QWFETs should allow a continuation of this rapid improvement, making all day battery life the rule rather than the exception.</p> </article>"], "link": "http://www.digitaltrends.com/computing/analyst-predicts-intel-new-methods-moores-law/"},
{"category": ["tvs"], "category2": ["none"], "author": [" Steve Smith "], "headline": [" Furious 7 races to fifth highest-grossing film ever "], "image": ["http://icdn5.digitaltrends.com/image/fast-furious-6-crew-640x0.jpg"], "content": ["<article class=\"m-content \" itemprop=\"articleBody\" data-scope=\"content\"> <p>Even though they race a quarter mile at a time, there is seemingly no finish line in sight for Dominic Toretto and his crew. They started out fast, then they got a little furious and now they have the fifth highest-grossing film of all time.</p> <p><em>Furious 7</em> has continued its box-office dominance by passing <em>Frozen</em> for fifth place on the list for highest grossing movies. For the fourth consecutive weekend, series star Vin Diesel and a rag-tag team of racers have topped the U.S. box office, earning more than $1.32 billion in less than a month. <em>Harry Potter and the Deathly Hallows – Part 2 </em>is definitely within reach for the fourth spot, having grossed $1.34 billion when it was released back in 2011.</p> <p><strong>Related: </strong><a href=\"http://www.digitaltrends.com/movies/furious-7-sequel-release-date/\">The inevitable sequel to Furious 7 will hit theaters April 14, 2017</a></p> <p>The seventh outing in the increasingly popular film franchise is also just the third movie to make over $1 billion internationally, joining <em>Avatar </em>and <em>Titanic</em> in that exclusive club. Both of James Cameron’s epic films are quite a long ways away grossing-wise, even in a suped-up 1970 Dodge Charger, having pulled in over $2 billion each when they were released.</p> <p>The longer this ride goes, the more records <em>Furious 7 </em>seems to break. It has become the fastest film to reach $1 billion in Hollywood history, and it’s the most successful live-action film franchise based on an original idea, with plans to make <em>three</em> more films, including the recently announced sequel to <em>Furious 7</em>, which is slated to release April 14, 2017.</p> <p><em>Furious 7</em> starred Vin Diesel, Paul Walker, Dwayne Johnson, Michelle Rodriguez, Jordana Brewster, Tyrese Gibson, Chris “Ludacris” Bridges, Jason Statham, Djimon Hounsou, Tony Jaa, Ronda Rousey, and Kurt Russell. There’s no word yet on which series stars will be returning or what newcomers may join in. Regardless, it will be a stretch for the next three films to match <em>Furious 7</em>‘s success.</p> </article>"], "link": "http://www.digitaltrends.com/movies/furious-7-races-to-fifth-highest-grossing-film-ever/"}]