[{"category": [], "category2": [], "author": ["Joel Hruska"], "headline": ["Microsoft’s Xbox revenues fall, shipments still lag Sony"], "image": ["http://www.extremetech.com/wp-content/uploads/2015/03/XboxOne-348x196.jpg"], "content": ["<p>Microsoft’s Xbox division took a significant hit in Q1 2015 after holiday price cuts drove unit shipments upwards, but decreased the amount of profit Redmond earned on each system. The company reports that Xbox division revenues fell by $306 million or 24% compared with the first quarter of 2014. Microsoft chalks up 20% of the decline to price cuts, with a 4% drop thanks to currency adjustments and a strong US dollar.</p>", "<p>Ars Technica <a href=\"http://arstechnica.com/gaming/2015/04/microsofts-console-business-falters-a-bit-in-early-2015/\">has analyzed</a> the likely split between the Xbox One and Xbox 360, since Microsoft no longer breaks out sales between the two devices, and calculated that the Xbox One likely moved between 1.12 and 1.34 million units over the past three months, roughly in line with the 1.2 million units it moved last year. While flat sales in a seasonally off-peak quarter aren’t bad by any means, they still put the Xbox division well behind Sony, which sold 1.7 million consoles in just January and February.</p>", "<p><img class=\"alignnone size-full wp-image-198349\" src=\"http://www.extremetech.com/wp-content/uploads/2015/01/xboxonetruck.jpg\" alt=\"Xbox One truck\" width=\"640\" height=\"426\"></p>", "<p>In other words, if Sony sold the same number of consoles in all three months of the year and Microsoft sold its 1.2 million as estimated, the PS4 still sold twice as many systems as the Xbox One.</p>", "<p>Let’s get something out of the way up front: I am not a console fanboy. In my adult life I’ve owned a Wii, a GameCube, and a Sony PS2. I’m a PC gamer first and foremost, which means I don’t have a personal stake in this fight.</p>", "<p>It’s become common for stories like this to quickly turn into <a href=\"http://www.extremetech.com/gaming/201741-the-uncertain-future-of-the-xbox-one\">mud-slinging festivals</a> between Xbox fanboys convinced Sony is a year or two from bankruptcy and Sony fans who apparently believe the Xbox One packs the game performance of a Commodore 64. The factual truth is, Microsoft isn’t in an objectively bad position here — the PS3 was in far worse shape against the Xbox 360 at this point in its life cycle than the Xbox One is against the PS4. For one thing, Microsoft isn’t losing hundreds of dollars per unit.</p>", "<p><a href=\"http://www.extremetech.com/wp-content/uploads/2015/04/sony_profits_2012.jpg\"><img class=\"alignnone size-large wp-image-204162\" src=\"http://www.extremetech.com/wp-content/uploads/2015/04/sony_profits_2012-640x360.jpg\" alt=\"sony_profits_2012\" width=\"640\" height=\"360\"></a></p>", "<p>This graph of the PS3’s life cycle through 2011 shows just how much of a blood bath it was for Sony. Microsoft is far ahead of the curve on this front.</p>", "<p>Microsoft’s biggest problem with the Xbox One, in my opinion, has nothing to do with the fact that it’s <a href=\"http://www.extremetech.com/gaming/156273-xbox-720-vs-ps4-vs-pc-how-the-hardware-specs-compare\">somewhat less powerful</a> than the PS4. Developers have demonstrated that they can work within the limits of the platform, and while the PS4 often has an edge in graphics or smoothness, it’s not enormous. The bigger problem for Microsoft is that it clearly had an entire vision of the Xbox One that was written around Kinect and the concept of the Kinected (pun intend) home.</p>", "<p>Sources have told us that Microsoft was internally stunned at the reaction to its Kinect unveiling in 2013, having never anticipated the blowback it got from the press. The problem was simple: Microsoft didn’t unveil a cohesive gaming strategy to show how titles would use Kinect to deliver cutting-edge gameplay that no other company could match. As a result, readers looked for other reasons why MS would deploy an always-on camera <a href=\"http://www.extremetech.com/gaming/139706-microsofts-new-kinect-patent-goes-big-brother-will-spy-on-you-for-the-mpaa\">and found them in spades</a>. <a href=\"http://www.extremetech.com/computing/157761-the-nsas-prism-leak-could-fundamentally-change-or-break-the-entire-internet\">Edward Snowden’s disclosures</a>, which demonstrated that Microsoft was already obligated to share data with the NSA, effectively killed Kinect.</p>", "<p>Microsoft, to its credit, walked away from its own plans for the Xbox One and pivoted the system to match Sony’s “It plays games” philosophy. They’ve fought back with price cuts and added system features. But without a really killer title — the Halo collection that might have filled that role has proven to be a buggy, half-finished wreck — they’re languishing in Sony’s shadow.</p>", "<p>The next big chance for Microsoft to change its standing will be later this year, when Halo 5 ships. A great Halo could reinvigorate Microsoft’s entire gaming division, just as Halo (and to some extent, Halo 3) drove sales of the original Xbox and Xbox 360. Until then, or unless Microsoft articulates a new philosophy for why consumers should be buying Xboxes and not PS4’s, the console seems stuck in second place.</p>"], "link": "http://www.extremetech.com/gaming/204161-microsofts-xbox-revenues-fall-shipments-still-lag-sony"},
{"category": [], "category2": [], "author": ["Joel Hruska"], "headline": ["AMD takes a beating in Q1, abandons SeaMicro, dense server business"], "image": ["http://www.extremetech.com/wp-content/uploads/2012/10/AMD_Logo10-348x196.png"], "content": ["<p>AMD reported its Q1 2015 results last night, and they’re not pretty. The company’s Q1 2015 revenue was $1.03 billion, a decline of 17% sequentially and 26% year-on-year. Gross margins fell slightly year on year, to 32%, though that improved on Q4 2014’s 29%. AMD reported a net loss of $180 million, compared to Q1 2014, where it recorded a $20 million loss.</p>", "<p>As part of its ongoing plan to “simplify and sharpen the company’s investment focus,” AMD has announced that it is exiting the dense server business, effective immediately. AMD stepped into this business segment in late 2012, when it acquired the company for $334 million, but did virtually nothing with the company thereafter.</p>", "<p>When AMD bought SeaMicro, the general expectation was that the company must have seen something about that company’s Freedom Fabric interconnect that made it worth purchasing. It didn’t take long for AMD to go dark on that front, however. In June 2013, AMD’s ARM CPU slides looked like this:</p>", "<p>In January 2014, when it attended the Open Compute Summit, AMD’s Seattle slide looked like this:</p>", "<p>The sharp-eyed will notice that while the data appears mostly identical, any mention of 16-core SOCs or AMD’s Freedom Fabric have both been removed. AMD has also declined to discuss Sea Micro or how the company’s technology fit into AMD’s future server plans. Killing SeaMicro doesn’t mean that AMD has given up altogether on server products, but it does throw a wrench into the mix; dense servers were one of the high-growth areas that Rory Read (repeatedly) identified in various discussions about the future of the company during his tenure as CEO. There’s also no word on whether this will impact <a href=\"http://www.extremetech.com/computing/181867-amds-project-skybridge-new-arm-and-x86-chips-that-are-pin-compatible\">Project Skybridge. </a></p>", "<p>There’s no way around this — the bottom has fallen out of AMD’s traditional business. PC desktop and client sales for APUs and graphics (AMD combines the segments) has fallen by nearly 40%, to $532 million, from $861 million just a year ago. It’s hard to understate how much of a shift this is — while AMD always competed as an underdog, is a fraction of the size it was a few years ago.</p>", "<p><a href=\"http://www.extremetech.com/wp-content/uploads/2015/04/AMD-Nets.png\"><img class=\"alignnone size-large wp-image-203617\" src=\"http://www.extremetech.com/wp-content/uploads/2015/04/AMD-Nets-640x423.png\" alt=\"AMD earnings\" width=\"640\" height=\"423\"></a></p>", "<p>We’ve written in the past about how AMD’s long-term plan <a href=\"http://www.extremetech.com/gaming/190026-amd-ceo-just-laid-out-companys-two-year-roadmap/\">involves strategic repositioning and additional revenue from other, non-traditional sources</a>, but this is a bloodbath. We’ve heard rumors that Intel may have taken the gloves off this past quarter, sacrificing its own margins to maintain market share, but haven’t seen concrete evidence to that effect.</p>", "<p>The hard truth is, there’s not a lot of <em>good</em> here. AMD reportedly has a new GPU part <a href=\"http://www.extremetech.com/gaming/197450-amds-r9-380x-finalized-could-include-new-memory-interface-and-dramatic-performance-improvements\">coming in the near future,</a> but GPUs have never been where AMD banked a lot of net profit, and there’s no reason to expect that this has changed. Fighting with Nvidia over the high-end GPU space wins AMD mind share and fans, but it doesn’t generate billions of sales in a year-on-year basis. The console business continues to be a decent source of revenue for the company, but its royalty structures and earnings are front-loaded. As time passes, AMD earns smaller profits on that front.</p>", "<p>2015 was always going to be a transition year for AMD, but the next 12 months are looking extremely rocky. During the conference call, Lisa Su noted that she believed the second half of the year would be an improvement over the first year, but we’ll have to wait for the May 6 analyst day to know more. AMD does have two new semicustom wins on-track (it hasn’t announced its customers yet), but doesn’t expect to ship those products for revenue until H2 2016.</p>", "<p>AMD does expect to see some stronger results thanks to the <a href=\"http://www.extremetech.com/extreme/199654-amds-carrizo-higher-efficiency-better-performance-and-a-huge-leap-for-battery-life\">launch of Carrizo</a> and the launch of Windows 10 in July, but the company is facing a very difficult operating environment.</p>"], "link": "http://www.extremetech.com/gaming/203590-amd-takes-a-beating-in-q1-abandons-seamicro-dense-server-business"},
{"category": [], "category2": [], "author": ["Joel Hruska"], "headline": ["Analyst: Intel will adopt quantum wells, III-V semiconductors at 10nm node"], "image": ["http://www.extremetech.com/wp-content/uploads/2015/04/CPU-Wafer1-348x196.jpg"], "content": ["<p>As the pace of Moore’s Law has <a href=\"http://www.extremetech.com/extreme/203490-moores-law-is-dead-long-live-moores-law\">slowed and shifted</a>, every process node has become more difficult and complicated to achieve. The old days, where a simple die shrink automatically brought faster chips and lower power consumption, are now gone. Today, companies perform a die shrink (which makes most aspects of the chip perform <em>worse</em>, not better), and then find supplementary technologies that can improve performance and bring yields and power consumption back to full. Analyst and RealWorldTech owner David Kanter has published a paper on where he thinks Intel is headed at the 10nm node, and predicts the tech giant will deploy a pair of new technologies at that node — quantum well FETs and III-V semiconductors.</p>", "<p>We’ve talked about <a href=\"http://www.extremetech.com/computing/170356-beyond-7nm-and-silicon-the-first-iii-v-cmos-wafers-roll-off-production-lines\">III-V semiconductors first</a>, so we’ll start there. Intel has been evaluating next-generation semiconductor materials for years. We first spoke with Mark Bohr about the company’s efforts back in 2012. The <a href=\"http://www.extremetech.com/extreme/166413-post-post-pc-the-new-materials-tech-and-cpu-designs-that-will-revive-overclocking-and-enthusiast-computing\">III-V semiconductors</a> are called that because the materials are drawn from Groups III and V of the periodic table. Many of these materials have superior performance compared with silicon — either they use less power or they allow for drastically higher clock speeds. But they cost more and often require extremely sophisticated manufacturing techniques. Finding materials to replace both the p-channel and n-channel has been difficult, since some of the compounds used for one type of structure don’t work well for the other.</p>", "<p><a href=\"http://www.realworldtech.com/intel-10nm-qwfet/\">Kanter predicts</a> that Intel will use either InGaAs (Indium Gallium Arsenide) or InSb (indium tin) for n-type, and strained germanium or additional III-V materials for the p-type channel. The net effect of this adoption could cut operating voltages as far as 0.5v. This is critical to further reducing idle and low-use power consumption, because power consumption today rises as the square or cube of voltage increase (depending on leakage characteristics and overall transistor type).</p>", "<p>The other major advantage that Kanter thinks Intel may deploy is the use of quantum well structures. Quantum wells trap electrons by surrounding them with an insulating structure that leaves a limited number of dimensions for the electrons to move in. This new fin structure and gate are shown in the image below, from an Intel IEDM paper in 2011.</p>", "<p>Combined, these new structures would allow Intel to substantially cut power consumption while simultaneously improving other characteristics of the transistor’s performance. It’s not clear if this would enable substantially faster chips. Intel has focused primarily on making its CPUs more efficient in the past five years, as opposed to making them faster. And while a Core i7-4790K is unquestionably quicker than a Core i7-2600K from 2010, the gap isn’t what it would’ve been ten years ago.</p>", "<p>It’s possible that these new structures would run at substantially higher clock speeds. But building chips smaller also means decreasing feature sizes, which <em>increases</em> the formation of hot spots on the die. The ability to run chips at 0.5v is great for the Internet of Things, but it’s not necessarily great if the chip needs 1.1V to hit maximum clock.</p>", "<p>Kanter addresses why he wrote this piece, noting he believes that “industry experts should make insightful, specific, verifiable predictions that have a definite time horizon.” It makes sense that Intel would go for some of these capabilities. The firm is known to be researching III-Vs, and quantum wells have apparently been worked on for a decade or more. Intel likes to talk up its manufacturing capabilities and advantages, and this type of innovation at the 10nm node could give them a huge leg up over the competition.</p>", "<p>Samsung and TSMC haven’t revealed much about their own plans, but it’s highly likely that both firms would stick with conventional FinFET designs at 10nm, just as Intel spent two design cycles using their own standard Tri-gate technology. If TSMC actually closes the gap with Intel at 10nm, III-Vs and QWFETs would give Intel an argument for claiming it’s not just the number of nanometers that makes the difference — it’s the process tech as well.</p>", "<p>If Intel adopts these technologies at 10nm, it’ll <a href=\"http://www.extremetech.com/computing/190845-intel-forges-ahead-to-7nm-without-the-use-of-euv-lasers\">push back the window on EUV</a> farther, back to 7nm — and possibly require additional verification and validation that the tool sets are compatible with both the new semiconductor manufacturing equipment and the requirements of EUV itself. Such a move would likely push EUV introduction back into the 2018-2019 timeframe, assuming that 10nm shipments begin in 2016-2017, with 7nm ready 2-3 years later.</p>", "<p>Intel supposedly delayed installation of 10nm equipment until December of this year, but is planning to <a href=\"http://www.extremetech.com/extreme/199636-intel-at-isscc-14nm-in-the-bag-full-steam-ahead-on-10nm\">ramp production at its facilities</a> in Israel.</p>"], "link": "http://www.extremetech.com/gaming/203926-analyst-intel-will-adopt-quantum-wells-iii-v-semiconductors-at-10nm-node"},
{"category": [], "category2": [], "author": ["Joel Hruska"], "headline": ["ARM details its upcoming Cortex-A72 microarchitecture"], "image": ["http://www.extremetech.com/wp-content/uploads/2015/04/Cortex-72-348x196.jpg"], "content": ["<p>Earlier this year, ARM announced its Cortex-A72 — a new custom microarchitecture from the CPU designer that builds on and refines the 64-bit Cortex-A57. Ordinarily it takes up to 24 months for new ARM cores to come to market, after the company announces a new CPU design. But Qualcomm has told us to expect Cortex-A72 cores <a href=\"http://www.extremetech.com/computing/199453-qualcomm-rides-to-war-multiple-new-cpus-modems-announced-ahead-of-mobile-world-congress\">by the end of the year</a>. If true, that would make this one of the company’s fastest CPU ramps, ever — so what can the new core do?</p>", "<p>If ARM hits its targets, quite a lot.</p>", "<p>The Cortex-A72 is based on the Cortex-A57, but ARM has painstakingly refined its original implementation of that chip. The company is claiming that the A72 will draw 50% less power than the Cortex-A15 (a notoriously power-hungry processor) at 28nm and 75% less power at its target 16nmFF+ / 14nm process node. Compared to the Cortex-A57 at 28nm, ARM still expects the A72 to draw 20% less power.</p>", "<p><a href=\"http://www.extremetech.com/wp-content/uploads/2015/04/Cortex-Power.png\"><img class=\"alignnone size-large wp-image-204150\" src=\"http://www.extremetech.com/wp-content/uploads/2015/04/Cortex-Power-640x365.png\" alt=\"Cortex-Power\" width=\"640\" height=\"365\"></a></p>", "<p> </p>", "<p>ARM is supposedly aiming for the Cortex-A72 to be capable of sustained operation at its maximum frequency, which is a topic we touched on yesterday when covering the <a href=\"http://www.extremetech.com/computing/204093-independent-testing-confirms-qualcomms-snapdragon-810-has-a-heat-problem\">Snapdragon 810’s throttling problem</a>. The CPU is targeting improved performance of 1.16x to 1.5x over the Cortex-A57, clock-for-clock. Making this happen required revamping the branch predictor, cutting misprediction by 50%, and a 25% reduction in speculation power consumption. The chip can also bypass its branch predictor completely in circumstances where it is performing poorly and save additional power in the process.</p>", "<p>The Cortex-A72 is still capable of decoding three instructions per clock cycle, but apparently adds some instruction fusion capability to increase efficiency. Each of these components has been power-optimized as well. <a href=\"http://anandtech.com/show/9184/arm-reveals-cortex-a72-architecture-details\">AnandTech reports</a> that ARM’s dispatch stage can break fused ops back into micro-ops for increased execution granularity, effectively turning a three-wide decoder into a five-wide machine in some cases.</p>", "<p><a href=\"http://www.extremetech.com/wp-content/uploads/2015/04/Cortex-A72-1.jpg\"><img class=\"alignnone size-large wp-image-204151\" src=\"http://www.extremetech.com/wp-content/uploads/2015/04/Cortex-A72-1-640x357.jpg\" alt=\"Cortex-A72-1\" width=\"640\" height=\"357\"></a></p>", "<p>ARM is also amping up its game in SIMD execution units. Instruction latencies have been slashed, pipelines shortened, and cache bandwidths boosted. There are no huge changes in organization or capability, but the CPU core should see significant improvements thanks to these adjustments. ARM has even managed to shave off some die size — the Cortex-A72 is supposed to be about 10% smaller than the Cortex-A57, even on the same process.</p>", "<p>Ars Technica reports that according to ARM, the Cortex-A72 can even beat the Core M in certain circumstances. Such predictions must be taken with a grain of salt — they assume, for example, that the Core M <em>will</em> be thermally limited (we’ve seen that <a href=\"http://www.extremetech.com/gaming/202991-intels-erratic-core-m-performance-leaves-an-opening-for-amd\" target=\"_blank\">this can vary depending on OEM design</a>). Tests like SPECint and SPECfp tend to be quite dependent on compiler optimizations, and while the multi-threaded comparison is fair as far it goes, ARM is still assuming that the Cortex-A72 won’t be thermally limited. Given that all smartphones and tablets throttle at present, the company will need to prove the chip doesn’t throttle before such claims can be taken seriously.</p>", "<p>All the same, this new chip should be an impressive leap forward by the end of the year. Whether it’ll compete well against Apple’s A9 or Qualcomm’s next-generation CPU architecture is another question.</p>"], "link": "http://www.extremetech.com/gaming/204148-arm-details-its-upcoming-cortex-a72-microarchitecture"},
{"category": [], "category2": [], "author": ["Joel Hruska"], "headline": ["General Motors, John Deere want to make tinkering, self-repair illegal"], "image": ["http://www.extremetech.com/wp-content/uploads/2015/04/JD1-348x196.jpg"], "content": ["<p>The ability to modify a vehicle you’ve purchased is, in many ways, a fundamental part of America’s car culture — and, to some extent, embedded in our culture, period. From the <em>Fast &amp; Furious</em> saga to Han Solo’s “She may not look like much, but she’s got it where it counts, kid. I’ve made a lot of special modifications,” we value the right to tinker. More practically, that right can be critically important when it comes to fixing heavy farm equipment. That’s why it’s significant that companies like John Deere and General Motors have joined forces to argue that no, you don’t actually <em>own</em> the equipment you purchase at all.</p>", "<p>The tractor and farm equipment manufacturer doesn’t mince words. “In the absence of an express written license in conjunction with the purchase of the vehicle [to operate its software], the vehicle owner receives an implied license for the life of the vehicle to operate the vehicle, subject to any warranty limitations, disclaimers or other contractual limitations in the sales contract or documentation.”</p>", "<p>GM, meanwhile, alleges that “Proponents incorrectly conflate ownership of a vehicle with ownership of the underlying computer software in a vehicle.” The problem with these arguments is that while existing software laws confirm that individuals are licensing code rather than purchasing it when they buy a license from Adobe or Microsoft, the cases in question did not generally anticipate that the code would be used to artificially create extremely high barriers to repair. As tractors have gone high tech, John Deere has aggressively locked away critical information needed for adjusting either aspects of the vehicle’s timing and performance or the necessary information to troubleshoot problems. Kyle Wiens <a href=\"http://www.wired.com/2015/04/best-tvs-right-now/\">wrote about the issue</a> a few months back, noting how John Deere’s own lockouts and high-tech “solutions” have supposedly caused a spike in demand for older, simpler vehicles. Farmers, it seems, don’t like having to pay expensive technicians. As a result, the used tractor business is booming.</p>", "<p>Both companies go on to assert that the Copyright Office shouldn’t consider allowing tractor owners or car enthusiasts make any sort of modifications to their vehicles because doing so might enable piracy through the vehicle entertainment system. While this is theoretically possible in a modern car, I suppose, if improbable, it’s downright laughable in a tractor. A new tractor can cost upwards of $100,000 — is anyone seriously going to pirate One Direction CDs while ploughing a field?</p>", "<p>The other argument — that users will abuse these capabilities to engage in unsafe or dangerous activities — ignores the fact that Americans enjoyed this level of tweaking and tuning for <em>decades</em>. True, a modern computer system might make it easier to modify certain characteristics, but it’s not as if the concept of tuning a car got invented alongside OBD-II.</p>", "<p>John Deere makes a number of scare tactic allegations around the very idea of a modifiable tractor, including this gem: “Third-party software developers, pirates, and competing vehicle manufacturers will be encouraged to free-ride off the creativity and significant investment in research and development of innovative and leading vehicle manufacturers, suppliers, and authors of vehicle software. The beneficiaries of the proposed exemption will not be individual vehicle owners who allegedly want to repair, redesign or tinker with vehicle software, but rather third-party software developers or competing vehicle manufacturers who — rather than spending considerable resources to develop software from scratch — instead would be encouraged to circumvent TPMs in order to make unauthorized reproductions of, and derivative works based on, the creativity of others.”</p>", "<p>Just in case you’re confused, we’re still talking about tractors — not someone stealing the crown intellectual property of a literary genius.</p>", "<p>I’ve never modded my car and I haven’t been near a tractor in decades. But the reason this fight matters is directly rooted in the ability to repair <em>anything.</em> With multiple manufacturers shoving the concept of an <a href=\"http://www.extremetech.com/?x=0&amp;y=0&amp;s=Internet+of+Things\">Internet of Things</a> full throttle, how long before basic appliance repair has become something you can only perform with a licensed technician? It’s not an altogether crazy concept. Device and appliance manufacturers have fought to build repair monopolies for decades in various industries, with generally limited success.</p>", "<p>Thanks to the DMCA and the rules of software licensing, those efforts could finally succeed in the 21st century. As the IoT advances, virtually everything can be locked off and limited to only those shops that can afford sophisticated diagnostic equipment — thereby limiting user choice and freedoms.</p>"], "link": "http://www.extremetech.com/extreme/203913-general-motors-john-deere-want-to-keep-tinkering-self-repair-illegal"},
{"category": [], "category2": [], "author": ["Joel Hruska"], "headline": ["AMD leaks Microsoft’s plans for upcoming Windows 10 launch"], "image": ["http://www.extremetech.com/wp-content/uploads/2015/04/Win10-1-348x196.jpg"], "content": ["<p>One <a href=\"http://www.extremetech.com/extreme/203750-server-woes-final-itanium-processor-will-be-32nm-amds-arm-servers-delayed-a-full-year\">last tidbit</a> related to AMD’s last conference call that doesn’t have much to do with AMD itself, but sheds light on Microsoft’s plans for Windows 10. During the call, CEO Lisa Su was asked whether she could clarify how Q2 results were expected to play out with regards to both the semicustom and embedded business (Xbox One and PS4) against the more mainstream APU and GPU business. Su responded by saying that she expected the semicustom business to be up “modestly,” and that AMD would move some inventory in Q2 and begin ramping Carrizo in greater volume. She then went on to say:</p>", "<p>“What we also are factoring in is, you know, with the Windows 10 launch at the end of July, we are watching sort of the impact of that on the back-to-school season, and expect that it might have a bit of a delay to the normal back-to-school season inventory build-up.” AMD could be wrong, of course, but it’s unlikely — the company almost certainly knows when Microsoft intends to launch the new operating system, and this isn’t the first time we’ve heard rumors of a summer release date for the OS.</p>", "<p>It’s possible that AMD intends to capitalize on the launch with a new push around the GPU architecture its currently expected to launch in approximately the same time frame. The company wouldn’t need to launch alongside the operating system, but hitting the streets a few weeks early would build buzz around DX12 and other performance enhancements baked into Windows 10 before the actual OS debuts.</p>", "<p>The big question on everyone’s mind in the PC industry is going to be <a href=\"http://www.extremetech.com/extreme/191295-how-to-download-and-install-the-windows-10-technical-preview\">whether Windows 10 lives up to the hype</a>. So far, it seems as if it will. I’m not claiming people will be lining up around the blocks to grab it, but I think there’s a decent chance that Windows 7 users, who gave Windows 8 a pass, will investigate Windows 10 — especially given the <a href=\"http://www.extremetech.com/gaming/198964-dx12-confirmed-as-windows-10-exclusive-amd-and-nvidia-go-head-to-head\">long-term advantages of DirectX 12.</a></p>", "<p><iframe src=\"https://www.youtube.com/embed/S3PPXX9fa5U\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>", "<p>It’s not clear yet how quickly games will transition to the new API, or how long they’ll support both DX12 and DX11. From past experience, we’d expect to see high-end AAA games popping out in DX12 in short order (the Star Wars Battlefront title that debuted last week will be DX12). Plenty of other games will transition more gradually, however, and it wouldn’t surprise us to see a few DX9 titles still knocking about — indie games and small developers have very different budgets compared with the big game studios.</p>"], "link": "http://www.extremetech.com/gaming/203827-amd-leaks-plans-for-upcoming-windows-10-launch"}]