[{"category": ["hardware"], "category2": ["none"], "author": ["Lee Mathews"], "headline": ["Ex-NASA engineer wants to use drones to plant a billion trees a year"], "image": ["http://www.geek.com/wp-content/uploads/2015/04/drone-planting-590x330.jpg"], "content": ["<p>The U.S. military has been using <a href=\"http://www.geek.com/tag/drones/\">drones</a> for years. Now, a new company called BioCarbon Engineering plans to use UAVs to wage war, too… against deforestation.</p>", "<p>CEO Lauren Fletcher is a former <a href=\"http://www.geek.com/tag/nasa/\">NASA</a> engineer, and he and his team are shooting (quite literally) for <a href=\"http://www.independent.co.uk/news/world/exnasa-man-to-plant-one-billion-trees-a-year-using-drones-10160588.html\" target=\"_blank\">a billion trees a year</a>. They’re working with drone experts at VulcanUAV, who don’t build dainty little flying machines that let you spy on your neighbors. They build muscular machines that can carry payloads up to 8 kilograms — perfect for the kind of work BioCarbon has planned.</p>", "<p><iframe src=\"https://player.vimeo.com/video/118457337?color=ffffff&amp;title=0&amp;byline=0&amp;portrait=0?wmode=transparent\" width=\"590\" height=\"332\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>", "<p>Their planting system is a bit like a drone-mounted paintball gun. A pressurized air canister provides the force required to fire “rounds” into the ground. Instead of paintballs, the drones will shoot biodegradable, spherical pods which contain pre-germinated seeds and a nutrient-rich gel. Apart from serving up a nutritional boost to the seeds, the gel also provides a bit of protection during impact.</p>", "<p>Before BioCarbon’s UAVs are sent out on a reforestation run, another set of drones head to the drop zone to do a bit of scouting. They produce detailed 3D maps of the area, which helps the team figure out where to send the planting drones and maximizes success rates.</p>", "<p>BioCarbon’s drone fleet has some major advantages over traditional re-planting methods. For one thing, it’s cheaper than paying van loads of university students to manually plant trees while listening to Phish MP3s. It’s also more efficient than aerial drops, where there’s no guarantee that the seeds will actually germinate and take root.</p>"], "link": "http://www.geek.com/science/ex-nasa-engineer-wants-to-use-drones-to-plant-a-billion-trees-a-year-1621454/"},
{"category": ["gaming"], "category2": ["none"], "author": ["Brooke Jaffe"], "headline": ["Will the future of gaming be free-to-play?"], "image": ["http://www.geek.com/wp-content/uploads/2015/04/South-Park-Freemium-Is-Not-Free-Review-590x331.jpg"], "content": ["<p>Last month, Nintendo announced that they will be <a href=\"http://www.geek.com/games/nintendo-unlocks-its-ip-for-mobile-games-1618178/\">stepping into the mobile gaming market</a>. <em>Pokemon Shuffle</em> is one of the first titles, which fellow Geek.com author Matthew Humphries has (accurately) called “a <a href=\"http://www.geek.com/games/pokemon-shuffle-is-the-candy-crush-clone-we-expected-1616122/\"><em>Candy Crush</em> clone</a>.” Suffice it to say, gamers are conflicted. Some people are excited that Nintendo is finally on mobile platforms, while others feel Nintendo is “selling out” — but this whole situation has people asking a question that is only becoming more and more important to gamers at-large: is free-to-play the future of gaming?</p>", "<p><a href=\"http://www.geek.com/wp-content/uploads/2015/04/iphone-6-pokemon-shuffle-590x330.jpg\"><img class=\"alignnone wp-image-1620349 size-full\" src=\"http://www.geek.com/wp-content/uploads/2015/04/iphone-6-pokemon-shuffle-590x330.jpg\" alt=\"Pokemon Shuffle\" width=\"590\" height=\"330\"></a></p>", "<p>Let’s talk terminology for a second. What’s the difference between “free-to-play” and “freemium” games? There isn’t one. They are two terms used to describe the same business model: give users a basic content loop for free, offer extra content for a price, and get them to pay for “premium” service. Hence the name “freemium.” “Free” plus “premium.” The games are free to download and (technically) free to play, but the free content is simple, and any and all “premium content” (including levels, extra lives, shortened waiting times, and so on) is for purchase only. They seek to get users hooked on the basic game so that they are willing to pay for more. The alternative to buying those in-game perks usually involves waiting a long period of time to be able to continue playing, or building up ridiculous amounts of in-game currency to purchase these things with in-game points.</p>", "<p>For example, in a game like <em>Candy Crush</em>, if you lose all of your lives then you have to wait a set amount of time for them to replenish — or you can purchase those lives with real money and get them automatically. Because the player wants to continue playing the game, they might make the decision to buy those lives for a fee.</p>", "<p>According to the 2014 Entertainment Software Association’s <a href=\"http://www.theesa.com/wp-content/uploads/2014/10/ESA_EF_2014.pdf\">yearly report</a>, casual games are the most popular genre in mobile play, making up 46% of games played. 47% of free-to-play games have an average of $0.25 spent per household each day. Multiply that by hundreds, thousands, millions of users, and you have a lot of money. In 2012, apps earned $10 billion dollars in revenue, and games were 80% of those purchases.</p>", "<p>So, why the two names? You’ll see companies who make freemium games call them “free-to-play” more often than not. It has a nice sound to it: “free to play” makes it seem like it’s just a free game, no payment involved. What goes unsaid is that these games are “free to play,” but not “free to play in their entirety.” Just calling them “free-to-play” avoids that unseemly caveat. “Freemium,” on the other hand, has a negative connotation due in part to the <em>South Park</em> episode “Freemium Isn’t Free,” in which Stan gets addicted to freemium games. The episode breaks down the freemium model and heavily criticizes it for being deceptive and exploitative.</p>", "<p><iframe src=\"https://secure.hulu.com/embed.html?eid=GrhRFSaMSQa2VcOMM3ub9A&amp;partner=southpark&amp;sourceUrl=http%3A%2F%2Fsouthpark.cc.com%2Fclips%2F44wh2k%2Fseeing-through-the-charade%23source%3D08f60a6f-24a8-4d88-88a3-eb5588494cbc%3Ac6cbd5e3-7eae-4cc3-94b7-119c8d412f99%26position%3D76%26sort%3Dairdate&amp;embed_age_gate_intro=true?wmode=transparent\" width=\"590\" height=\"331\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"></iframe></p>", "<p><iframe src=\"https://secure.hulu.com/embed.html?eid=r7TGbk4f7DvW0IgSaEQrig&amp;partner=southpark&amp;sourceUrl=http%3A%2F%2Fsouthpark.cc.com%2Fclips%2Fsrfuqa%2Feveryone-is-doing-this%23source%3D08f60a6f-24a8-4d88-88a3-eb5588494cbc%3Ac6cbd5e3-7eae-4cc3-94b7-119c8d412f99%26position%3D81%26sort%3Dairdate&amp;embed_age_gate_intro=true?wmode=transparent\" width=\"590\" height=\"331\" frameborder=\"0\" scrolling=\"no\" allowfullscreen=\"allowfullscreen\"></iframe></p>", "<p>Whether games are called “free-to-play,” “free-to-start,” or “freemium,” they’re selling you the same business model.</p>", "<p>Where did this trend in game development come from? It started with DLC, which has been around for way longer than many give it credit for. It used to be free, but pretty minimal because early systems had limited internet support. Microsoft pretty much patented DLC as we know it with the Xbox Live, bringing extra content to games such as <em>Halo 2</em> and <em>Ninja Gaiden</em>.</p>", "<p>It wasn’t until the generation of consoles like Xbox 360 and PS3 that DLC started to become a widely accepted and used concept, and became a commodity to pay for. Even Nintendo <a href=\"http://www.geek.com/games/fire-emblem-awakening-first-to-get-paid-dlc-on-3ds-1452881/\">jumped on that bandwagon</a>.</p>", "<p>That approach translated naturally to social gaming. Remember <a href=\"http://www.geek.com/tag/farmville/\"><em>FarmVille</em></a>? Remember the original <em>Words With Friends</em>? Back in 2009-2010 they were the most exciting things in social network development because they were harnessing a huge amount of Facebook’s user base and generating a surprising amount of money. Those games ran on getting other people to play, and if not that then paying for in-game content. Those games died out as gaming started shifting over to mobile — titles such as <em><a href=\"http://www.geek.com/tag/plants-vs-zombies/\">Plants Vs. Zombies</a> </em>and <em>Fruit Ninja</em> became popular. Remember back when those games were free?</p>", "<p>Old game models that are tried and true are now given new skins and in-game app purchases. Look at <em>Words With Friends</em> (AKA digital <em>Scrabble</em>), or <em>Candy Crush</em> (AKA <em>Bejeweled</em>). The latter is one of the most famous mobile games around right now, with <a href=\"http://money.cnn.com/2014/03/25/investing/king-digital-ipo\">93 million users playing daily</a> and an annual revenue of $1.9 billion dollars. Yeah, <em>billion</em>.</p>", "<p>Mobile games are diversified for all different audiences to broaden their appeal and attract more users — so where you have “casual” games like <em>Angry</em> Birds, you also have “moderate” games such as the strategy MMO <em>Clash of Clans</em> <a href=\"http://developers.magmic.com/demographic-breakdown-casual-mid-core-hard-core-mobile-gamers/\">reporting revenue of $700,000 per day</a>.</p>", "<p>Where one idea makes money, other companies expand it to make more.</p>", "<p>Next page: <a href=\"http://www.geek.com/rant/will-the-future-of-gaming-be-free-to-play-1620348/2/\">The dark side of the future</a></p>"], "link": "http://www.geek.com/games/will-the-future-of-gaming-be-free-to-play-1620348/"},
{"category": ["hardware"], "category2": ["business"], "author": ["Matthew Humphries"], "headline": ["Audi develops synthetic diesel from CO2"], "image": ["http://www.geek.com/wp-content/uploads/2015/04/audi_ediesel_03-590x330.jpg"], "content": ["<p>If you believe companies such as Tesla, the future of car travel is all about electricity and batteries, but then you have Toyota claiming electric cars <a href=\"http://www.geek.com/news/chief-toyota-engineer-says-electric-cars-are-not-practical-1620539/\">just aren’t practical</a> and instead wants hydrogen-power. Now we have a third car company entering the fray in the form of Audi, and it may have the best alternative yet.</p>", "<p>Audi has setup an experimental production facility in Dresden, Germany, which is producing a synthetic form of diesel to power vehicles. The key feature of this e-diesel is the fact it is <a href=\"https://www.audi-mediaservices.com/publish/ms/content/en/public/pressemitteilungen/2015/04/21/fuel_of_the_future.html\" target=\"_blank\">produced using water and CO2</a>. Just as importantly, the fuel can be used in existing diesel engine vehicles without any modifications being required, either as a mix with gasoline or as a complete fuel solution on its own.</p>", "<p><a href=\"http://www.geek.com/wp-content/uploads/2015/04/audi_ediesel_01.jpg\"><img class=\"alignnone size-medium wp-image-1621478\" src=\"http://www.geek.com/wp-content/uploads/2015/04/audi_ediesel_01-590x417.jpg\" alt=\"audi_ediesel_01\" width=\"590\" height=\"417\"></a></p>", "<p>This synthetic diesel does require resources to produce, but <a href=\"http://www.geek.com/tag/audi/\">Audi</a> says it is a green form of energy because of the way it is made. Water is heated to form steam which is then broken down into hydrogen and oxygen using high-temperature electrolysis. That process requires a temperature of 800 degrees Celsius, but Audi says they use heat recovery to ensure an efficient system and green energy sources for the initial heating.</p>", "<p>CO2 then reacts with the hydrogen in a synthesis reactor under pressure at high temperature to produce a liquid called blue crude. It is then refined to become e-diesel, which is free of both sulfur and “aromatic hydrocarbons.”</p>", "<p><a href=\"http://www.geek.com/wp-content/uploads/2015/04/audi_ediesel_02.jpg\"><img class=\"alignnone size-medium wp-image-1621479\" src=\"http://www.geek.com/wp-content/uploads/2015/04/audi_ediesel_02-590x393.jpg\" alt=\"audi_ediesel_02\" width=\"590\" height=\"393\"></a></p>", "<p>Audi gets the CO2 it needs for this process from a biogas facility and through direct air capture. The plan is to produce just under 800 gallons of the synthetic <a href=\"http://www.geek.com/tag/diesel/\">diesel</a> in the coming months before deciding on the next stage. What isn’t mentioned is how this e-diesel impacts car emissions. Does it produce any, less than standard diesel, the same, or more?</p>"], "link": "http://www.geek.com/science/audi-develops-synthetic-diesel-from-co2-1621481/"},
{"category": ["mobileTablet"], "category2": ["none"], "author": ["Grant Brunner"], "headline": ["Geek deals: Lenovo Yoga Tablet 2 10-inch Android tablet with a kickstand for $220"], "image": ["http://www.geek.com/wp-content/uploads/2015/04/Yoga-Tablet-2-590x330.png"], "content": ["<p>Android tablets have a reputation of being small and underpowered, and far too many of them fit that description. Thankfully, that stereotype doesn’t apply to all Android tablets — take the Yoga Tablet 2 from Lenovo for example. With a nice big screen, a quad-core CPU, and all-day battery life, this is a tablet that fits just about any lifestyle.</p>", "<p><a href=\"http://www.geek.com/wp-content/uploads/2015/04/Android-Tablet.png\"><img src=\"http://www.geek.com/wp-content/uploads/2015/04/Android-Tablet.png\" alt=\"Yoga Tablet 2\" width=\"300\" height=\"169\" class=\"alignright size-full wp-image-1621438\"></a> Inside, this powerful tablet features a quad-core 1.33GHz Intel Atom Z3745 CPU, 2GB of RAM, and 16GB of flash storage. Additionally, it includes a gorgeous 10.1-inch 1920×1200 IPS display, a 1.6 megapixel front-facing camera, and an eight megapixel rear-facing camera. </p>", "<p>It ships running Android 4.4 Kitkat, weighs in at just over 1.3 pounds, and benefits from 18 hours of battery life between charges. This is an awesome tablet from tip to tail, and the built-in kickstand makes it even easier to recommend. Simply unfold the stand, and prop up your device without the need of a bulky case. And thanks to the battery cylinder on the edge, you’ll be able to comfortably hold your tablet for long stretches.</p>", "<p>Now, this model retails for roughly 300 bucks under normal circumstances, but Lenovo is selling it directly on their online store for $249.99. And if you use the coupon code “<strong>USPYT1085423</strong>” in your shopping cart, you’ll save an additional $30. Thanks to the free standard shipping from Lenovo, you end up only paying $219.99 for US orders. This deal is just too good to pass up, so get your order in ASAP.</p>", "<p><em>Our commerce group sources the best deals and products for the Geek Deals posts. We operate independently of Editorial and Advertising and may earn a percentage of the sale, if you buy something via a link on the post. If you are interested in promoting your deals, please contact us at <a href=\"mailto:commerce@ziffdavis.com\">commerce@ziffdavis.com</a>.</em></p>", "<p>For more great deals head over to <a href=\"http://www.techbargains.com?source=geek\">TechBargains</a>.</p>"], "link": "http://www.geek.com/deals-2/geek-deals-lenovo-yoga-tablet-2-10-inch-android-tablet-with-a-kickstand-for-220-1621433/"}]