[{"category": ["mobileTablet"], "category2": ["business"], "author": [], "headline": ["Jay Z: My App Has Been Smeared By Big Firms"], "image": ["http://media.skynews.com/media/images/generated/2015/3/31/381008/default/v1/487875769-1-362x204.jpg"], "content": ["<p class=\"story__intro\">Jay Z claims big companies are \"spending millions on a smear campaign\" against his new music streaming service Tidal.</p>", "<p>The app - which promises to pay a 75% royalty rate to artists - has slipped out of the top 700 Apple store apps while rival Spotify has soared.</p>", "<p>The rapper took to Twitter to defend his service, which is co-owned by artists including Kanye West, Madonna, Jack White and Daft Punk.</p>", "<p>He wrote: \"The iTunes Store wasn't built in a day. It took Spotify nine years to be successful. We are here for the long haul.</p>", "<p>\"Please give us a chance to grow and get better. There are many big companies that are spending millions on a smear campaign.</p>", "<p>\"We are not anti-anyone, we are pro-artist and fan. We made Tidal for fans.\"</p>", "<p>Tidal was launched by Scandinavian company Aspiro in October 2014, and was acquired by Jay Z's company Project Panther in March 2015.</p>", "<p>The service was relaunched on 30 March at a news conference featuring the multimillionaire co-owners of the service.</p>", "<p>The artists announced that they wanted to \"change the status quo\" and \"forever change the course of music history\".</p>", "<p>But some artists have been critical of the service.</p>", "<p>Death Cab for Cutie's Ben Gibbard said: \"I think they totally blew it by bringing out a bunch of millionaires and billionaires and propping them up onstage and then having them all complain about not being paid.\"</p>"], "link": "http://news.sky.com/story/1472941/jay-z-my-app-has-been-smeared-by-big-firms"},
{"category": ["business"], "category2": ["none"], "author": [], "headline": ["EBay Boss Backs Google In EU Competition Case"], "image": ["http://media.skynews.com/media/images/generated/2013/4/30/235242/default/v1/141396475-1-362x204.jpg"], "content": ["<p class=\"story__intro\">The boss of eBay has backed Google in its antitrust battle with the European Union by saying the pair are direct competitors in online shopping.</p>", "<p>The European Commission's competition experts claim Google abused its dominance of web search to gain an advantage over rival shopping search engines.</p>", "<p>Google responded by saying it was dwarfed in web shopping by the likes of Amazon and eBay.</p>", "<p>Now eBay's chief executive John Donahoe has apparently backed Google's stance in an interview with the Financial Times, saying that his company was a \"strong commerce competitor of Google\".</p>", "<p>European competition commissioner Margrethe Vestager says Google's share of more than 90% of the general web search market in Europe is evidence of its influence.</p>", "<p>But Google says its influence in the world of online shopping is overstated, pointing out that it is overshadowed by Amazon and eBay in some European countries.</p>", "<p>Google Shopping had 13 million unique visitors in Europe in February, compared with more than 100 million each for eBay and Amazon.</p>", "<p>However Shivaun Raff, founder of rival price comparison site Foundem, said: \"As Google is well aware, neither Amazon nor eBay are rivals to Google’s shopping comparison service.\"</p>"], "link": "http://news.sky.com/story/1473063/ebay-boss-backs-google-in-eu-competition-case"}]