[{"category": ["gaming"], "category2": ["none"], "author": ["Jose Vilches"], "headline": ["Call of Duty: Black Ops III gets November launch date, sci-fi action packed reveal trailer is here"], "image": ["http://www.techspot.com/images2/news/bigimage/2015-04-27-image-2.jpg"], "content": ["<p>After a series of teases over the past few weeks, Activision and Treyarch have <a href=\"http://www.forbes.com/sites/erikkain/2015/04/26/black-ops-3-release-date-announced-comes-with-a-twist/\">officially unveiled</a> Call of Duty: Black Ops III, alongside a reveal trailer showing shows plenty of sci-fi action featuring robots, drones, and cyborg soldiers.</p>", "<p>The game will be set 50 years in the future where external “cyber rigs” and bio-augmentation have bred a new type of soldier. Players will assume the role of Black Ops soldiers that are interconnected with an intelligence grid through Direct Neural Interface technology. They are able to boost jump in any direction, wall-run along vertical surfaces, perform power slides and mantle over obstacles, all while maintaining the ability to aim and fire at enemies.</p>", "<p>This, thanks to a new momentum-based, chained movement system that allows players to move fluidly through environments and maintain control of their weapon -- something that’s already drawing <a href=\"http://www.eurogamer.net/articles/2015-04-27-wall-running-power-slides-and-mini-gun-wielding-robots-what-black-ops-3-brings-to-the-call-of-duty-formula\">Titanfall comparisons</a>.</p>", "<p>This year’s Call of Duty release will rely less on its “corridor”-style of level design in favor of open environments offering more space and freedom to explore. The game also introduces a new four-player co-operative campaign mode, allowing you to play through the story with up to four friends online.</p>", "<p>Other things to look forward to include a new weapon customization system, as well as the Specialist system, which lets users choose between nine elite Black Ops troopers, each with a unique appearance, personality, backstory, weapons, and abilities. Competitive multiplayer will also be a big part of the experience and Treyarch's signature Zombie mode is making a comeback too.</p>", "<p><img alt=\"call duty black ops iii black ops call of duty ps4 pc playstation 4 xbox one first person black ops 3\" src=\"http://www.techspot.com/images2/news/bigimage/2015-04-27-image-3.jpg\"></p>", "<p>The game will be launching on Xbox One, PlayStation 4 and PC on November 6th. A multiplayer beta will be launching at some point in the future for those who pre-order the game now. Minimum specs for the game include:</p>"], "link": "http://www.techspot.com/news/60488-call-duty-black-ops-iii-get-november-launch.html"},
{"category": ["wearables"], "category2": ["hardware"], "author": ["Tim Schiesser"], "headline": ["iFixit tears down the Apple Watch, finds tightly-packed internals"], "image": ["http://www.techspot.com/images2/news/bigimage/2015-04-24_02-44-38.jpg"], "content": ["<p>Today is that day that the Apple Watch begins arriving at the doorsteps of those lucky enough to have pre-ordered a first-round unit. iFixit has already received a 38mm Sport model with a blue Sports Band, and as usual, they've decided to give the smartwatch <a href=\"https://www.ifixit.com/Teardown/Apple+Watch+Teardown/40655\">the full teardown treatment</a>.</p>", "<p>To access the innards of the Apple Watch, iFixit first removed the display, revealing a small 205 mAh battery that occupies around half of the internal space. Above the battery is Apple's Taptic Engine, which is a linear actuator that provides haptic feedback paired with a subtle speaker.</p>", "<p>Behind the Taptic Engine and the battery is where the Apple S1 processor can be found, housing basically all of the chips required for the smartwatch's operation including the CPU, GPU, RAM, NAND and wireless radios. iFixit notes that the S1 is actually pretty difficult to remove, and it's unlikely that this will be an upgradeable part as was originally rumored.</p>", "<p><img src=\"http://www.techspot.com/images2/news/bigimage/2015-04-24_02-45-57.jpg\"></p>", "<p>Underneath the S1 is a range of sensors, and around the edges are connectors for the clever digital crown, and the side button. Many of the components are well integrated and sealed, as the Apple Watch is IPX7 water resistant, allowing submersion in 1 meter of fresh water for up to 30 minutes.</p>", "<p>Several of the Apple Watch's components appear to be quite difficult to access and replace, especially in the 38mm model that iFixit tore down. The 42mm model is expected to have a slightly larger battery, but an internal layout that's largely the same. If you need to replace something from inside the smartwatch, it might be best to leave it to Apple.</p>"], "link": "http://www.techspot.com/news/60473-ifixit-tears-down-apple-watch.html"},
{"category": ["software"], "category2": ["none"], "author": ["Tim Schiesser"], "headline": ["Microsoft launches new Windows 10 Preview build with range of improvements"], "image": ["http://www.techspot.com/images2/news/bigimage/2015-04-23-image-1.jpg"], "content": ["<p>Microsoft has <a href=\"https://www.thurrott.com/windows/windows-10/3093/microsoft-delivers-windows-10-technical-preview-2-build-10061\">released a new version</a> of the Windows 10 Preview, build 10061, to members of the Insider program for beta testing and feedback. Compared to <a href=\"http://www.techspot.com/news/60211-microsoft-unleashes-spartan-latest-windows-10-preview-build.html\">the previous Preview build</a>, this new build features a number of general improvements, additions and fixes across the board.</p>", "<p>The biggest addition to Windows 10 in this build are updated Mail and Calendar apps, which bring improved performance, more streamlined interfaces, and new features. The Mail app in particular has received a ton of new stuff, such as swipe gestures for flagging and deleting emails, and a revamped authoring experience that \"leverages the familiar and rich capability of Word\".</p>", "<p>Microsoft has also improved Continuum, which is Windows 10's way of modifying system behavior depending on whether a device is being used in a tablet mode with a touchscreen, or in a laptop/desktop mode with a keyboard and mouse. In the latest build of Windows, Microsoft has tweaked Continuum to make certain UI elements more touchable when in tablet mode.</p>", "<p>There are several new theming features in the latest Windows 10 build, including a black system theme, transparency for the Start menu and Taskbar, the ability to resize the Start menu, and new coloring options. On top of this, Microsoft has made some minor visual changes to Task View, and improved the Virtual Desktop experience.</p>", "<p>Windows Insiders in the Fast ring can now download build 10061 through Windows Update. Expect to hear more updates about Windows 10 this time next week as Microsoft's Build 2015 conference kicks off in San Francisco.</p>"], "link": "http://www.techspot.com/news/60457-microsoft-launches-new-windows-10-preview-build-range.html"}]