[{"category": ["business"], "category2": ["none"], "author": [], "headline": ["Amazon web services 'growing fast'"], "image": ["http://ichef.bbci.co.uk/news/200/media/images/82529000/jpg/_82529103_151367140.jpg"], "content": ["<p class=\"story-body__introduction\">Technology giant Amazon has said its web services business generated sales of $1.57bn (£1.04bn) in the first quarter of the year and is profitable.</p>", "<p><a href=\"http://www.bbc.co.uk/news/technology-30276427\" class=\"story-body__link\">Amazon Web Services (AWS) is a cloud computing offering</a> that makes money by charging businesses to host websites and other applications.</p>", "<p>Amazon founder Jeff Bezos said <a href=\"http://phx.corporate-ir.net/phoenix.zhtml?c=97664&amp;p=irol-newsArticle&amp;ID=2039598\" class=\"story-body__link-external\">in a statement</a>: \"Amazon web services is a $5bn business and still growing fast.\"</p>", "<p>The firm's total revenues for the quarter rose by 15% to $22.7bn.</p>", "<p>The increase was stronger than expected, with revenues buoyed by increased sales in North America, Amazon's biggest market. Despite the rise, the company reported a loss of $57m for the quarter.</p>", "<p>Shares in the firm rose nearly 5% in after-hours trading.</p>", "<p>The AWS division provides cloud computing services to household names including Dropbox, Spotify, Netflix, Uber, Samsung and even the CIA - helping them send notifications, stream video and synchronise data.</p>", "<p>The figures for the first time confirm that Amazon's cloud business is the biggest of its kind in terms of revenue.</p>", "<p>On the conference call one of the analysts expressed surprise at the scale of the margins enjoyed by Amazon Web Services.</p>", "<p>The division posted $265m of operating income in the first quarter, which was not only higher than last year's figure, but more importantly not the loss that several analysts had expected.</p>", "<p>Even so, Amazon made clear that its business model for AWS was to innovate quickly and then pass cost savings onto customers in order to remain the dominant player.</p>", "<p>Recent AWS add-ons include Amazon Machine Learning - a service that automatically analyses clients' data to help them reduce their customer churn and a feature that makes it easier for developers to run \"internet of things\" apps.</p>", "<p>Last year AWS' chief told the BBC that the unit could in time become bigger than Amazon's retail business.</p>", "<p>But with Microsoft, Google and IBM among rivals seeking to eat into its market share, the question is whether those margins will hold up over the long term.</p>", "<p><a href=\"http://www.bbc.co.uk/news/technology-30276427\" class=\"story-body__link\">More from Leo: Amazon's bid to power the internet</a></p>", "<p>The profitability of the cloud business could soothe investors, who have been anxious for the firm to turn a profit and stop investing in new projects, which has seen them move into tablet computers, smartphones, and a short-lived nappy service.</p>", "<p>AWS \"was surprisingly more profitable than forecast\", Dan Kurnos, an analyst at the Benchmark Company, told the BBC.</p>", "<p>That \"should help [Amazon] justify their heavy investment spending and provide a clearer path to profitability for the [overall] company as AWS grows,\" he added.</p>", "<p>Michael Pachter, from Wedbush Securities said: \"I think most of us believed that the business [AWS] was breakeven at best, and it is surprising that it generates such a significant portion of profit.\"</p>", "<p>\"The stock is up because it is clear that if that business scales, Amazon can be immensely profitable,\" he added.</p>", "<p>Source: Amazon, unless otherwise stated</p>"], "link": "http://www.bbc.co.uk/news/business-32442268#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa"},
{"category": ["software"], "category2": ["none"], "author": [], "headline": ["Bitcoins 'losing' value for cyber-thieves"], "image": ["http://ichef.bbci.co.uk/news/200/media/images/82537000/jpg/_82537089_81621333.jpg"], "content": ["<p class=\"story-body__introduction\">The falling value of bitcoins have made them much less attractive to cyber-thieves, claims a security expert. </p>", "<p>The anonymity of the virtual cash has made it a favourite with thieves who blackmail victims with viruses.</p>", "<p>Now hi-tech gangs quickly convert payments into other currencies, <a href=\"http://www.theregister.co.uk/2015/04/24/ransomware_bitcoin/\" class=\"story-body__link-external\">said IBM security expert Etay Maor</a> in an interview with The Register.</p>", "<p>One bitcoin is now worth £155, much lower than the £728 value it hit in late 2013.</p>", "<p>Scrambling data with malicious programs known as ransomware - which demand payment from victims to decrypt data - has been popular with some hi-tech criminals over the past few years. The gang behind the notorious cryptolocker program is believed to have made about £2m from victims before it was broken up.</p>", "<p>Bitcoins have been the preferred payment method, said Mr Maor, but the volatility of the currency and its falling value has forced criminals to convert it into other forms of cash as soon as possible.</p>", "<p>\"Most of them won't keep bitcoins - they don't like the valuations bitcoin has - so they just use it as a layer of obfuscation, and move it to a different form of money,\" Mr Maor told The Register during an interview at the RSA security conference in San Francisco. </p>", "<p>Many ransomware gangs use people not directly connected with the gang, known as mules, to clean up the cash by paying it into a legitimate bank account. Mules generally get a 20% cut as a fee. </p>", "<p>Police forces and computer security firms have scored some successes against ransomware gangs. Computers involved in the cryptolocker malware were seized and the encryption system for the program broken so victims could get their data back without paying any cash.</p>", "<p>In addition, Dutch police have worked with security firm Kaspersky Labs to analyse a server seized during an operation against the coinvault ransomware. This led to the creation of a program that can decrypt scrambled data. The firm has also retrieved lots of encryption keys that can be used to unscramble data.</p>"], "link": "http://www.bbc.co.uk/news/technology-32445026#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa"},
{"category": ["software"], "category2": ["none"], "author": ["By Richard Westcott"], "headline": ["Rail signal upgrade 'could be hacked to cause crashes'"], "image": ["http://ichef.bbci.co.uk/news/200/media/images/82528000/jpg/_82528056_43799909-3ba8-4087-9e78-4641e050b952.jpg"], "content": ["<p class=\"story-body__introduction\">A hi-tech signalling system that will eventually control all of Britain's trains could potentially be hacked to cause a serious crash, according to a scientist who advises the government.</p>", "<p>Prof David Stupples told the BBC that plans to replace ageing signal lights with new computers could leave the rail network exposed to cyber-attacks.</p>", "<p>UK tests of the European Rail Traffic Management System are under way.</p>", "<p>Network Rail, which is in charge of the upgrade, acknowledges the threat.</p>", "<p>\"We know that the risk [of a cyber-attack] will increase as we continue to roll out digital technology across the network,\" a spokesman told the BBC.</p>", "<p>\"We work closely with government, the security services, our partners and suppliers in the rail industry and external cybersecurity specialists to understand the threat to our systems and make sure we have the right controls in place.\"</p>", "<p>Once the ERTMS is up and running, computers will dictate critical safety information including how fast the trains should go and how long they will take to stop.</p>", "<p>It is scheduled to take command of trains on some of the UK's busy intercity routes by the 2020s. </p>", "<p>The system is already used in other parts of the world and there are no reported cases of it being affected by cyber-attacks.</p>", "<p>In fact, it is designed to make networks safer by reducing the risk of driver mistakes. </p>", "<p>But Prof Stupples - an expert in networked electronic and radio systems at City University in London - said if someone hacked into the system they could cause a \"nasty accident\" or \"major disruption\".</p>", "<p>\"It's the clever malware [malicious software] that actually alters the way the train will respond,\" he explained.</p>", "<p>\"So, it will perhaps tell the system the train is slowing down, when it's speeding up.\"</p>", "<p>\"Governments aren't complacent\", the professor added. </p>", "<p>\"Certain ministers know this is absolutely possible and they are worried about it. Safeguards are going in, in secret, but it's always possible to get around them.\"</p>", "<p>He added that he had spoken up to raise awareness of the threat.</p>", "<p>\"We keep security arrangements under constant review to take account of the threat and any new challenges we face,\" responded a spokeswoman for the Department of Transport.</p>", "<p>According to the professor, the system is well protected against outside attack, but he says danger could come from a rogue insider.</p>", "<p>\"The weakness is getting malware into the system by employees. Either because they are dissatisfied or being bribed or coerced,\" he explained.</p>", "<p>He added that part of the reason that transport systems had not already been hacked as frequently as financial institutions and media organisations was that much of the technology involved was currently too old to be vulnerable. </p>", "<p>All of that will change in the coming years, as aircraft, cars and trains become progressively more computerised and connected, he said.</p>", "<p>Independent security expert Graham Cluley agreed that the sector could be vulnerable.</p>", "<p>\"Seeing as we have seen nuclear enrichment facilities targeted with state-sponsored malware attacks and 'massive damage' done to a German steelworks, you have to ask yourself whether it is likely that a train signal system would be any better defended?\" he asked.</p>", "<p>\"The most obvious danger is going to be human.</p>", "<p>\"The risk is that staff will either be deliberately and clandestinely assisting attackers or - most likely - make poor decisions, such as plugging in a device that is malware-infected that could expose the system's security.\"</p>", "<p>Prof Stupples said he was working with Cranfield University to develop a security system that would tell when a train or other mode of transport was acting oddly.</p>", "<p>\"It would take it back into a safe state,\" he explained.</p>"], "link": "http://www.bbc.co.uk/news/technology-32402481#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa"},
{"category": ["gaming"], "category2": ["none"], "author": [], "headline": ["Valve expands video game 'mod' market"], "image": ["http://ichef.bbci.co.uk/news/200/media/images/82541000/jpg/_82541411_88b8eaa0-de49-45df-9389-c9e7c4d07e35.jpg"], "content": ["<p class=\"story-body__introduction\"><a href=\"http://steamcommunity.com/workshop/aboutpaidcontent/\" class=\"story-body__link-external\">Game maker Valve has expanded its online store</a> to let players who make modifications or 'mods' for games sell their creations.</p>", "<p>Modifications can make small changes to games or be huge collaborative efforts that add extra challenges, levels and foes or improve graphics.</p>", "<p>The first game for which mods can be sold is fantasy role-playing title Elder Scrolls V: Skyrim.</p>", "<p>Valve said it would let modders of other games add their creations soon.</p>", "<p>Valve has long run a workshop on its Steam game service that lets people share their extras and additions, but before now creators only got free downloads in return for their work. Steam is believed to have about 125 million active users.</p>", "<p>The only situation in which players got cash for their creations was when they made something for a Valve game that was added to the title as an official new feature. Many other games operate similar systems that reward players.</p>", "<p>Creators who use the store will be able to choose how much people pay for their mods, extras and add-ons. If they do not want to sell them they can be given away free. If they are sold, 25% of the payment will go to the creator, the rest is being split with Valve and the studio or developer who originally made the game. </p>", "<p>The change might prove lucrative for people who produce a popular mod. In January this year Valve announced that it had paid out more than $57m (£37.6m) to 1,500 people who made extras for its games. </p>", "<p>So far, 19 different paid mods for Skyrim are available on the Steam Workshop site that give players new weapons, locations and characters. Prices for these add-ons range from a few pence to a few pounds. In the Workshop there are currently more than 24,000 free mods for the game. </p>", "<p>Valve said it had put in place security systems that can spot if people are trying to pass off someone else's creations as their own. In addition, mod makers can file \"take down\" notices via the Workshop to stop copycats and pirates stealing their work.</p>", "<p>Many gamers took to Steam's discussion forums to express their opinions about the change. Many criticised Valve for taking a 75% cut and voiced their disquiet about paying modders for their work.</p>", "<p>Game journalist John Bain, aka Total Biscuit, <a href=\"https://www.youtube.com/watch?v=oGKOiQGeO-k\" class=\"story-body__link-external\">said Valve had opene</a>d a \"gigantic can of worms\" by making the change. He criticised Valve over the payment split, he also wondered how it would go about policing who made which mod and asked what help people would get if mods conflicted. </p>", "<p>\"There is absolutely a fear among the player base that a lot of mods they were used to enjoying will now be put behind a paywall,\" he said \"I understand that fear but simultaneously the expectation that you should always have access to the latest versions of these mods for free is based on old logic.\"</p>", "<p>Mr Bain said many modders may well have charged for their creations before now if it had been easy to do so.</p>"], "link": "http://www.bbc.co.uk/news/technology-32449141#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa"},
{"category": ["business"], "category2": ["none"], "author": [], "headline": ["Ellen Pao faces $1m legal bill in sexism case"], "image": ["http://ichef.bbci.co.uk/news/200/media/images/82536000/jpg/_82536920_465789426-1.jpg"], "content": ["<p>Ellen Pao, the woman who took a Silicon Valley firm to court over sexism claims and lost, has been asked to pay legal costs of nearly $1m (£660,000).</p>", "<p>Venture capital firm Kleiner Perkins has said it will waive these costs if former employee Ms Pao does not appeal against the jury's decision.</p>", "<p>Ms Pao's legal team is currently considering the proposal.</p>", "<p>The high-profile case prompted a wider examination of gender bias in Silicon Valley.</p>", "<p>Ms Pao was sacked from Kleiner Perkins - which has invested in a variety of successful technology firms, including Snapchat, Spotify, Uber, Twitter and Google - in 2012.</p>", "<p>She now faces a legal bill of around $973,000 after she failed to convince jurors at the San Francisco Superior Court that her firing was due to discrimination.</p>", "<p>Lawyers representing Kleiner Perkins insisted that its decision to sack her was based on poor performance.</p>", "<p>By contrast, her lawyers spoke about a \"boys' club\" atmosphere at the firm and the promotion of male colleagues.</p>", "<p>In March, a jury of six men and six women rejected Ms Pao's claim of discrimination.</p>", "<p>Legal filings made this week from Kleiner Perkins revealed that the firm had offered to settle with Ms Pao for $964,502 last November but said she had never responded.</p>", "<p>In the month-long trial that followed, she sought $16m in lost wages and potential earnings, but has always insisted that bringing the case was about more than just money.</p>", "<p>After the trial, she tweeted: \"Hopefully my case will inspire the venture capital industry to level the playing field for everyone including women and minorities.\"</p>", "<p>While there are some very high-profile senior women in technology - such as Sheryl Sandberg at Facebook and Marissa Mayer at Yahoo - women are generally very under-represented in the industry.</p>", "<p>Women make up about 30% of the global workforces of both Apple and Google, with the numbers even smaller in technical roles.</p>"], "link": "http://www.bbc.co.uk/news/technology-32446358#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa"},
{"category": ["business"], "category2": ["none"], "author": [], "headline": ["Microsoft profits fall but hardware sales rise"], "image": ["http://ichef.bbci.co.uk/news/200/media/images/82529000/jpg/_82529193_xbox.play.g.jpg"], "content": ["<p class=\"story-body__introduction\">Microsoft has reported a 12% fall in profits to $5bn (£3.3bn) in the first three months of 2015.</p>", "<p>The strengthening US dollar had a \"significant impact\" on results, <a href=\"http://www.microsoft.com/investor/EarningsAndFinancials/Earnings/PressReleaseAndWebcast/FY15/Q3/default.aspx\" class=\"story-body__link-external\">the software firm said</a>.</p>", "<p>It also took a a charge of $190m during the quarter to reorganise its business which includes the costs of merging Nokia's handset division.</p>", "<p>However, sales from cloud computing services doubled, beating expectations and sending shares higher.</p>", "<p>Microsoft says that business is expected to generate $6.3bn in annual sales.</p>", "<p>\"We saw incredible growth across our cloud services this quarter,\" said Satya Nadella, chief executive officer at Microsoft in a statement with the earnings release.</p>", "<p>Investors were further pleased by an increase in the firm's hardware sales, which offset declines in its Windows software business.</p>", "<p>Overall, revenue increased by 6% to $21.7bn in the third quarter. Microsoft reports its financial earnings on a calendar year that begins in .July.</p>"], "link": "http://www.bbc.co.uk/news/business-32441334#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa"},
{"category": ["software"], "category2": ["none"], "author": ["By Jane Wakefield"], "headline": ["Map reveals which constituencies have fastest broadband"], "image": ["http://ichef.bbci.co.uk/news/200/media/images/82454000/jpg/_82454003_fibreopticcable.jpg"], "content": ["<p class=\"story-body__introduction\">Labour-controlled constituencies are more likely to have faster broadband, new data suggests.</p>", "<p>Of the top 30 constituencies - areas where 90% or more of premises have speeds of 30Mbps (megabits per second) or higher - 16 are Labour-controlled.</p>", "<p>But 17 of the bottom 30 constituencies - those with only half or fewer premises having superfast broadband - are run by Conservative councils.</p>", "<p>The map was drawn up by<a href=\"http://www.thinkbroadband.com/news/6935-the-worst-and-best-constituencies-for-broadband-as-general-election-looms.html\" class=\"story-body__link-external\"> broadband news website ThinkBroadband</a>.</p>", "<p>Liberal Democrat- controlled constituencies had a similar number at both the top and bottom of the league - five in the top 30 and eight in the bottom 30.</p>", "<p>\"It is interesting that so many Labour seats are towards the top end of the chart,\" said founder of ThinkBroadband Andrew Ferguson.</p>", "<p>\"A lot of this is because Labour seats tend to be in urban areas while Conservative ones tend to control more rural seats.\"</p>", "<p>The map looks at coverage across the UK's 650 constituencies - which, on average, have about 50,000 premises - homes and businesses.</p>", "<p>The map throws up huge contrasts between areas that are close to each other.</p>", "<p>For example, in Wales the constituency of Carmarthen West has 33% of premises with super-fast broadband, compared with just 9.5% in neighbouring Carmarthen East.</p>", "<p>Many of the constituencies in Hull show fairly low levels of superfast broadband, even though much of the broadband rollout is controlled by Kingston Communications which is offering homes extremely fast fibre-to-the-home technology.</p>", "<p>\"Kingston Communications has done a lot of fibre-to-the-home broadband but that technology is slower to roll out and so the total coverage is less,\" said Mr Ferguson.</p>", "<p>It is important to note that the data does not allow anyone to draw conclusions about whether one political party is better than another when it comes to broadband policies, he said.</p>", "<p>\"The UK telecoms market is amazingly diverse and it is impossible to credit any one single political party for the success or otherwise with respect to what services are available as the current situation is the result of some 30 years of regulation,\" he told the BBC.</p>", "<p>But local MPs can exert influence, he added.</p>", "<p>\"What individual politicians can do and should ensure is that those in their constituency are not placed at a significant disadvantage, this could be through ensuring a local authority project covers an area through to ensuring that alternate operators have minimal hurdles to overcome to provide a much-needed service.\"</p>", "<p>All the main parties have included broadband pledges in their manifestos.</p>", "<p>Labour have promised affordable, high-speed broadband across the country by 2020 while the Conservatives pledged to continue with their plans to provide 95% of the UK with superfast broadband by 2017.</p>", "<p>The Liberal Democrat approach reflects the broadband delivery programme currently in motion and which it helped to create.</p>", "<p>It can be difficult to extrapolate what will happen based on election pledges, said Mr Ferguson.</p>", "<p>\"They all make promises but there is little detail on how they will do it.</p>", "<p>\"Whoever gets into power, nothing much will change in the plans up to 2017.  And after that, broadly they all want the same thing - to get to almost universal access eventually,\" he said.</p>"], "link": "http://www.bbc.co.uk/news/technology-32429394#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa"},
{"category": ["mobileTablet"], "category2": ["none"], "author": [], "headline": ["Samsung S5 fingerprint flaw exposed"], "image": ["http://ichef.bbci.co.uk/news/200/media/images/82510000/jpg/_82510644_474668207.jpg"], "content": ["<p class=\"story-body__introduction\">Hackers can take copies of fingerprints used to unlock the Samsung Galaxy S5 phone, claim security researchers. </p>", "<p>A flaw in Android makes it possible to steal the personal information so it can be used elsewhere, said the experts from security firm FireEye.</p>", "<p>Other Android-based phones that also use fingerprint ID systems could also be vulnerable, they said.</p>", "<p>Samsung said it took security \"very seriously\" and was investigating the researchers' findings. </p>", "<p>Fingerprint ID systems are being used more and more in smartphones to unlock the devices or as a way to check who is authorising a transaction. Paypal and Apple already accept fingerprints as an ID check and a growing roster of firms that are members of the Fido Alliance are keen to use them in the same way to remove the need for passwords. </p>", "<p>Android phones typically store sensitive data such as fingerprint information in a walled-off area of memory known as the Trusted Zone. </p>", "<p>However, Yulong Zhang and Tao Wei found it was possible to grab identification data before it is locked away in the secure area. This method of stealing data was available on all phones running version 5.0 or older versions of Android provided the attacker got high level access to a phone. </p>", "<p>They also found that on Samsung Galaxy S5 phones, attackers did not need this deep access to a phone. Instead, they said, just getting access to the gadget's memory could reveal finger scan data. </p>", "<p>Using this information an attacker could make a fake lock screen that makes victims believe they are swiping to unlock a phone when they are actually authorising a payment. </p>", "<p>In addition, they found, it was possible for attackers to upload their own fingerprints as devices did not keep good records of how many prints were being used on each device. </p>", "<p>Mr Zhang and Mr Wei <a href=\"https://www.rsaconference.com/writable/presentations/file_upload/hta-f01-to-swipe-or-not-to-swipe-a-challenge-for-your-fingers_final.pdf\" class=\"story-body__link-external\">are due to present their findings at the RSA security conferenc</a>e in San Francisco on 24 April.</p>", "<p><a href=\"http://www.forbes.com/sites/thomasbrewster/2015/04/21/samsung-galaxy-s5-fingerprint-attacks/\" class=\"story-body__link-external\">In an interview with Forbes magazine</a>, Mr Zhang said the flaws they uncovered were likely to be widespread throughout handsets running Android 5.0 and below. Updating to the latest version of Android, version 5.1.1, should remove the vulnerabilities, he said.</p>", "<p>The flaw is the latest in a series of problems uncovered with fingerprint ID systems on phones. </p>", "<p>In April last year, hackers discovered a way to fool the print sensor on the S5 by taking a photograph of a print left on a smartphone screen, making a mould from the image and using that to make a replica fake finger. </p>", "<p>In 2013, a German hacker group used a similar method to bypass the fingerprint reader on Apple's iPhone 5. Hackers from the Chaos Computer Club used a picture of a person's fingerprint left on a glass surface to make a fake finger that unlocked the phone.</p>"], "link": "http://www.bbc.co.uk/news/technology-32429477#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa"},
{"category": ["business"], "category2": ["none"], "author": [], "headline": ["Google profits buoyed by ad revenue"], "image": ["http://ichef.bbci.co.uk/news/200/media/images/82528000/jpg/_82528973_95920158.jpg"], "content": ["<p class=\"story-body__introduction\">US technology giant Google reported a 4% increase in profits to $3.59bn (£2.38bn), as strong advertising sales helped boost the firm's bottom line.</p>", "<p>Google said advertising sales for the first three months of 2015 were $15.5bn, an 11% increase from the same period a year earlier.</p>", "<p>Total revenue also increased by 12% to $17.3bn, but like other US firms, the company was hurt by the strong dollar.</p>", "<p>Shares in the firm rose more than 3% in trading after markets had closed.</p>", "<p>There had been fears on Wall Street that profits would be weaker due to investment in new businesses and weaker advertising revenue as more people access Google via mobile devices, where advertising rates are lower.</p>", "<p>But the fears turned out to be unfounded - a fall in the average price of an advert was offset by an increase in the number of adverts.</p>", "<p>\"The concern was that the first quarter results could have been much worse,\" Colin Gillis from BGC Financial said. \"There's a certain degree of relief rally happening.\"</p>", "<p><a href=\"https://investor.google.com/earnings/2015/Q1_google_earnings.html\" class=\"story-body__link-external\">In a statement</a> accompanying the results, chief financial officer Patrick Pichette said the company continued \"to see great momentum in our mobile advertising business and opportunities with brand advertisers\".</p>", "<p>However, Google did suffer from the stronger dollar. Taking out the impact of currency movements, Mr Pichette said revenue grew by 17% in the quarter compared with a year earlier.</p>", "<p>The results also showed the firm continued hire new staff at a high rate, with employee numbers up 9,000 over the past year.</p>"], "link": "http://www.bbc.co.uk/news/business-32442265#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa"},
{"category": ["hardware"], "category2": ["none"], "author": [], "headline": ["Enraged US man shoots his malfunctioning computer"], "image": ["http://ichef.bbci.co.uk/news/200/media/images/82475000/jpg/_82475463_82475462.jpg"], "content": ["<p class=\"story-body__introduction\">A man in the US city of Colorado Springs faces police action after becoming so frustrated with his computer that he took it outside and shot it eight times, police say.</p>", "<p>\"He was having technology problems, so he took it to the back alley and destroyed it,\" a police spokesman said.</p>", "<p>Lucas Hinch was briefly detained for discharging a firearm within the city.</p>", "<p>He did not realise he was breaking the law when he went \"Wild West\" on his machine, local media reported.</p>", "<p>A judge is due to decide what penalty he will receive.</p>", "<p>\"He got tired of fighting with his computer for the last several months,\" police spokesman Jeff Strossner told the <a href=\"http://gazette.com/man-kills-computer-in-colorado-springs-alley-gets-revenge-he-wanted-and-a-citation/article/1550042\" class=\"story-body__link-external\">Colorado Springs Gazette</a>.</p>", "<p>The paper said that Mr Hinch \"shot the darn thing\" when ctrl+alt+delete - the traditional method used to re-boot computers - \"consistently did not work\" on Monday evening.</p>", "<p>\"He was able to wreak the kind of revenge most of us only dream about,\" the paper said. \"The computer is not expected to recover.\"</p>"], "link": "http://www.bbc.co.uk/news/world-us-canada-32407688#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa"},
{"category": ["hardware"], "category2": ["none"], "author": ["By Nick Beake"], "headline": ["London airport police to use surveillance drones"], "image": ["http://ichef.bbci.co.uk/news/200/media/images/82523000/jpg/_82523630_drone.jpg"], "content": ["<p class=\"story-body__introduction\">Police guarding London airports will start using drones for surveillance following a review by counter-terrorism officers.</p>", "<p>An 18-month analysis by the National Counter Terrorism Policing Headquarters, which helps develop police policy, found the technology could be \"transformative\".</p>", "<p>Privacy campaigners said they were concerned about the plans. </p>", "<p>Police are also to take over investigations into drone misuse.</p>", "<p>Following a successful trial at Gatwick airport over the past year, drones will be given to units guarding Heathrow, Stansted, Luton and City airports.</p>", "<p>Selected airports in other parts of the UK will also use the technology.</p>", "<p>The equipment will be rolled out over the next 18 months.</p>", "<p>BBC London has also learned police will take responsibility from for investigating the irresponsible or illegal use of drones or unmanned aerial vehicles (UAVs) from the Civil Aviation Authority (CAA).</p>", "<p>There are now estimated to be more than 50,000 drones in the UK and the move reflects growing concern over the damage they could cause in the wrong hands.</p>", "<p>Counter-terrorism officers are also concerned about the publicity extremists could gain if they flew a flag or banner over a prominent central London location. </p>", "<p>On Wednesday a drone carrying radioactive material landed on the roof of the Japanese prime minister Shinzo Abe's residence. No-one was injured.</p>", "<p>George Trebess from the National Counter Terrorism Policing Headquarters said it was also possible that drones could be used during major incidents, including sieges or standoffs involving firearms.</p>", "<p>Speaking to security experts at the Counter Terror Expo in London, he said: \"The technology is transformative.</p>", "<p>\"With the new system we will be able to carry out missions around seven times faster than ground-based activity and at around 10% of the cost. We estimate £1.2m would be saved in three years.\"</p>", "<p>It is thought the savings would come through having fewer officers patrolling airports on foot.</p>", "<p>Emma Carr of Big Brother Watch, which campaigns over state surveillance, called for clear information about how police planned to use the drones.</p>", "<p>She called for a \"better understanding of how they're used and who they're being used by\".</p>"], "link": "http://www.bbc.co.uk/news/uk-england-london-32431630#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa"},
{"category": ["business"], "category2": ["none"], "author": [], "headline": ["Audi and Amazon to try car-boot delivery service"], "image": ["http://ichef.bbci.co.uk/news/200/media/images/82512000/jpg/_82512845_au150270_medium.jpg"], "content": ["<p class=\"story-body__introduction\">Packages could soon be delivered to the boot of your Audi as part of a trial involving the car maker, Amazon and DHL.</p>", "<p>Kicked off by Audi, the system aims to end the frustration of missing the arrival of a package being delivered to home or work.</p>", "<p>Instead, Audi owners will be able to use their car as a shipping address for items ordered online.</p>", "<p>A pilot project to test the system is planned to take place in May in Munich.</p>", "<p>Using Audi's in-car communications system, Connect, DHL delivery drivers would track a customer's vehicle over a specified period of time and then use a digital access code to unlock the boot, the car maker said. This code would then expire as soon as the boot was shut.</p>", "<p>The deliveries will be available only to customers signed up for online retail service Amazon Prime. </p>", "<p>In March, the Federal Aviation Administration, which oversees US airspace, gave Amazon permission to carry out tests using unmanned aerial vehicles, or drones, for its planned PrimeAir service.</p>"], "link": "http://www.bbc.co.uk/news/technology-32431301#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa"},
{"category": ["business"], "category2": ["none"], "author": ["By Zoe Kleinman"], "headline": ["Bitcoin Island: cleaning up the crypto currency"], "image": ["http://ichef.bbci.co.uk/news/200/media/images/82453000/jpg/_82453384_img_20150416_114900-1.jpg"], "content": ["<p class=\"story-body__introduction\">What do Thomas the Tank Engine, lifeboats, pilates, and the Bee Gees have in common?</p>", "<p>They are all success stories from the Isle of Man. </p>", "<p>The small independent island in the middle of the Irish Sea is now hoping to give a wholesome boost to the bad boy of digital currencies, Bitcoin. </p>", "<p>Bitcoin tends to hit the headlines for all the wrong reasons - the spectre of infamous Japanese exchange MtGox, which went bankrupt in 2013 after a spate of hacking resulted in the theft of around 650,000 of the virtual coins (today worth around £150/$223 each), still looms large.</p>", "<p>It has also gained notoriety as the currency for choice for illegal activity because Bitcoin transactions can be carried out anonymously.</p>", "<p>But the Isle of Man government believes a combination of regulation and encouragement can not only reverse Bitcoin's reputation, but also push it towards the mainstream.</p>", "<p>Its attractively low taxes and relaxed legislation have already made the island a popular choice of headquarters for the e-gaming industry. </p>", "<p>Over the last 12 months the government has been working on incorporating Bitcoin into its anti-money-laundering laws.</p>", "<p>\"We also passed through parliament the Designated Businesses Bill, which treats digital currency exchanges the same as any other company holding value for a client in escrow [a form of safe keeping],\" said Peter Greenhill, head of e-gaming in the department of economic development.</p>", "<p>\"Be that a bank, estate agent or accountant - those come under registration with the Financial Supervision Commission.\"</p>", "<p>The government is stopping short of offering customer protection on Bitcoin investments like the UK's Financial Services Authority (FSA), which guarantees individual savings to the value of £80,000 in the event of a bank collapse.</p>", "<p>\"But if we look at the most innovative Bitcoin exchanges they are already putting coins into cold storage, and introducing multiple signatories on coin movement,\" Mr Greenhill added.</p>", "<p>\"What we've done here on the Isle of Man is to recognize there's an area here that's important to the rest of the world that we can move quickly on in regulation. </p>", "<p>\"As long as we do that in a concerted way, to protect individuals and keep crime out, we can respond to the needs of an industry that looks like it's going somewhere.\"</p>", "<p>Entrepreneur Charlie Woolnough set up CoinCorner, the island's only Bitcoin exchange 12 months ago. </p>", "<p>He claims that the exchange already has 10,000 global customers, and 500 merchants are using it to accept digital payments.</p>", "<p>Mr Woolnough told the BBC the banks are still very wary of the digital currency industry.</p>", "<p>\"One big problem we have had as a Bitcoin business is getting access to mainstream banking. If you're being conspiratorial you could say banks view Bitcoin as a threat,\" he said.</p>", "<p>\"Maybe a more rational approach is that they view Bitcoin and fintech as high risk right now.\"</p>", "<p>CoinCorner operates on a Know Your Customer (KYC) basis, meaning that in order to open an account you need to upload official ID, proof of address and have your credit or debit cards verified by the firm before you can buy or sell any Bitcoin.</p>", "<p>Although the exchange has always operated that way, Mr Woolnough is candid about the baggage of legislation, and it certainly slows things down - it took three days for me to open an official account and even then I remained unable to use my cards to buy any currency.</p>", "<p>\"I don't think anyone wants to be regulated,\" he admitted.</p>", "<p>\"With regulation comes cost and there's a burden that comes with it.</p>", "<p>\"But we are acting in a fiduciary capacity - anyone who expects this industry to remain unregulated really is living in cloud cuckoo land. the Isle of Man has just been the first mover in this.</p>", "<p>\"Bitcoin is the currency of the internet and a leading part of fintech.\"</p>", "<p>But outside that rather exclusive world of the financial technology industry, what do the more everyday businesses make of the drive to go digital?</p>", "<p>The Thirsty Pigeon Pub on the Isle of Man town Douglas proudly accepts Bitcoin. </p>", "<p>On the bar in front of the till sits a tablet computer for customers wishing to settle their tab with their digital wallet.</p>", "<p>\"Not many people really understand it I think,\" said landlord Robert Macleer, who admitted that not many Bitcoin payments had been made since a digital currency conference, held on the island last October, attracted Bitcoin enthusiasts in their droves.</p>", "<p>\"People need more information. and more people need to adopt it, more shops more bars.\"</p>", "<p>Taxi driver Nula Perryn, who founded all-female cab company The Lady Chauffeurs, agreed.</p>", "<p>\"We do about 2 or 3 [Bitcoin payments] a week,\" she told the BBC. </p>", "<p>\"I think it's a bit of a gimmick... as a new firm it's something to get us noticed - however I do feel there's a very strong movement from e-gaming. </p>", "<p>\"The government is behind it... there's a lot of will behind it.\"</p>", "<p>Island entrepreneur Adrian Forbes believes one solution may lie in making Bitcoin a lot less ephemeral. </p>", "<p>His new start-up TGBex is selling physical coins (his lawyer is very keen to call them tokens, he insists, as they are not legal tender). Each coin comes with a QR code so that the owner can transfer the value into their digital wallet.</p>", "<p>\"Bitcoin for technophobes is what I like to call it,\" he said.</p>", "<p>\"I have three young kids and I wanted to buy them a bitcoin each - but [some of] the exchanges have failed or been hacked... for me I think offline storage is the safest at the the moment.\"</p>", "<p>It is a high risk investment, he conceded - but he's not keen on the government getting too involved.</p>", "<p>\"I'm not a big fan [of legislation].</p>", "<p>\"I see Bitcoin as something very niche. I don't think it requires same licences as banks and stockbrokers and hedge funds that have a thousand times as much money at stake.</p>", "<p>\"Bitcoin will work best in the third world first. In the west, it's a novelty, niche technology, a bit of fun.</p>", "<p>\"It might be advantageous in terms of speed but there's no real need for it.\"</p>", "<p><a href=\"http://www.bbc.co.uk/programmes/p02p66lf\" class=\"story-body__link\">Hear more from Zoe Kleinman on  the Isle of Man's plans for Bitcoin in the Business Daily podcast</a></p>"], "link": "http://www.bbc.co.uk/news/business-32394170#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa"},
{"category": ["hardware"], "category2": ["none"], "author": ["By Padraig Belton"], "headline": ["Baby baby: The tech that rocks the cradle"], "image": ["http://ichef.bbci.co.uk/news/200/media/images/82442000/jpg/_82442751_thinkstockphotos-465965662.jpg"], "content": ["<p class=\"story-body__introduction\">One day, your grandchildren will be incredulous you survived the cradle without masses of technology.</p>", "<p>The Consumer Electronics Show in Las Vegas, a traditional hotbed of new gadgetry, has rattled with tech for tots over the last few years.</p>", "<p>Inexpensive and power-efficient bluetooth technology and a handy abundance of smartphones has helped deliver this bump in toddler tech.</p>", "<p>And even more, young tech entrepreneurs have started families and found themselves with babies to experiment with.</p>", "<p>So when it's time for the next mad dash to the hospital, now you can nab your bluetooth pacifier, smart baby bottle, and crying analyser.</p>", "<p>To determine whether your new sprog is hungry, bored, tired, or just doesn't like you.</p>", "<p>Kirstin Hancock was acting deputy head teacher in an inner London primary school.</p>", "<p>But when she had a sick baby, she and her husband decided to found Blue Maestro, specialising in bluetooth-enabled gadgets.</p>", "<p>\"I was always taking Olivia's temperature, and could never get an accurate reading in her mouth or in her ear,\" she says. </p>", "<p>\"So in frustration one day I threw up my hands, and said, I need a pacifier that can do this.\"</p>", "<p>The result was Pacif-i. It is a baby dummy containing a thermometer, and sends readings to a parent's smartphone by bluetooth. Now in pre-order, it ships in May.</p>", "<p>It will alert you when your baby has a fever, and whether medicine is having an effect.</p>", "<p>And a proximity sensor can trigger alarms if a child crawls out of a defined area.</p>", "<p>Only in the last few years, says Mrs Hancock, has bluetooth technology become sufficiently energy efficient.</p>", "<p>\"The power consumption is very small, so a coin-cell battery will last over the lifetime of the pacifier,\" she says. </p>", "<p>\"There's no need to recharge it at all.\"</p>", "<p>Jacques Lépine is an engineer in Paris and chief executive of Slow Control.</p>", "<p>One day, he was feeding his infant son, unsuccessfully.</p>", "<p>\"And my wife suddenly comes after me, and she's not happy with what I'm doing,\" he says.</p>", "<p>He was holding the bottle inexpertly, and the baby was growing tired without finishing his meal.</p>", "<p>So Mr Lépine went to design a bottle which adjusts its own angle, then sends off data by bluetooth about how much a baby has eaten, and when.</p>", "<p>The Gigl bottles are now in mass production in China.</p>", "<p>Mr Lépine plans to move to Silicon Valley to develop the company further.</p>", "<p>But he says France has been a \"magic place to engineer, and design, because we have what we call polyvalence, you can do a lot of things differently.\"</p>", "<p>Physicist Dr Michael Feigenson and Dr Miriam Goldstein, an Arabic literature scholar who studied at Cambridge as a Marshall Scholar, live in Jerusalem's German Colony with their three children.</p>", "<p>They say their app, SoundSleeper, \"started mainly from our personal needs\".</p>", "<p>It plays noises which help babies to sleep - rain, and less intuitively, hoovering sounds.</p>", "<p>A listening mode watches out for a squawking baby, and cues the soporific sounds.</p>", "<p>And it tracks and graphs how the baby slept each night.</p>", "<p>One technical challenge was teaching the app to distinguish baby squawks from passing sirens. Another was to loop sounds without a break - simple, it turns out, in iOS, very difficult in Android.</p>", "<p>Now Soundsleeper is in the App Store's top 100.</p>", "<p>Dr Feigenson and Dr Goldstein feel they are part of a Jerusalem start-up scene which they call \"very much a feature of this country\".</p>", "<p>Inventor Ethan Schur, at Silicon-Valley based Grush, decided to tackle teething problems with toothbrushes.</p>", "<p>Both he and co-founder Dr Yong-Jing Wang have small boys, who tended to brush aside cleaning their teeth.</p>", "<p>And Dr Wang ended up with a very expensive dentists' bill.</p>", "<p>Their solution was gamification - in other words, a bluetooth-enabled toothbrush with games to visualise brushing, that gives a score when the child finishes. </p>", "<p>It is then uploaded to the cloud, where mum or dad can check their progress. You can brush your way through something like Guitar Hero, or brush off monsters hiding in your teeth.</p>", "<p>Mr Schur and Dr Wang first had the idea in 2006, but developments in wearable technology, smartphones, and the cloud came together for them in 2013, when they formed the company.</p>", "<p>They held a crowdfunding campaign last year on Indiegogo, and launched Grush in January at the Consumer Electronics Show, where Wired Magazine called it one of the ten things most worth seeing.</p>", "<p>And yes, the baby-to-English decoder.</p>", "<p>Or actually Spanish, as its inventor is Dr Pedro Monagas, of Barcelona's Polytechnic University of Catalonia.</p>", "<p>When his son was born, he says, he cried a great deal.</p>", "<p>Dr Monagas made recordings of him crying, and asked friends to pass him recordings of their babies.</p>", "<p>Then he analysed the waveforms. And found tears of hunger, fatigue, stress, annoyance, and boredom look quite different.</p>", "<p>Conducting hospital tests, in Barcelona, Mexico City, and Seoul, he found a computer programme could distinguish the cause of distress from the waveform, and get it right, on average 95% of the time.</p>", "<p>Hunger produces energetic, sharp shouts. Fatigue leads to moans. And stress, intense, short cries.</p>", "<p>Dr Monagas compares his WhyCry with having a grandparent handy, to help new parents eventually understand their babies without it.</p>", "<p>It's silly to ask whether baby apps are good or bad, says Dr Dmitri Christakis, professor of paediatrics at the University of Washington and director of the Child Health Institute.</p>", "<p>And engaging technology passively, with an iPad becoming like a television, is different to interactive, slower-paced baby apps, he says.</p>", "<p>The American Academy of Pediatrics currently counsels parents to minimise or eliminate screen time for children under two.</p>", "<p>However, argues Dr Christakis, this guidance is \"dated and ill-advised\" - what about Skypeing distant grandparents, he asks?</p>", "<p>Academic research has lagged slightly behind technological development.</p>", "<p>Of the best learning-orientated baby apps, he says, \"they may very well prove to have some educational benefits, that's to be shown.\"</p>", "<p>Tech for tots is still in its infancy. But it's now racing forward by much more than baby steps.</p>"], "link": "http://www.bbc.co.uk/news/business-32355668#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa"},
{"category": ["mobileTablet"], "category2": ["business"], "author": [], "headline": ["Google’s 'mobilegeddon'"], "image": ["http://ichef.bbci.co.uk/news/200/media/images/82452000/jpg/_82452160_thinkstock_google.jpg"], "content": ["<p class=\"story-body__introduction\">If your business depends on people finding your website, then this will be an anxious day for you. </p>", "<p>Google is making changes to the way its search engine ranks sites, and that could send some hurtling down the rankings.</p>", "<p>Of course, the company tweaks its algorithm on a daily basis as it battles with Search Engine Optimisation (SEO) specialists who try to game the system on behalf of their clients. </p>", "<p>But this is a big change - dubbed \"mobilegeddon\" by some - designed to favour sites that are optimised for the mobile internet. </p>", "<p>Google gave plenty of warning, telling developers about the change in a blog post in February and providing a simple tool to check whether sites were <a href=\"http://www.google.com/webmasters/tools/mobile-friendly/\" class=\"story-body__link-external\">mobile friendly</a>. </p>", "<p>The search firm is trying to reassure website owners that this won't be an earthquake which turns their businesses upside down but quite a subtle evolution. </p>", "<p>But SEO specialists say this looks like the biggest change since 2011 - and for some that will unearth some unpleasant memories.</p>", "<p>For any online retailer, appearing on page one of Google's search results can make all the difference between a profitable business and one heading for the scrapyard. </p>", "<p>Just ask Jenny Hurren, owner of a furniture retailer called Out There Interiors which sells its products exclusively online.  </p>", "<p>Search Google for \"mirrored furniture\" and her site pops up on page one - though made somewhat less obvious by the paid ads and the Google shopping box, which Jenny says is far too expensive for her. </p>", "<p>But in 2011 when Google released the Panda update to its search engine, disaster struck. </p>", "<p>\"We went from having page one positions, to being nowhere or page six or seven,\" she remembers. </p>", "<p>\"It had a massive impact, we almost lost the business because of that algorithm change.\"</p>", "<p>Since then, she has tried to depend less on crude SEO techniques, more on the kind of PR which will get the firm linked to from high-quality sources, and so boost its search ranking.  </p>", "<p>Now she is not so worried about the latest change because the work has been done to make the site mobile friendly.</p>", "<p>\"It should be good for us - our site is ready, many of our competitors aren't.\" </p>", "<p>But Jenny says she's also learned a key lesson - not to be so completely dependent on Google searches for her business.</p>", "<p>My next search was for something specialist - \"buy outsize shoes\". </p>", "<p>A quick check of the sites on the first results page seemed to show that most would pass Google's mobile test. </p>", "<p>But when I contacted a firm called Magnus Shoes, the owner Simon Drinkwater admitted that he had been a little concerned when he heard about the latest Google update. </p>", "<p>\"We are just in the middle of upgrading to a mobile-friendly site,\" he told me.</p>", "<p>I ran a check on another page of his site and found that, yes, Google was listing it as \"not mobile friendly\", with the text too small and the links too close together to be comfortably read on a phone.</p>", "<p>Mr Drinkwater said he would be concerned if the site slipped off page one of the search results, but didn't think it would have life-threatening consequences for a business which, unlike Out There Interiors, was not born on the internet. </p>", "<p>\"We've got thousands of loyal customers who know where we are.\" </p>", "<p>Still, he concedes that winning new customers would be very hard without a prominent position in a search for outsize shoes.</p>", "<p>Google's move to make mobile capabilities more important in search rankings seems eminently sensible as our phones become the key route to finding goods and services online. </p>", "<p>But over the next few weeks we can expect cries of pain from those whom the all-powerful search algorithm has deemed less worthy. </p>", "<p>And, coming just days after the European Commission accused Google of abusing its dominance, it will be another illustration of just how important a role the Californian company plays in every corner of the global economy.</p>"], "link": "http://www.bbc.co.uk/news/technology-32393050#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa"},
{"category": ["hardware"], "category2": ["none"], "author": ["By Leo Kelion"], "headline": ["Moore's Law: Beyond the first law of computing"], "image": ["http://ichef.bbci.co.uk/news/200/media/images/82372000/jpg/_82372631_33ab63b4-f342-49b1-ac1d-2a8462c3da1a.jpg"], "content": ["<p class=\"story-body__introduction\">Computer chips are arguably both the most complex things ever mass produced by humans and the most disruptive to our lives.</p>", "<p>So it's remarkable that the extraordinary pace they have evolved at was in large part influenced by a three-page article published 50 years ago this weekend.</p>", "<p>It noted that the maximum <a href=\"https://www.cis.upenn.edu/~cis501/papers/mooreslaw-reprint.pdf\" class=\"story-body__link-external\">number of components that manufacturers could \"cram\"</a> onto a sliver of silicon - before which the rising risk of failure made it uneconomic to add more - was doubling at a regular pace.</p>", "<p>Its author, Gordon Moore, suggested this could be extrapolated to forecast the rate at which more complicated chips could be built at affordable costs.</p>", "<p>The insight - later referred to as Moore's Law - became the bedrock for the computer processor industry, giving engineers and their managers a target to hit.</p>", "<p>Intel - the firm Mr Moore went on to co-found - says the law will have an even more dramatic impact on the next 20 years than the last five decades put together. </p>", "<p>But could its time be more limited?</p>", "<p>Although dubbed a \"law\", computing's pace of change has been driven by human ingenuity rather than any fixed rule of physics.</p>", "<p>\"Moore's observation\" would be a more accurate, if less dramatic, term.</p>", "<p>In fact, the rule itself has changed over time.</p>", "<p>While Moore's 1965 paper talked of the number of \"elements\" on a circuit doubling every year, he later revised this a couple of times, ultimately stating that the number of transistors in a chip would double approximately every 24 months.</p>", "<p>\"In the beginning, it was just a way of chronicling the progress,\" he reflects.</p>", "<p>\"But gradually, it became something that the various industry participants recognised as something they had to stay on or fall behind technologically.</p>", "<p>\"So it went from a way of measuring what had happened to something that was kind of driving the industry.\"</p>", "<p>For most people, imagining exponential growth - in which something rapidly increases at a set rate in proportion to its size, for example doubles every time - is much harder than linear growth - in which the same amount is repeatedly added.</p>", "<p>To illustrate an example of exponential growth that follows a similar course to Moore's law, imagine that as part of an exercise regime Mary swims the length of a 22m (72ft) pool, the size found in many hotels.</p>", "<p>Every two years, Mary doubles her distance, and she is committed to repeating this over the course of 50 years.</p>", "<p>So, after two years her regime consists of 44m. </p>", "<p>At first, the increasing rate of growth may not seem overly impressive. After 10 years, Mary is swimming 704m - or 32 lengths. </p>", "<p>That is nearly the equivalent of travelling the length of  a football pitch seven times.</p>", "<p>But the two-yearly doubling effect does not take long to dazzle. By 26 years - about half-way into her workout scheme - she would have to travel 180km. </p>", "<p>That is the equivalent of swimming five and a half times across the English Channel at its narrowest point or once across the Taiwan Strait, which separates the island from mainland China.</p>", "<p>By the time Mary reached 50 years, she would have to swim 738,198km.</p>", "<p>That is the equivalent of travelling all the way from the Earth to the Moon and back again, at least for much of our satellite's orbit. Phew!</p>", "<p>Moore retired in 1997, but Intel still follows his lead.</p>", "<p>\"Having Moore's Law as a guide - or as some of us have said, as our guiding north star - has kept us on pace, both in terms of how far we should scale and when we should scale,\" Mark Bohr, Intel's director of process architecture and integration, tells the BBC.</p>", "<p>\"Without [it] I think we'd be many generations behind in terms of technology.</p>", "<p>\"Instead of having all the computing power of a smartphone in your hand today, we'd still be using desktop computers from 10 to 15 years ago.\"</p>", "<p>Mr Bohr acknowledges, however, that progress comes at a price.</p>", "<p>Intel has had to spend ever increasing amounts on research and its manufacturing plants to stay on target.</p>", "<p>And some question how long it can maintain this trick.</p>", "<p>In 2013, the firm's ex-chief architect Bob Colwell made headlines when he predicted Moore's Law would be \"dead\" by 2022 at the latest.</p>", "<p>The issue, he explained, was that it was difficult to <a href=\"https://www.youtube.com/watch?v=JpgV6rCn5-g\" class=\"story-body__link-external\">shrink transistors beyond a certain point</a>.</p>", "<p>Specifically, he said it would be impossible to justify the costs required to reduce the length of a transistor part, known as its gate, to less than 5nm (1nm = one billionth of a metre).</p>", "<p>\"The amount of effort it's going to take to do anything beyond that is substantial,\" he said.</p>", "<p>\"We will play all the little tricks that we still didn't get around to, we'll make better machines for a while, but you can't fix [the loss of] that exponential. A bunch of incremental tweaks isn't going to hack it.\"</p>", "<p>In simple terms, a transistor is a kind of tiny switch that is triggered by an electrical signal.</p>", "<p>By turning them on and off at high speeds, computers are able to amplify and switch electronic signals and electrical power, making it possible for them to carry out the calculations needed to run software.</p>", "<p>The first transistor - invented in 1947 - was roughly 2.5cm (1in) across. </p>", "<p>You can now fit billions into the same space.</p>", "<p>Intel has yet to reveal how it intends to overcome the challenge, but Mr Bohr insists progress is being made.</p>", "<p>\"Over the past 30 years there has been a long string of industry experts who have predicted the end of Moore's Law within five to 10 years,\" he says.</p>", "<p>\"Although I have a lot of respect for Bob Colwell, I think he's wrong.\"</p>", "<p>Forthcoming advances in computing power will dwarf previous achievements, Mr Bohr adds, with the consequence that processors will \"disappear\" into our clothes, accessories and wider surroundings.</p>", "<p>British firm ARM - whose rival chip designs are used by Samsung, Apple and many others - agrees that ever smaller transistors should continue to deliver benefits for many years.</p>", "<p>But it highlights that in the mobile age, things have moved beyond simply trying to offer more processing power at a reasonable price.</p>", "<p>The focus now, it says, is to add functions to tablets and smartphones - such as slow-mo video capture and faster downloads - while ensuring that their batteries are not over-taxed.</p>", "<p>\"What's important is if you are changing experiences, it's not just about am I providing more compute capability,\" explains marketing chief Laurence Bryant.</p>", "<p>\"What appeals to consumers is great battery life and thin devices.\"</p>", "<p>This is why there has been a recent trend towards \"multi-core\" processors.</p>", "<p>These squeeze in more transistors to support complex tasks, but keep many of them powered down much of the time in order to extend battery life.</p>", "<p>Even if processors do stop being improved as quickly as we've become accustomed to, computing itself could continue to leap forward.</p>", "<p>\"It's not quite irrelevant whether the density of transistors per chip continues to increase at the same exponential rate for the next 50 years - it would be great it it did - but our future and progress with all things digital does not depend on that very much,\" comments Andrew McAfee, cofounder of MIT's initiative on the digital economy.</p>", "<p>\"It depends more on getting tools out there to more people and improving our approaches with software and algorithms.\"</p>", "<p>He says he frequently speaks to developers who report code-based advances that make Moore's Law look \"ridiculous in comparison\".</p>", "<p>But he acknowledges that that the software industry would benefit from its own equivalent to the rule.</p>", "<p>\"When we talk to our friends working at the cutting edge of software systems that do artificial intelligence they say: 'Look this terrain is shifting so quickly that we don't even have a rough rule of thumb or a heuristic to use to see where we should be in 12 months, we keep getting surprised.\"</p>", "<p>It's technology's job to supersede the old and leave it on the scrapheap.</p>", "<p>So, it's only fitting that this fate will befall Moore's Law, whether it is now or in the decades to come.</p>", "<p>Whatever the date, it's indisputable that its creator has left his mark on computing's early years.</p>", "<p>\"It's amazing how often I run across a reference to Moore's Law,\" the 86-year-old remarks.</p>", "<p>\"In fact, I Googled Moore's Law and I Googled Murphy's Law.</p>", "<p>\"Moore beats Murphy by at least two to one.\"</p>"], "link": "http://www.bbc.co.uk/news/technology-32335003#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa"},
{"category": ["hardware"], "category2": ["none"], "author": ["By Jane Wakefield"], "headline": ["Can paper survive the digital age?"], "image": ["http://ichef.bbci.co.uk/news/200/media/images/82034000/jpg/_82034753_paper.jpg"], "content": ["<p class=\"story-body__introduction\">The phrase 'paperless office' was coined way back in the 1970s, when commentators, buoyed by the exciting potential offered by technology, predicted that all record handling would be purely electronic by the 1990s.</p>", "<p>But, as the above picture of my desk demonstrates - we are still a long way off.</p>", "<p>Partly that is down to cost - it is a whole lot cheaper to give employees a piece of paper than an electronic device - and the cloud storage that many companies are adopting can also have high costs.</p>", "<p>But on a more visceral level, there is something quite comforting about paper. </p>", "<p>\"When the act of writing takes on a personal dimension, that's when paper and handwriting is superior to typing on a keypad,\" said Arrigo Berni, chief executive of Italian notebook maker Moleskine.</p>", "<p>Moleskine was recently at Ted (the technology, entertainment and design conference) in Vancouver, talking up the benefits of paper and keen to show how it can live side by side with digital alternatives.</p>", "<p>The company may at first seem like an unlikely bedfellow for the conference known for its cutting-edge tech demos.</p>", "<p>But the notebook has become a staple of the conference - given away in the famous Ted gift bag and often used by delegates for note-taking during its 18-minute Ted talks.</p>", "<p>As Mr Berni pointed out, everyone needs to make notes and, at a conference whose tagline is 'ideas worth spreading', there is certainly no shortage of scribbling.</p>", "<p>\"Paper will always be around. It helps express a fundamental part of human experience,\" he said.</p>", "<p>But, he acknowledged, paper does face competition from digital tools.</p>", "<p>To address this Moleskine has formed partnerships with firms such as Adobe and Livescribe, a provider of electronically-enabled pens.</p>", "<p>In 2012 it hooked up with Evernote to create a paper-digital hybrid notebook.</p>", "<p>Evernote, the quintessential Silicon Valley start-up that promised to digitise our productivity, now has 100 million users.</p>", "<p>Its partnership with Moleskine created smart notebooks which mean users can photograph their paper notes and place them in Evernote's app where they become catalogued, searchable digital content. </p>", "<p>The notebooks have a special layout to make it easy to capture handwriting while smart stickers allow users to sort and search the notes.</p>", "<p>Smart notebooks offer to bridge the physical and digital worlds as part of an increasing move to eliminate the waste and confusion that piles of paper creates.</p>", "<p>And our paperless journey does not end there. </p>", "<p>Look around you on your next commuter journey and far fewer people are negotiating unwieldy newspapers - opting instead to read their news via a smartphone or tablet.</p>", "<p>Get off the train and the sea of commuters are much more likely to flow through the barriers with the swipe of a smartcard or credit card, while paper tickets are becoming a rarity at airports too.</p>", "<p>Even our interactions with government are taking a decidedly digital turn, with the UK government scrapping the paper car tax disc and people now routinely filling in tax returns electronically.</p>", "<p>According to the American Forest and Paper Association, total US paper shipments decreased by 5% in February, compared to the same time last year while anecdotal data suggests that we use a third less paper than 20 years ago.</p>", "<p>Despite this, the industry remains pretty healthy - last year the US produced about 21 million tons of paper - equivalent to between 55 to 110 million trees, according to some estimates.</p>", "<p>And in offices, paper remains a key tool. According to sustainability charity Wrap (Waste and Resources Action Programme), the average office worker uses up to 45 sheets of paper per day, of which over half is considered waste while office productivity firm Iron Mountain estimates that only a paltry 1% of offices are truly paperless.</p>", "<p>\"Paper is declining slowly, but the sky is not going to fall in any time soon,\" said Mick Heys, an analyst at research firm IDC.</p>", "<p>\"I now board a plane by showing an electronic ticket on my phone, but I still have a paper passport and that document is going to take a while to replace.\"</p>", "<p>Offices are making incremental steps towards reducing their paper loads - and even something as simple as a print management system, which will cancel jobs not printed overnight or restrict how many emails can be printed out, can reduce paper use by up to 20%, according to Mr Heys.</p>", "<p>\"But paper remains better for some things and people like it. Studies have shown that learning from a screen activates a different part of the brain to learning from paper,\" he added.</p>", "<p>So it seems paper will be with us for a while longer - which, if nothing else, will probably please a generation of bored schoolchildren for whom the humble paper aeroplane can still provide some much-needed distraction.</p>"], "link": "http://www.bbc.co.uk/news/technology-32130647#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa"},
{"category": ["wearables"], "category2": ["none"], "author": ["By Leo Kelion"], "headline": ["Apple Watch: The smartwatch ships, but does it deliver?"], "image": ["http://ichef.bbci.co.uk/news/200/media/images/82514000/jpg/_82514516_7ae05657-a9cb-48fa-8c85-59f621d07aae.jpg"], "content": ["<p class=\"story-body__introduction\">The Watch's release represents a chance for Apple to change the world again with an industry-defining product.</p>", "<p>But as launches go, it's the scarcity of the product itself that is perhaps the most remarkable facet.</p>", "<p>The firm doesn't yet have enough stock to let its stores sell the smartwatch, and many shoppers who tried to pre-order the device online in the initial hours after it went on sale a fortnight ago have been told that they must wait until May or June for their deliveries.</p>", "<p>Those who do receive the first batch today will only get a taste of the Watch's full potential. For now, most third-party apps will depend on a wirelessly-linked iPhone for processing power because Apple hasn't yet allowed them to run natively.</p>", "<p>Even so, early indications suggest the US firm has another hit on its hands. </p>", "<p>\"We are raising our Apple Watch shipment estimates for 2015 from 17 million units to 20 million units, as we estimate sales of over two million units during the pre-sales phase alone, and believe watch revenues could contribute as much as 8% of [Apple's] total revenue in 2017,\" wrote Daniel Ives from FBR Capital Markets in a note to investors earlier this week.</p>", "<p>Early reviews have also praised Apple for creating the best smartwatch yet.</p>", "<p>A subsequent update to Google's <a href=\"http://googleblog.blogspot.co.uk/2015/04/android-wear-wear-what-you-want-get.html\" class=\"story-body__link-external\">rival Android Wear software will have eroded some of that lead</a>. </p>", "<p>But the Watch retains unique features.</p>", "<p>They include the taptic engine, which uses a vibration motor to create different strengths and patterns of taps on a user's wrist.</p>", "<p>And the digital crown, which can be twisted to control the machine as an alternative to swiping across its small screen.</p>", "<p>To mark the launch, the BBC asked four experts to provide different takes on its potential impact. </p>", "<p><i>Chief of research, Kantar Worldpanel ComTech</i></p>", "<p>Since the launch of Apple Watch, everyone looking at the industry wants an answer to the question: How many will Apple be able to sell? </p>", "<p>Of course, sales are a quick and easy measure of success but, as with the iPhone, looking for market share alone may not present a full picture of what Apple could achieve with this device. </p>", "<p>We have already seen how the go-to-market strategy for the Watch is different to anything Apple has done so far. In my opinion, this strategy is not an effort to maintain the luxury status of the device. </p>", "<p>Rather, it aims to learn about consumer preferences so that production of the different models can be tweaked to better meet demand. </p>", "<p>The role that online plays in the go-to-market strategy also shows Apple's desire - and need - to grow its online strength.</p>", "<p>This will help offload some in-store traffic, which should lead to better customer service. </p>", "<p>It also enables Apple to gather information on a larger number of customers, since many do not have access to a physical Apple Store and would have otherwise gone through a traditional retailer. </p>", "<p>In addition, the Watch will help Apple strengthen its installed base by locking in customers, since it requires them to own, or at least use, an iPhone as well.</p>", "<p>Considering that, according to our surveys, 20% of UK Android users and 67% of French Android users would consider changing from Google's operating system to Apple's to buy the smartwatch of choice, Apple Watch represents a hook into its ecosystem as well.  </p>", "<p><i>Senior editor, Cnet</i></p>", "<p>The world of wearables is a market full of middling products.</p>", "<p>The Apple Watch debuts as the most polished, high-design smartwatch yet, with an extremely ambitious feature set. But what it does, in many ways, isn't far off from what other smartwatch platforms like Google's one-year-old Android Wear or Samsung's Gear watches have aimed to do. </p>", "<p>However, an already vast army of app developers ready to create for it could end up being the difference-maker.</p>", "<p>I've been wearing one for several weeks. </p>", "<p>Right now, the Apple Watch is complicated: its interface takes getting used to, it has new ways to interact, and not all of them are intuitive. </p>", "<p>You need an iPhone to use it: this isn't truly a standalone product. Third-party apps, which are already here in droves, feel like very early drafts. </p>", "<p>Battery life is only a little more than a day. And its price is higher, even at its lowest end, than most of the competition.</p>", "<p>It's a first-generation product in a new product line, and it's not a must-buy yet.</p>", "<p>Battery life will be hard to fix, but some people may be fine with charging their watch every day.</p>", "<p>Software performance, on the other hand, could improve throughout the year. The software from third-party developers feels slow, and sluggish to load data.</p>", "<p>Improved app updates, and the launch of more fully connected apps that natively live on the watch, could fix this problem. </p>", "<p>The Apple Watch could eventually be a standalone device that works without a phone, someday, but it isn't now and probably won't be for the foreseeable future.</p>", "<p>Explaining why people need one, and what they can get out of it, isn't as easy as it was with the iPhone and iPad. </p>", "<p>Or maybe, the use cases will emerge over time. </p>", "<p>I've found myself frustrated by aspects of Apple Watch as I've worn it. On the other hand, even with its issues, it already has more polished software than any other piece of wearable tech I've seen. </p>", "<p>The Apple Watch may sell more and be better recognised than any other piece of wearable tech in history, but it'll take a few years before it really finds its purpose in a transforming world of connected things.</p>", "<p><i>App developer and consultant</i></p>", "<p>The Apple Watch is arguably an impressive entry into the burgeoning wearable digital devices market. </p>", "<p>Along with all the usual players that must have a presence - Facebook, Twitter et al - we are sure to see some ingenious, useful, entertaining and fun watch apps. </p>", "<p>However, when contrasted with the early days of the app market, the financial rewards for developers seeking fortunes selling Apple Watch applications alone will be minuscule.</p>", "<p>Why? You need an existing iPhone to pair with the Apple Watch in order to run apps; the processing power of the iPhone is leveraged and the output (a view) is displayed on the watch. </p>", "<p>Developers are essentially shipping an iPhone application that \"extends\" itself to the Watch as opposed to installing on it. </p>", "<p>An extension alone would have to be something quite special in order to convince users to part with money for it. </p>", "<p>Although Apple has announced that developers will be able to create native apps later this year, iPhone pairing will remain necessary. </p>", "<p>And native watch apps may be a niche category. </p>", "<p>Will they have enough power? What will Apple allow? </p>", "<p>Answers to these questions will dictate the market available to developers.</p>", "<p>Users' expectations of applications have immeasurably changed since the initial launch days of the App Store.</p>", "<p>I once met the developers of a social application that sold virtual ice cubes to their users on a hot day; in turn they would gift them to each other. </p>", "<p>Given the plethora of emojis that now ship by default in iOS and Android, this seems laughable today. </p>", "<p>Apps now need to be more sophisticated - and costly to produce - to succeed.</p>", "<p><i>Editor-in-chief, Ablogtowatch.com</i></p>", "<p>Perhaps the most amusing response by the traditional timepiece industry to the Apple Watch is an actual debate as to whether or not this connected \"smart\" electronic device worn on the wrist can be properly defined as a watch. </p>", "<p>In my opinion, such conversations are not only irrelevant but typify the type of legendary conservatism that has helped the traditional watch industry to both thrive and suffer in recent history. </p>", "<p>In the late 1970s and early 1980s, the mechanical watch industry was almost decimated thanks to the arrival of cheap, highly accurate electronic quartz watches. </p>", "<p>It adapted by focusing on creating mechanical objects of beauty, which are, by many accounts, lovely examples of obsolete technology. </p>", "<p>Now that smartwatches are making a play for wrist space, even passionate collectors could stop wearing their traditional counterparts. </p>", "<p>In my experience, the traditional watch industry splits its time between ignoring/criticising items like the Apple Watch, debuting less-than-stellar competitive products, and simply acknowledging that while it recognise the potential threat, it lacks the tools and flexibility to properly adapt. </p>", "<p>Most troubling for me is that too many people in the traditional watch industry simply don't understand smartwatches - what they do, and what appeal they may have for consumers. </p>", "<p>The smartwatch industry struggles to clearly explain why consumers need one.</p>", "<p>But at the same time, in my opinion, the traditional watch industry will also struggle because it hasn't taken the time to truly understand what items like the Apple Watch represent for their business.  </p>"], "link": "http://www.bbc.co.uk/news/technology-32402482#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa"}]