[{"category": ["gaming"], "category2": ["none"], "author": ["TJ Dietsch"], "headline": ["Telltale teaming with Marvel for episodic games launching in 2017"], "image": ["http://www.geek.com/wp-content/uploads/2015/04/marvel-telltale-games-590x330.jpg"], "content": ["<p>Telltale Games and Marvel are joining forces to bring you video game goodness in 2017.</p>", "<p>Neither <a href=\"http://www.geek.com/tag/Telltale-Games/\">Telltale</a> nor <a href=\"http://www.geek.com/tag/marvel/\">Marvel</a> had much to say on the subject by way of their <a href=\"http://www.telltalegames.com/blog/discussion/94655/marvel-and-telltale-games-teaming-up-for-2017\" target=\"_blank\">official sites</a>, but the potential here is huge. Marvel, also known as the House of Ideas, has a stable of 8,000 characters covering every storytelling style imaginable. Characters such as Spider-Man, Captain America, Iron Man, Wolverine, Thor, Black Widow, Hawkeye and many others are dead center in the public consciousness thanks to their success on the big screen.</p>", "<p>Telltale’s episodic style of game design and distribution has been used to offer fans <a href=\"http://www.geek.com/tag/game-of-thrones/\"><em>Game of Thrones</em></a>, <a href=\"http://www.geek.com/tag/the-walking-dead/\"><em>The Walking Dead</em></a>, <a href=\"http://www.geek.com/tag/back-to-the-future/\"><em>Back to the Future</em></a>, <a href=\"http://www.geek.com/tag/jurassic-park/\"><em>Jurassic Park</em></a>, and the Vertigo comic book series <em>Fables</em>. Given the episodic nature of comic books, the relationship between Marvel and Telltale makes a lot of sense. There’s even potential here for Telltale to tap some of Marvel’s creative talent to help write and even design the games.</p>", "<p>Since there’s not much actual concrete news here, let’s speculate a little bit. Whether the games will take cues from the cinematic universe or the comic book one (or both) remains to be seen at this point, but the one solid piece of information — a 2017 release — might offer some insight. That year a trio of Marvel Studios movies are hitting the big screen: <em>Guardians of the Galaxy 2</em>, <em>Spider-Man</em>, and <em>Thor: Ragnarok</em>. If that doesn’t translate into a game where you can play as Groot or Rocket, there’s something ultimately wrong with the universe.</p>"], "link": "http://www.geek.com/games/telltale-teaming-with-marvel-for-episodic-games-launching-in-2017-1621349/"},
{"category": ["wearables"], "category2": ["none"], "author": ["Matthew Humphries"], "headline": ["Apple Watch survives hot shower, swimming, repeated submersion"], "image": ["http://www.geek.com/wp-content/uploads/2015/04/apple_watch_wet_02-590x330.jpg"], "content": ["<p>Any device designed to sit on your wrist all day has to be able to withstand the elements. The <a href=\"http://www.geek.com/tag/apple-watch/\">Apple Watch</a> is no exception to this. It may be an expensive piece of hardware, but there’s only so much you can do to protect it so the responsibility falls to Apple to make a hard-wearing device. And in the case of water resistance, the Apple Watch delivers.</p>", "<p>Australian YouTube channel FoneFox decided to put the Apple Watch Sport through a rather extreme <a href=\"http://www.geek.com/tag/waterproof/\">waterproofing</a> test. They fully expected to break the watch, but as the video shows, they couldn’t much to their surprise.</p>", "<p><iframe src=\"https://www.youtube.com/embed/zW5CxZioIkk?rel=0?wmode=transparent\" width=\"590\" height=\"332\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>", "<p>The Apple Watch is classed as water-resistant with IPX7 rating. That means it should be able to withstand immersion of up to 1 meter. In the test it survives cold water splashes, hot water and soap in a shower scenario, being fully submerged in a bucket of cold water for 5 minutes, and repeated submersion and movement in a swimming pool at depths of up to 1.2 meters for 5 minutes at a time. In all cases, the Apple Watch kept on working flawlessly.</p>", "<p>I’m guessing most consumers wearing an Apple Watch will be on high alert if it starts to rain, will remove the watch for showers, and leave it in a locker when swimming. This video shows you can put the Apple Watch in more extreme wet conditions, however, Apple does not claim you can do these things, and your device could be more or less water resistant than the one on test here.</p>", "<p><a href=\"http://www.geek.com/wp-content/uploads/2015/04/apple_watch_wet_01.jpg\"><img class=\"alignnone size-medium wp-image-1621346\" src=\"http://www.geek.com/wp-content/uploads/2015/04/apple_watch_wet_01-590x330.jpg\" alt=\"apple_watch_wet_01\" width=\"590\" height=\"330\"></a></p>", "<p>So the takeaway from this is: be careful around water when wearing an Apple Watch, but if it does get soaking wet or falls in a bucket of water, it’s probably going to be just fine. Oh, and it’s also <a href=\"http://www.geek.com/apple/apple-watch-is-surprisingly-easy-to-repair-1621316/\">surprisingly easy to repair</a> even if something does break.</p>"], "link": "http://www.geek.com/apple/apple-watch-survives-hot-shower-swimming-repeated-submersion-1621344/"},
{"category": ["business"], "category2": ["none"], "author": ["Will Greenwald"], "headline": ["Build Upons Kickstarter brings light to LEGO bricks"], "image": ["http://www.geek.com/wp-content/uploads/2015/04/buildupons1-590x330.jpg"], "content": ["<p>LEGO (yes, all caps, and no, it’s not an acronym) is fun. You can build lots of stuff with them. You can build even more stuff with Technics or Mindstorms. They’re fine if you want mechanical tricks with your builds, but if you just want light you need to get one of the rare LEGO sets with wires, bulky power bricks, and gimmicky lights and sound effects.</p>", "<p><a href=\"https://www.kickstarter.com/projects/1828089281/build-upons-light-up-bricks/description\" target=\"_blank\">Build Upons</a> looks to offer an alternative. It’s a Kickstarter project launched by Alicia Gibb, a member of <a href=\"http://www.geek.com/news/nyc-resistor-taught-me-how-to-cut-things-with-a-laser-1620218/\">NYC Resistor</a>, that makes light-up LEGO builds simple. Each one-pip LED brick has a light inside, and it’s powered by plugging into the power brick. Bridge bricks connect LED bricks to power bricks, so you can place lights anywhere on your build without wires or bulky connectors.</p>", "<p><a href=\"http://www.geek.com/wp-content/uploads/2015/04/buildupons2.jpg\"><img class=\"alignleft wp-image-1621278 size-full\" src=\"http://www.geek.com/wp-content/uploads/2015/04/buildupons2.jpg\" alt=\"buildupons2\" width=\"590\" height=\"392\"></a></p>", "<p><a href=\"http://www.geek.com/tag/lego/\">LEGO</a> has made light-up sets in the past, but none were designed to stay completely in brick form. They needed big, special components and connectors, and you had to build everything around them. Build Upons looks like a clever alternative, putting all of the circuitry, lights, and power inside the bricks while keeping their shape and size. Each LED brick is 1 x 1 size, so you can put them nearly anywhere, and bridge bricks are similarly flexible.</p>", "<p>I’ve played with some LEGO sets with gimmick light and sound bricks in the past, but they’ve always been bulky and awkward. And LEGO Mindstorms is an amazing robotics kit, but once you start having to thread wires it ceases to be a LEGO build and starts to be an engineering project. This is an interesting, simple solution.</p>", "<p>The Build Upons Kickstarter has a goal of $90,000. It’s currently less than a quarter of the way there, but it has two weeks to go.</p>"], "link": "http://www.geek.com/news/build-upons-kickstarter-brings-light-to-lego-bricks-1621265/"},
{"category": ["business"], "category2": ["tvs"], "author": ["Dave Gonzales"], "headline": ["Leaked Sony email shows us how stupid superhero movies get made"], "image": ["http://www.geek.com/wp-content/uploads/2015/04/dubsteppidey-590x330.jpg"], "content": ["<p>You might recall that Sony Pictures Entertainment was <a href=\"http://www.geek.com/news/sony-hackers-leaked-five-movies-including-fury-1610613/\">hacked last October</a> by probably-North-Korean-hired hackers that were protesting Sony’s release of the Seth Rogan/James Franco comedy <em>The Interview</em>. That hack involved dumps of large compressed files of thousands of emails blasted into the internet.</p>", "<p>Since that time, WikiLeaks has been <a href=\"https://search.wikileaks.org/advanced?q=&amp;words_title_only=&amp;words_content_only=&amp;publication_type%5B%5D=26&amp;sort=0\" target=\"_blank\">collecting the majority of the Sony email leak </a>and those people with interest have been combing through the backlogs of people’s private business email looking for news or insight into just what happened with Sony Pictures Entertainment.</p>", "<p>Granted, all of these emails are old and most of these projects have changed or are out of date. There’s also snippets of personal information about Sony executives like Amy Pascal, so let your conscience be your guide if you want to read – just like everything on Wikileaks.</p>", "<p>One notable email stood out to me, a Spider-Man fan and one of the few people who instantly saw <em>Amazing Spider-Man 2</em> and said: “Odd movie, but that dubstep electro is kind of brilliant.”</p>", "<p><a href=\"http://www.geek.com/wp-content/uploads/2015/04/AmazingSpiderMan2Banner.jpg\"><img class=\"alignnone size-medium wp-image-1621389\" src=\"http://www.geek.com/wp-content/uploads/2015/04/AmazingSpiderMan2Banner-590x330.jpg\" alt=\"AmazingSpiderMan2Banner\" width=\"590\" height=\"330\"></a></p>", "<p>Turns out that sequence may not have been fully conceptualized by Pharell Williams, but a random former-MTV executive instead. The man in question is named Nick Shore and worked for MTV until Summer 2013 when he left to work on a joint-venture with Sony Music called “Astronauts Wanted: No Experience Necessary.” <a href=\"http://www.astronautswanted.com/\" target=\"_blank\">As far as I can tell, they make web shows. </a></p>", "<p><a href=\"http://www.billboard.com/biz/articles/news/digital-and-mobile/2063227/judy-mcgrath-recruits-former-mtv-exec-nick-shore-for\" target=\"_blank\">In the oddly-phrased Billboard Biz</a> post on Shores move to whatever Astronauts Wanted is, says <em>“In his new role, Shore will be focused on guiding the development of entertainment and marketing content targeted at both the millennial generation, for which he and McGrath are very familiar, and their successors, Generation Z.”</em></p>", "<p>That’s a whole bunch of industry speak for saying this is a guy who makes his money by telling old people what Millennials want. Sometimes this works out, other times it doesn’t.</p>", "<p>Five months after Shore started working with Astronauts Wanted, he was flying on a plane and thinking about Spider-Man. This was 2013, so <em>Amazing Spider-Man 2</em> was in dubstep-development at the time. The email got caught in the Sony hack because then-President of SPE Amy Pascal forwarded it to other Sony exec Michael Lynton with the addition: “Love this.”</p>", "<p>LOVE THIS? Here is how stupid superhero movies get made:</p>", "<p>It’s not often we get such a raw look at executive brainstorming, and you have to wonder if the second EDM point – “Wondering if there’s an EDM angle somewhere with Spidey? ” – somehow gave us this:</p>", "<p><iframe src=\"https://www.youtube.com/embed/cDyAouw3nUw?wmode=transparent\" width=\"590\" height=\"332\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>", "<p>The more pressing issue for Spider-Man fans and Millennials alike is that this guy is linking stuff we did to branding seemingly at random.</p>", "<p>Is there some crossover between people who do yoga and eat vegan to Spider-Man fans? If you think meat is murder, does that mean you like your Spider-Man with a “no big deal” attitude?</p>", "<p>Also, Mr. Shore, you seem to be missing the point of “N.B.D’s” sarcasm for humble-bragging. It would be like mis-interpreting the #Blessed hashtag on a photo of potato chips as a brag about being about how great the potato chips were not how stupid the hashtag was.</p>", "<p>But I digress.</p>", "<p>If anyone knows how to get into Spidey’s Snapchat circle, I hear that’s the place to be.</p>", "<p>Also, Sony, I’m an actual Millennial Spider-Man fan. I’ve done some quick Spidey Thoughts of my own for your upcoming animated Spider-Man movie:</p>", "<p><script src=\"//platform.twitter.com/widgets.js\" async=\"\" charset=\"utf-8\"></script> </p>", "<p><script src=\"//platform.twitter.com/widgets.js\" async=\"\" charset=\"utf-8\"></script></p>", "<p><script src=\"//platform.twitter.com/widgets.js\" async=\"\" charset=\"utf-8\"></script></p>", "<p><script src=\"//platform.twitter.com/widgets.js\" async=\"\" charset=\"utf-8\"></script></p>"], "link": "http://www.geek.com/news/leaked-sony-email-shows-us-how-stupid-superhero-movies-get-made-1621366/"},
{"category": ["wearables"], "category2": ["hardware"], "author": ["Lee Mathews"], "headline": ["Apple Watch is surprisingly easy to repair"], "image": ["http://www.geek.com/wp-content/uploads/2015/04/apple-watch-teardown-590x330.jpg"], "content": ["<p>With all the technology that’s packed inside it, you might think that the <a href=\"http://www.geek.com/tag/apple-watch/\">Apple Watch</a> would be hard to repair. As it turns out, though, it’s one of Apple’s easiest gadgets to tinker with.</p>", "<p>That’s what <a href=\"https://www.ifixit.com/Teardown/Apple+Watch+Teardown/40655\">iFixit found out</a> when they headed to Australia to crack one open today. After performing their teardown, iFixit handed down their judgment. The final verdict: the Apple Watch Sport scored a 5 out of 10 for repairability.</p>", "<p>For an Apple product, that’s a pretty solid score. It’s not up there with the AirPort Extreme (8/10) or anything, but for a device that was designed in Cupertino and has an IPX7 water resistance rating, that’s not a bad score.</p>", "<p>iFixit’s mad engineers encountered a few surprises along the way as they broke the Watch down component-by-component. They encountered Apple’s smallest tri-lobe screws ever — no surprise, given that they were tearing apart a wrist-worn computer.</p>", "<p><a href=\"http://www.geek.com/wp-content/uploads/2015/04/watch-crown-taptic.jpg\"><img class=\"alignnone size-full wp-image-1621322\" src=\"http://www.geek.com/wp-content/uploads/2015/04/watch-crown-taptic.jpg\" alt=\"watch-crown-taptic\" width=\"625\" height=\"234\"></a></p>", "<p>They also got a close-up look at the Apple Watch’s Taptic Engine, a small linear actuator that’s directly connected to its speaker. It’s what provides the feedback when you prod the Force Touch display on the Apple Watch. Another of the Watch’s signature features, the Digital Crown, turned out to have a lot in common with a Nest thermostat. It’s a rotary encoder, which keeps tabs on the position of a shaft attached to the Crown and turns it into scrolling input.</p>", "<p><a href=\"http://www.geek.com/wp-content/uploads/2015/04/apple-watch-exploded.jpg\"><img class=\"alignnone size-full wp-image-1621323\" src=\"http://www.geek.com/wp-content/uploads/2015/04/apple-watch-exploded.jpg\" alt=\"apple-watch-exploded\" width=\"592\" height=\"444\"></a></p>", "<p>While iFixit found the watch comparatively easy to take apart (it beat the Moto 360’s score of 3), the process cast doubt on one Apple Watch rumor. There’s been talk that Apple planned to offer some sort of upgrade service, though the complex process of removing the Watch’s S1 board made iFixit wonder whether that’s in the cards at all. It’s not likely to happen at your local Genius Bar, anyway; they figure Apple would need to offer a mail-in service.</p>"], "link": "http://www.geek.com/apple/apple-watch-is-surprisingly-easy-to-repair-1621316/"},
{"category": ["hardware"], "category2": ["none"], "author": ["Grant Brunner"], "headline": ["Geek deals: HP ENVY 700xt quad-core desktop PC for $635"], "image": ["http://www.geek.com/wp-content/uploads/2015/04/HP-ENVY-590x330.png"], "content": ["<p>Laptops and tablets are nice, but they’re never going to compete with a desktop for raw power and affordability. Just take this ENVY 700xt for example. It has horsepower and versatility to spare, and it’s only $635 when you use today’s coupon code. If you’re in need of an affordable workhorse, this is exactly what you’re looking for. </p>", "<p><a href=\"http://www.geek.com/wp-content/uploads/2015/04/HP-ENVY-small.png\"><img src=\"http://www.geek.com/wp-content/uploads/2015/04/HP-ENVY-small.png\" alt=\"HP ENVY\" width=\"210\" height=\"300\" class=\"alignright size-full wp-image-1621370\"></a>On the inside, the ENVY 700xt features a fourth generation quad-core 3.4GHz Intel Core i7-4770 processor, integrated Intel HD Graphics 4600, 8GB of DDR3 RAM (1600MHz), a 1TB 7200RPM hard drive, a DVD burner, Bluetooth, and 802.11b/g/n WiFi support. It also includes a wired keyboard and mouse, four USB ports, and a fifteen-in-one card reader. And since it has both a DVI port and an HDMI port, you can easily plug into just about any modern HDTV or monitor. Regardless of what you have planned, this powerful machine has you covered.</p>", "<p>Now, this configuration ships with Windows 7 Pro, but you will be eligible for a free upgrade to Windows 10 when it releases later in 2015. At that point, it’s your choice which OS you want to use, but it’s nice to have the option available.</p>", "<p>Usually, this desktop retails for about 900 bucks, but HP is selling it directly now for $649.99. Even better, using coupon code “<strong>15HPTECHBARG</strong>” during the checkout process will save you an additional $15. And with the free standard shipping option, you’re only paying $634.99 — a whopping 29% off the original price.</p>", "<p>Check out these other deals:</p>", "<p><em>Our commerce group sources the best deals and products for the Geek Deals posts. We operate independently of Editorial and Advertising and may earn a percentage of the sale, if you buy something via a link on the post. If you are interested in promoting your deals, please contact us at <a href=\"mailto:commerce@ziffdavis.com\">commerce@ziffdavis.com</a>.</em></p>", "<p>For more great deals head over to <a href=\"http://www.techbargains.com?source=geek\">TechBargains</a>.</p>"], "link": "http://www.geek.com/deals-2/geek-deals-hp-envy-700xt-quad-core-desktop-pc-for-635-1621363/"},
{"category": ["tvs"], "category2": ["none"], "author": ["Ryan Whitwam"], "headline": ["Marvel pays homage to Star Wars by cutting off hands in every movie"], "image": ["http://www.geek.com/wp-content/uploads/2015/04/luke-skywalker-hand-cut-off-bespin-590x330.jpg"], "content": ["<p>You may or may not be aware that the Marvel cinematic universe is laid out in phases that tell an interweaving story. We are currently in phase two, which includes films like <em>Guardians of the Galaxy</em>, <em>Thor 2</em>, and <em>Iron Man 3</em>. There’s a somewhat gruesome recurring theme of characters getting their hands or arms sliced off, and <a href=\"http://www.geek.com/tag/marvel/\">Marvel</a> Studios president Kevin Feige has an explanation — they’re paying homage to Star Wars. <em>Beware some kind of spoilery content here</em>.</p>", "<p>It didn’t start as an intentional pattern, but along the way  the tribute to Star Wars became a requirement of each phase two movie. This is the second part of the Marvel story line, and <em>The Empire Strikes Back</em> was the second part of the original <a href=\"http://www.geek.com/tag/star-wars/\">Star Wars</a> story. That 1980 movie contained perhaps the most famous hand severing incident in the battle between Luke and Vader, but Star Wars is full of people losing hands, usually while they’re swinging a lightsaber around.</p>", "<p><a href=\"http://www.geek.com/wp-content/uploads/2015/04/thor-hand-cut-off.jpg\"><img class=\"alignnone wp-image-1621271 size-medium\" src=\"http://www.geek.com/wp-content/uploads/2015/04/thor-hand-cut-off-590x245.jpg\" alt=\"thor-hand-cut-off\" width=\"590\" height=\"245\"></a></p>", "<p>Just think back to the last few Marvel films, and you’ll probably recall all the hands that are lost. There’s <em>Thor</em> after Loki pretends to cut off his hand to disarm him, Groot loses his arms in <em>Guardians of the Galaxy</em> (they grow back), and so on. The hand chopping <a href=\"http://www.cinemablend.com/new/Marvel-Secretly-Cuts-Off-Hands-Star-Wars-Tribute-Here-Proof-70906.html\">nod to Star Wars</a> will continue in <em>Avengers: Age of Ultron</em> soon, followed by <em>Ant-Man</em> in a few months. That’s going to be the end of phase two, and possibly the requisite removal of hands.</p>", "<p>Marvel’s phase three movies will start next year with a third <em>Captain America</em> movie and <em>Doctor Strange</em>. Meanwhile, <em>Star Wars Episode VII</em> is coming out in late 2015, and it will probably contain some hands being cut off. It seems to happen a lot.</p>"], "link": "http://www.geek.com/news/marvel-pays-homage-to-star-wars-by-cutting-off-hands-in-every-movie-1621264/"},
{"category": ["business"], "category2": ["none"], "author": ["Ryan Whitwam"], "headline": ["Comcast may abandon $45 billion Time Warner acquisition"], "image": ["http://www.geek.com/wp-content/uploads/2015/04/comcastic-590x330.jpg"], "content": ["<p>Comcast is rumored to be making preparations to drop its efforts to acquire Time Warner Cable. This comes as US regulators have allegedly concluded the merger would not be in the interests of consumers, meaning the chances of gaining approval for the deal are essentially zero.</p>", "<p>In order to move forward with the $45 billion deal, Comcast would need the Justice Department and the FCC to give the all-clear. <a href=\"http://www.geek.com/tag/comcast/\">Comcast</a> was reportedly optimistic when the move was announced in early 2014. However, since then consumers and technology companies have voiced concerns over what the merger of the two largest cable providers in the US might do to the market. Pointing out to regulators that both companies already have local monopolies and don’t compete directly probably didn’t help as much as Comcast and Time Warner expected.</p>", "<p>Sources close to the deal say that a meeting with the <a href=\"http://www.geek.com/tag/fcc/\">FCC</a> and Justice Department lawyers with Comcast representatives on Wednesday made it clear the government would not be approving the deal outright. Apparently the FCC has internally decided to refer the matter to a hearing before an administrative law judge, which is exactly what happened with the AT&amp;T/T-Mobile deal in 2011. This drawn-out process would basically kill the deal by delaying strategic moves for too long.</p>", "<p>Comcast is rumored to be <a href=\"http://www.bloomberg.com/news/articles/2015-04-23/comcast-said-planning-to-withdraw-offer-for-time-warner-cable\">planning a Friday announcement</a>, which will probably include the end of its efforts to buy Time Warner Cable. Many deals include a breakup fee for the company being acquired should the deal fall apart (T-Mobile got a boatload of cash and spectrum when that deal failed), but Comcast and Time Warner didn’t include anything like that in the agreement. That could mean rough times ahead for the smaller Time Warner as it tries to live on in Comcast’s shadow.</p>"], "link": "http://www.geek.com/news/comcast-may-abandon-45-billion-time-warner-acquisition-1621282/"},
{"category": ["tvs"], "category2": ["none"], "author": ["Will Greenwald"], "headline": ["Age of Ultron Hulk Hands let you grip ‘n sip!"], "image": ["http://www.geek.com/wp-content/uploads/2015/04/ageofultron-590x330.jpg"], "content": ["<p><em>Avengers: Age of Ultron</em> comes out next week, and I’m pumped. So is Hasbro, because it means tons of new toys, and they were nice enough to send me a box full of them. Hasbro’s Age of Ultron role-playing toys step up the goofy costume stuff to the next level.</p>", "<p><iframe src=\"https://www.youtube.com/embed/5S7RQGm70zE?rel=0?wmode=transparent\" width=\"590\" height=\"332\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>", "<p>There are new Hulk Hands, and this time they’re not fists. They’re mittens with fingers you can close and separate thumbs. They let you grab things! Which means you can finally smash one out as the Hulk. Previously you needed those Hulk foam fists and a way to a cut a- you know what? Nevermind.</p>", "<p><a href=\"http://www.geek.com/tag/iron-man/\">Iron Man’s</a> new mask has a flip-up visor, and now he has rubber gauntlets that light up. They also have motion controls, so you can trigger repulsor blasts by waving your hand. And for some reason are slightly small on the hands of a grown man. Why, Hasbro? I don’t get you sometimes.</p>", "<p>Captain America’s awesome shield just isn’t good enough for toys, I guess, because he has another weird gimmick shield. The Age of Ultron shield toy has a spinning helicopter thing on the star, and if you pull the ripcord it flies off. It’s fun, but it’s not <a href=\"http://www.geek.com/tag/captain-america/\">Captain America</a>, and it’s not as cool as the <a href=\"http://www.geek.com/games/geeks-loot-drop-episode-1-captain-america-super-soldier-gear-1590292/\">hidden Nerf gun in the Winter Soldier shield toy</a>.</p>", "<p>Thor has a foam hammer that doubles as an electronic toy. A number on the side shows you how hard you hit it. And you can totally cheat by just mashing it into a flat surface. Use that knowledge to convince your friends you’re stronger than you are!</p>", "<p>Fun fact: The Vision’s original body was already seen in <em>Captain America: The First Avenger</em>. During the Stark expo, the android Human Torch was displayed. If <a href=\"http://www.geek.com/tag/marvel/\">Marvel</a> has Ultron make the Vision by using that body from a museum, it would be an epic-level lore pull.</p>"], "link": "http://www.geek.com/geek-culture/age-of-ultron-hulk-hands-let-you-grip-n-sip-1621133/"},
{"category": ["tvs"], "category2": ["none"], "author": ["TJ Dietsch"], "headline": ["X-Files mysteriously appears on Netflix in HD"], "image": ["http://www.geek.com/wp-content/uploads/2015/04/x-files-hd-season-1-copy-590x330.jpg"], "content": ["<p><em>The X-Files</em> is back and looking better than ever! Netflix users have noticed recently that the first 13 episodes of the Fox sci-fi drama are now being presented in HD.</p>", "<p>The original series was aired in the then-standard 4:3 ratio though the HD versions come through in the modern 16:9. Some think that the actual show might have been filmed in the more cinematic ratio and cropped for broadcast. Last year, <a href=\"http://observationdeck.io9.com/x-files-remastered-in-hd-but-only-for-the-germans-1594416977\">word got out</a> that HD versions of those early episodes were being made available to viewers in Germany. Are the ones <a href=\"http://bloody-disgusting.com/news/3341654/netflix-streams-first-season-x-files-hd/\" target=\"_blank\">popping up on Netflix</a> the same ones? It would seem likely.</p>", "<p><a href=\"http://www.geek.com/news/the-x-files-is-coming-back-to-tv-complete-with-mulder-and-scully-1618754/\">Last month</a>, Fox confirmed that they made a deal with creator Chris Carter and stars David Duchovny and Gillian Anderson to come back for a six episode <em>X-Files</em> miniseries that will hopefully give fans a better closing entry in the franchise than the poorly received film <em>X-Files: I Want to Believe</em>. The timing couldn’t be better for Netflix to post HD versions of the series that will be binge-watched like crazy.</p>", "<p><em><a href=\"http://www.geek.com/tag/x-files/\">The X-Files</a></em> launched in 1993 and ran for nine seasons until 2002. The series also inspired two films — 1998’s <em>Fight the Future</em> and the aforementioned <em>I Want to Believe</em> — as well as comic books, video games, action figures and novels. The main thrust of the series revolved around the unusual cases being investigated by skeptical FBI Agent Dana Scully (Anderson) and her partner Agent Fox Mulder (Duchovny) who desperately wants to believe in everything from aliens to monsters.</p>", "<p>Watchers seem to enjoy the results of the HD transfer, which is good to hear especially after <a href=\"https://www.facebook.com/BuffyHD\" target=\"_blank\">the disaster that has been <em>Buffy the Vampire Slayer</em>‘s conversion</a>. With that show, the lighting and saturation were tampered with and the frame was messed with to reveal crew members who would have otherwise been cropped out. So far, those don’t seem to be problems plaguing <em>X-File</em>s.</p>"], "link": "http://www.geek.com/news/x-files-mysteriously-appears-on-netflix-in-hd-1621327/"},
{"category": ["mobileTablet"], "category2": ["none"], "author": ["Lee Mathews"], "headline": ["Hackers can steal fingerprints from a Galaxy S5"], "image": ["http://www.geek.com/wp-content/uploads/2015/04/s5-fingerprint-590x330.jpg"], "content": ["<p>You may not be the only one swiping <a href=\"http://www.geek.com/tag/fingerprints/\">fingerprints</a> on your <a href=\"http://www.geek.com/tag/galaxy-s5/\">Galaxy S5</a>. Criminals could be doing it, too, and without your knowledge.</p>", "<p>Researchers at FireEye discovered a serious flaw in some <a href=\"http://www.geek.com/tag/android/\">Android</a> phones — not just the Galaxy S5, though other affected models weren’t named. While fingerprint data is locked away in Android’s trusted storage area, the biometric scanner itself is exposed. With the right access, a criminal can perform a man-in-the-middle attack and siphon off scans while they’re in transit.</p>", "<p>Resident malware does the dirty work silently in the background. Once criminals have acquired those tasty bits, “you can generate the image of [the] fingerprint,” <a href=\"http://www.forbes.com/sites/thomasbrewster/2015/04/21/samsung-galaxy-s5-fingerprint-attacks/\" target=\"_blank\">Yulong Zhang explained</a>. He added “after that you can do whatever you want.”</p>", "<p><a href=\"http://www.geek.com/wp-content/uploads/2014/04/1.jpg\"><img class=\"alignnone size-medium wp-image-1591093\" src=\"http://www.geek.com/wp-content/uploads/2014/04/1-590x330.jpg\" alt=\"Galaxy S5\" width=\"590\" height=\"330\"></a></p>", "<p>Scary, right? It would be, if not for a few important caveats. First, this particular flaw was fixed in Android 5.0. Most new devices are shipping with Lollipop pre-installed, and it’s been rolling out to more older devices lately. If your carrier has already updated your handset, you’re good.</p>", "<p>Second, FireEye’s researchers say that an attacker needs to be able to “break the kernel” in order to gain the required access to a phone’s fingerprint scanner. Unless you’ve rooted your device, you probably aren’t in harm’s way when it comes to this particular exploit.</p>", "<p>That <a href=\"http://www.geek.com/tag/malware/\">malware</a> would also have to find its way onto your phone somehow, and if you’re only installing apps from the Play Store the chances of that happening are pretty slim. Samsung is, nevertheless, investigating FireEye’s claims.</p>", "<p>As worrisome as this exploit is, it’s much scarier to think that someone with access to the right lab equipment can reproduce your fingerprint with nothing more than a photo they <a href=\"http://petapixel.com/2014/12/29/hackers-find-fingerprints-can-stolen-public-photos/\">found on the Internet</a>.</p>"], "link": "http://www.geek.com/android/hackers-can-steal-fingerprints-from-a-galaxy-s5-1621139/"},
{"category": ["software"], "category2": ["none"], "author": ["Lee Mathews"], "headline": ["Major point-of-sale vendor has used the same password for 25 years"], "image": ["http://www.geek.com/wp-content/uploads/2015/04/keys-in-the-lock-590x330.jpg"], "content": ["<p>The point of sale gear enabling transactions at the stores you visit every day? There’s a good chance it’s had the same administrator <a href=\"http://www.geek.com/category/passwords/\">password</a> set for the last <em>quarter of a century</em>.</p>", "<p>At RSA 2015, <a href=\"http://www.geek.com/category/security/\">security</a> researchers Charles Henderson and David Byrne (who is definitely <em>not</em> the former lead singer of Talking Heads) <a href=\"http://www.theregister.co.uk/2015/04/23/166816_the_pos_pin_for_win_since_1990/\">revealed that rather unsettling fact</a> about one of the most widely-used POS systems in the world. According to the duo, 90% of the time they encounter the system, they see the same exact admin username and the password: 166816. And it really has been that way since 1990.</p>", "<p><a href=\"http://www.geek.com/wp-content/uploads/2015/04/POS_password.jpg\"><img class=\"alignnone size-medium wp-image-1621163\" src=\"http://www.geek.com/wp-content/uploads/2015/04/POS_password-590x330.jpg\" alt=\"POS_password\" width=\"590\" height=\"330\"></a></p>", "<p>It’s not just on one of this manufacturer’s devices, either. Henderson and Byrne say they’ve been using the same password on every device they make for two and a half decades. If this particular revelation wasn’t enough to make you cringe, then a couple more highlights from their <a href=\"https://www.rsaconference.com/writable/presentations/file_upload/hta-w02-that-point-of_sale-is-a-pos_final.pdf\" target=\"_blank\">slide deck</a> ought to do the trick.</p>", "<p>Two other vendors have been taking the same ridiculously lax approach to security. One of them hasn’t changed the default administrator password on their equipment in nine years. Another one is guilty of the same crime… except they left the password field <em>empty</em>.</p>", "<p>To make matters worse, Henderson and Byrne revealed that hackers who breached one merchant’s systems appear to have figured this out… and used their newly-found keys to open the doors of the POS hardware at another merchant later on.</p>", "<p>It’s bad enough that John and Jane Doe are still using passwords like baseball and letmein in 2015, but POS vendors really need to start taking security much more seriously. I wonder how many more massive hacks it will take before they do?</p>", "<p>[Image courtesy of <a href=\"https://www.flickr.com/photos/38305415@N00/2110763702/\" target=\"_blank\">Johan Larsson</a> on Flickr]</p>"], "link": "http://www.geek.com/apps/major-point-of-sale-vendor-has-used-the-same-password-for-25-years-1621130/"},
{"category": ["software"], "category2": ["none"], "author": ["Lee Mathews"], "headline": ["Microsoft is bringing Solitaire back to Windows 10"], "image": ["http://www.geek.com/wp-content/uploads/2015/04/ms-solitaire-590x330.jpg"], "content": ["<p>Microsoft is going to use nostalgia to help erase the pain of Windows 8. When <a href=\"http://www.geek.com/tag/windows-10/\">Windows 10</a> arrives this summer, it looks like they’ll be shipping <em>Solitaire</em> with it once again.</p>", "<p><em>Solitaire</em> wasn’t part of Windows 8 or 8.1. It was yanked out, only to re-appear later in the Windows Store as <em>Microsoft Solitaire Collection</em>. In the latest preview build of Windows 10, however, <em>Solitaire Collection</em> has <a href=\"http://www.theverge.com/2015/4/23/8477521/windows-10-solitaire-returns\">made a triumphant return</a>.</p>", "<p>If you haven’t played it before, <em>Solitaire Collection</em> is more than just the classic Windows game. It also bundles in <em>FreeCell</em> (my dad’s personal favorite back in the days of Windows XP) and <em>Spider Solitaire</em>, both of which used to be part of a standard Windows install. There’s also <em>TriPeaks</em> and <em>Pyramids</em> for even more card-stacking action.</p>", "<p><a href=\"http://www.geek.com/wp-content/uploads/2015/04/solitaire_01.jpg\"><img class=\"alignnone size-medium wp-image-1621124\" src=\"http://www.geek.com/wp-content/uploads/2015/04/solitaire_01-590x331.jpg\" alt=\"solitaire_01\" width=\"590\" height=\"331\"></a></p>", "<p>These aren’t the same old static games, though. Like most modern games, <em>Solitaire Collection</em> is packed with achievements and unlockable content. It’s also tied to your <a href=\"http://www.geek.com/tag/xbox/\">Xbox</a> Live account, so you can challenge your friends and brag about how many coins and badges you’ve earned.</p>", "<p>Is rolling <em>Solitaire</em> back into Windows really such a big deal? It’s not as though the game was hard to find in the Windows Store. Heck, all you had to do was type “soli” on the Start Screen and wait a few seconds and Windows 8 would show you the way.</p>", "<p><a href=\"http://www.geek.com/wp-content/uploads/2015/04/solitaire_02.jpg\"><img class=\"alignnone size-medium wp-image-1621125\" src=\"http://www.geek.com/wp-content/uploads/2015/04/solitaire_02-590x331.jpg\" alt=\"solitaire_02\" width=\"590\" height=\"331\"></a></p>", "<p>Still, for some users (like my dad) the fact that it wasn’t just there was an annoyance and a disappointment. When you’re trying to win back fans and build enthusiasm, little things can provide a big boost. There are plenty of disgruntled Windows users out there who will be stoked to see <em>Solitaire</em> make a comeback… even if it sends their productivity levels spiraling rapidly downward.</p>"], "link": "http://www.geek.com/microsoft/microsoft-is-bringing-solitaire-back-to-windows-10-1621113/"},
{"category": ["business"], "category2": ["none"], "author": ["Lee Mathews"], "headline": ["Apple is rejecting any apps that even mention the Pebble"], "image": ["http://www.geek.com/wp-content/uploads/2015/02/apple_watch_exercise-590x330.jpg"], "content": ["<p>Now that the <a href=\"http://www.geek.com/tag/apple-watch/\">Apple Watch</a> is here, Apple has quietly decided to start clamping down on submissions to the App Store. Mention a competing smartwatch — like the <a href=\"http://www.geek.com/tag/pebble/\">Pebble</a> — and there’s a good chance your app will get rejected.</p>", "<p>That’s what happened to the <a href=\"http://forums.getpebble.com/discussion/22081/apple-now-rejecting-apps-with-pebble-smartwatch-support\">developers of the SeaNav US app</a> recently. Their app wasn’t a new submission. It had been sitting in the App Store for quite some time, and they’d never run into any issues getting updates approved in the past — despite the fact that the description and metadata for SeaNav mentioned the fact that the app offered support for Pebble’s smartwatches.</p>", "<p>Officially, Apple says the app included “irrelevant platform information.” It sounds pretty shady, but in Apple’s defense, they reserve the right to do exactly that. It’s clearly spelled out in their submission guidelines. Section 3.1 states that “<i>Apps or metadata that mentions the name of any other mobile platform will be rejected</i>.” That’s pretty clear, right?</p>", "<p><a href=\"http://www.geek.com/wp-content/uploads/2015/02/pebble_kickstarter.jpg\"><img class=\"alignnone size-medium wp-image-1616465\" src=\"http://www.geek.com/wp-content/uploads/2015/02/pebble_kickstarter-590x330.jpg\" alt=\"pebble_kickstarter\" width=\"590\" height=\"330\"></a></p>", "<p>The curious thing is why, then, Apple just happened to start enforcing the policy now. The wording has been there for a while, but what they didn’t have was any real incentive to release the hounds. Now that the Apple Watch is out — and some 4,000 Apple-approved compatible apps are in the App Store — they’re ready to put the shields up.</p>", "<p>Apple may be claiming that the policy prevents user confusion, but it’s pretty clearly designed to keep competitors’ products from getting any kind of a boost from their App Store listings — even though mentioning <a href=\"http://www.geek.com/tag/pebble/\">Pebble</a> support is information that Pebble users who own an iPhone or iPad would probably love to see.</p>", "<p>Is Apple going to be in any trouble over this? Probably not. Though it’s bad form, rejecting apps based on section 3.1 may not raise any antitrust flags. Despite being a dominant player, Apple certainly doesn’t have a monopoly in the smartphone or tablet business, and they’re only getting started with smartwatches. They’ll get tongue lashings from angry developers on sites like Hacker News and Reddit, but that might be as far as it ever goes.</p>"], "link": "http://www.geek.com/apple/apples-rejecting-any-apps-that-even-mention-the-pebble-1621345/"},
{"category": ["business"], "category2": ["none"], "author": ["Lee Mathews"], "headline": ["Android mascot urinates on Apple in Google Maps Easter Egg"], "image": ["http://www.geek.com/wp-content/uploads/2015/04/android-piss-590x330.jpg"], "content": ["<p>It’s a well-documented fact that <a href=\"http://www.geek.com/tag/google/\">Google</a> loves <a href=\"http://www.geek.com/tag/easter-eggs/\">Easter Eggs</a>. However, this one hiding out in Google Maps is a spiteful little jab at Apple.</p>", "<p>Yes, there really is an Android mascot going all R. Kelly on an Apple logo in Google Maps. You might have seen (or even bought) a similar decal before, it’s a sort of geeky take on the old Calvin peeing on a Ford/Chevy/Dodge stickers that adorned so many American pick-up trucks back in the day.</p>", "<p>It’s not exactly stealthily hidden for an Easter Egg. While <a href=\"https://www.google.com/maps/place/33%C2%B030%2752.5%22N+73%C2%B003%2733.2%22E/@33.5169848,73.0597719,15z/data=!4m2!3m1!1s0x0:0x0?hl=en\" target=\"_blank\">a specific set of coordinates</a> will take you right to the graffiti, you can also just punch up the New Islamabad Airport and head due East. You’ll stumble across it in no time.</p>", "<p>This isn’t the only oddity you’ll find on Google Maps in Pakistan, either. Hidden deep within the Takht Pari Forest, there’s another <a href=\"https://www.google.pt/maps/place/Takht+Pari+Forest/@33.5022729,73.1254447,17z/data=!4m2!3m1!1s0x38dff298d82d62c9:0xdd99b92ec4539b33\" target=\"_blank\">not so subtle message</a> waiting for Easter Egg hunters. This time, it’s not aimed at a Google competitor. It’s directed at Google themselves:</p>", "<p><a href=\"http://www.geek.com/wp-content/uploads/2015/04/google-maps-sucks.jpg\"><img class=\"alignnone wp-image-1621340 size-medium\" src=\"http://www.geek.com/wp-content/uploads/2015/04/google-maps-sucks-590x379.jpg\" alt=\"google-maps-sucks\" width=\"590\" height=\"379\"></a></p>", "<p>It seems like a safe bet that you’ll at least see this one wiped from the face of Google Maps in short order, but the whiz kid up above will probably get the axe too. Neither is the kind of geeky, good-natured tomfoolery Google shoots for — like playing <em>Pac-Man</em> in your neighborhood or finding Nessie in the middle of the Loch.</p>", "<p>They’ve also turned Pegman into Emmet Brown, thrown hippie clothes on him, and even transformed him into a tennis player and a <a href=\"http://www.geek.com/tag/lego/\">Lego</a> minifig — depending on where you’re poking around and what day of the year it is.</p>"], "link": "http://www.geek.com/apple/android-mascot-urinates-on-apple-in-google-maps-easter-egg-1621325/"},
{"category": ["gaming"], "category2": ["none"], "author": ["TJ Dietsch"], "headline": ["Official Star Wars-Contra game mash-up coming to your phone"], "image": ["http://www.geek.com/wp-content/uploads/2015/04/star-wars-contra1-590x330.jpg"], "content": ["<p>We might be living in a mash-up soaked society, but some are just too cool to ignore. That’s the case with this free mini-game from <em>Star Wars: Force Collection</em> created by Konami and LucasArts that features the classic game <em>Contra</em> with a Star Wars overhaul for iPhones, iPads and Android devices.</p>", "<p>In the game, you run and flip through four Endor-themed levels as Chewbacca blasting Stormtroopers with your bowcaster.</p>", "<p><iframe src=\"https://www.youtube.com/embed/qWaGEChyf38?wmode=transparent\" width=\"590\" height=\"332\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>", "<p><em>Star Wars: Force Collection</em> is actually a digital collectible card game where players amass a variety of cards, build decks, design blueprints, and take on challengers while figuring out whether they will land on the dark side or not. The game takes its inspiration from the six existing feature films, but will most likely include <a href=\"http://www.geek.com/tag/star-wars-the-force-awakens/\"><em>The Force Awakens</em></a>-inspired characters around the film’s December 18 release date.</p>", "<p>The Chewbacca-starring <em>Contra</em> is part of a new update. Beating the mini-game will earn players an exclusive trophy for the main game. <a href=\"http://www.gamezebo.com/2015/04/22/chewie-goes-contra-new-star-wars-minigame-konami\">Other new additions</a> to the main game include the appearance of a boss battle mode as well as C-3PO and R2-D2.</p>", "<p>Konami launched <em>Contra</em> in 1987 as an arcade game that was ported over to the NES the following year. The game featured a pair of soldiers named Bill and Lance running through levels taking out enemy soldiers and larger artillery. The game was tough, but offered plenty of fun from the wild level designs to the weapon power ups.</p>", "<p>If Konami and LucasArts are looking for other games to combine with the greatness of <em>Star Wars</em>, may I suggest <em>Castlevania</em> with Boba Fett, <em>Lethal Enforcers</em> with Han, and Leia or <em>Dance Dance Revolution</em> with Sy Snootles.</p>"], "link": "http://www.geek.com/games/official-star-wars-contra-game-mash-up-coming-to-your-phone-1621127/"},
{"category": ["hardware"], "category2": ["none"], "author": ["Matthew Humphries"], "headline": ["Japan is sending a Smart Lander to the Moon in 2018"], "image": ["http://www.geek.com/wp-content/uploads/2015/04/JAXA_SLIM-590x330.jpg"], "content": ["<p>The last time Japan went to the moon was in 2008 when the Japan Aerospace Exploration Agency (JAXA) sent the SELENE craft to orbit and gather data about the surface. Now <a href=\"http://www.geek.com/tag/jaxa/\">JAXA</a> has plans to land on the <a href=\"http://www.geek.com/tag/moon/\">moon</a> a decade later in 2018.</p>", "<p>It turns out that SELENE didn’t just gather surface data about geologic evolution, the environment, and the gravity field, it was also tasked with locating a suitable landing location for a second mission before its controlled crash on the surface there. That second mission is called SLIM, short for Smart Lander for Investigating Moon, and JAXA expects to <a href=\"http://edition.cnn.com/2015/04/23/tech/japan-moon-lander-planned/\" target=\"_blank\">spend no more than $125 million</a> making it happen.</p>", "<p>SLIM will use an Epsilon solid-fuel rocket to get to the moon, then newly developed soft-landing technology will be used to ensure touchdown without damage. This will be no <a href=\"http://www.geek.com/news/curiosity-landing-video-gets-sound-visuals-enhanced-to-1080p-1515907/\">seven minutes of terror </a>like <a href=\"http://www.geek.com/tag/curiosity/\">Curiosity</a> went through, but the research and development of SLIM could certainly be utilized for sending another lander, manned or otherwise, to the red planet.</p>", "<p>Once safely down on the lunar surface, SLIM will be equipped with a modified version of a facial recognition system similar to those found in digital cameras. As there’s no faces on the moon, it will be reconfigured to detect craters, allowing even more detailed data to be beamed back about the surface structure.</p>", "<p>The <a href=\"https://translate.google.co.uk/translate?sl=ja&amp;tl=en&amp;js=y&amp;prev=_t&amp;hl=en&amp;ie=UTF-8&amp;u=http%3A%2F%2Fwww.isas.jaxa.jp%2Fhome%2Fslim%2FSLIM%2Ftoppupeji.html&amp;edit-text=\" target=\"_blank\">roughly translated</a> SLIM summary page on the JAXA website also suggests samples may be collected and then sent back to Earth. Whether that can be achieved within the $125 million budget is unknown and therefore unlikely, especially as perfecting the soft landing tech seems to be the focus of the mission.</p>"], "link": "http://www.geek.com/science/japan-is-sending-a-smart-lander-to-the-moon-in-2018-1621148/"},
{"category": ["tvs"], "category2": ["none"], "author": ["TJ Dietsch"], "headline": ["Spider-Man animated film coming from The LEGO Movie creators"], "image": ["http://www.geek.com/wp-content/uploads/2015/04/disney-xd-ultimate-spider-man1-590x330.jpg"], "content": ["<p>Spider-Man’s <a href=\"http://www.theverge.com/2015/4/22/8474059/spider-man-animated-movie-lego-movie-directors\" target=\"_blank\">about to get an animated reboot</a> from the minds behind <a href=\"http://www.geek.com/tag/the-lego-movie/\"><em>The LEGO Movie</em></a>. Phil Lord and Christopher Miller signed on to write and produce the project, though nothing was mentioned about who will direct. Lord and Miller also wrote and directed <em>21 Jump Street</em>, created the Fox comedy <em>The Last Man on Earth</em>.</p>", "<p>This new animated project will have no connection to <a href=\"http://www.geek.com/news/spider-man-saved-from-sony-and-joins-marvel-cinematic-universe-1615456/\">the Marvel Studios-Sony live action co-production</a> that will swing the wall crawler into the same world inhabited by Iron Man, Captain America, Thor, and the Guardians of the Galaxy.</p>", "<p><a href=\"http://www.geek.com/wp-content/uploads/2015/04/60s-spider-man-cartoon.jpg\"><img class=\"alignnone size-medium wp-image-1621143\" src=\"http://www.geek.com/wp-content/uploads/2015/04/60s-spider-man-cartoon-590x330.jpg\" alt=\"60s spider-man cartoon\" width=\"590\" height=\"330\"></a></p>", "<p>No stranger to animation, <a href=\"http://www.geek.com/tag/spider-man/\">Spider-Man</a>‘s first cartoon — which is super weird — ran from 1967 to 1970. That was followed by <em>Spider-Man and his Amazing Friends</em>, a Fox series that ran from 1994 to 1998, an alternate universe show called <em>Spider-Man Unlimited</em> and even the short lived <em>Spider-Man: The New Animated Series</em> starring Neil Patrick Harris.</p>", "<p>Currently, the Web Head appears in Disney XD’s <em>Ultimate Spider-Man</em> which takes place in a world where Peter Parker started out attending a SHIELD-run high school along with other heroes like Luke Cage, Iron Fist, White Tiger and Nova. Since then, he’s become an Avenger for a time and even hopped through different realities in an animated version of the comic book story called “The Spider-Verse.”</p>", "<p>The <a href=\"http://www.theverge.com/2015/4/22/8474059/spider-man-animated-movie-lego-movie-directors\" target=\"_blank\">new Spider-Man animated film</a>, which is currently being kept under wraps story-wise, will debut on July 20th, 2018, a year after the live action offering which hits on July 28, 2017.</p>"], "link": "http://www.geek.com/news/spider-man-animated-film-coming-from-the-lego-movie-creators-1621135/"},
{"category": ["gaming"], "category2": ["none"], "author": ["Matthew Humphries"], "headline": ["Microsoft used PC footage in The Witcher 3 Xbox One trailer, apologizes"], "image": ["http://www.geek.com/wp-content/uploads/2015/04/witcher3_03-590x330.jpg"], "content": ["<p>One of the main differences focused upon for the current gen of console hardware is the resolution and frame rate of every game. The PC always comes out on top because of all the additional performance a high-end rig offers. For the <a href=\"http://www.geek.com/tag/xbox-one/\">Xbox One</a> and <a href=\"http://www.geek.com/tag/ps4/\">PS4</a>, though, it’s much closer. The PS4 typically ends up being better, achieving 1080p much more frequently as well as higher (sustained) frame rates.</p>", "<p>In the case of <em>The Witcher 3: Wild Hunt</em> due out next month, developer CD Projekt Red has stated the PC version runs at 1080p/60fps, the PS4 version at 1080p/30fps, and the Xbox One version at 900p/30fps. It seems that <a href=\"http://www.eurogamer.net/articles/2015-04-23-microsoft-apologises-for-using-pc-footage-in-xbox-one-witcher-3-trailer\" target=\"_blank\">Microsoft overlooked this</a> when it posted the latest trailer for the game yesterday implying it was the Xbox One version being shown.</p>", "<p><iframe src=\"https://www.youtube.com/embed/KrXxdy9Qgpk?rel=0?wmode=transparent\" width=\"590\" height=\"332\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe></p>", "<p>Viewers soon noticed it was running at 1080p/60fps and therefore was not the Xbox One version. Microsoft has apologized for any confusion caused. It was simply using footage supplied to it by CD Projekt Red, which was of course captured on a PC so as to show off the game in the best light. The description on the video has since been updated to reflect this fact.</p>", "<p>I’m sure this was just an oversight on the part of the person handling the Xbox YouTube channel. It actually brings back memories of when I’d go into a shop as a kid, pick up a game (on cassette) and check out the screenshots on the back of the case. They were never for the version of the game I was buying, always the best graphical version which inevitably was on the most expensive format the majority of kids didn’t own. Sometimes this fact was stated, other times it wasn’t.</p>", "<p><a href=\"http://www.geek.com/wp-content/uploads/2015/04/witcher3_01.jpg\"><img class=\"alignnone size-medium wp-image-1621267\" src=\"http://www.geek.com/wp-content/uploads/2015/04/witcher3_01-590x330.jpg\" alt=\"witcher3_01\" width=\"590\" height=\"330\"></a></p>", "<p>The fact is, <em>The Witcher 3: Wild Hunt</em> will look great on all platforms, but it will look slightly better on PS4 compared to Xbox One, and significantly better on PC if you’ve spent a lot of money on high-end components. In the end, though, as long as it runs smoothly at any given resolution, it’s how the game plays that really counts.</p>"], "link": "http://www.geek.com/games/microsoft-used-pc-footage-in-the-witcher-3-xbox-one-trailer-apologizes-1621266/"}]