[{"category": ["software"], "category2": ["none"], "author": [], "headline": ["Google Maps Defaced With Urinating Robot"], "image": ["http://media.skynews.com/media/images/generated/2015/4/24/386904/default/v2/capture2-1-362x204.jpg"], "content": ["<p class=\"story__intro\">An image of the Android robot urinating on the Apple logo has appeared on Google Maps.</p>", "<p>It appears just south of the Pakistani city of Rawlpindi, and few miles east lies more digital graffiti reading: \"Google review policy is crap\".</p>", "<p>Apple is the major smartphone rival to Google-owned Android.</p>", "<p>Google Maps can be edited by members of the public using a tool called Map Maker.</p>", "<p>They can add details and features like street names, parks, places of interest using their knowledge of the local community.</p>", "<p>Edits are moderated but some slip through the system.</p>", "<p>A Google spokesman said: \"We've terminated the Android figure involved in this incident, and he'll be disappearing from Google Maps shortly.\"</p>"], "link": "http://news.sky.com/story/1471538/google-maps-defaced-with-urinating-robot"},
{"category": ["software"], "category2": ["none"], "author": [], "headline": ["FBI Warning Over Plane Wi-Fi Hacking Risk"], "image": ["http://media.skynews.com/media/images/generated/2014/12/20/357866/default/v2/cockpit-1-362x204.jpg"], "content": ["<p class=\"story__intro\">The FBI has issued an alert to airlines to look for evidence of passengers attempting to use on-board Wi-Fi networks to access the plane's controls.</p>", "<p>It says there is no evidence to support claims that an attacker could take control of a plane's navigation system through the passenger Wi-Fi network, but says claims that it is possible are being taken seriously.</p>", "<p>The alert was posted to the FBI's InfraGrad site and asks airline staff to be on guard.</p>", "<p>It said: \"Although the media claims remain theoretical and unproven, the media publicity associated with these statements may encourage actors to use the described intrusion methods.</p>", "<p>\"Attempting to gain unauthorised access to the on-board networks of a commercial aircraft violates federal law.\"</p>", "<p>It comes after a security researcher was banned by United Airlines for tweeting that its on-board communications systems could be hacked.</p>", "<p>Chris Roberts said he was repeatedly able to connect his laptop to a box under his seat during a flight, which allowed him to view data from the aircraft's engines, fuel and flight-management systems.</p>", "<p>Last week the US Government Accountability Office said some commercial aircraft may be vulnerable to hacking over their onboard wireless networks.</p>"], "link": "http://news.sky.com/story/1469914/fbi-warning-over-plane-wi-fi-hacking-risk"},
{"category": ["software"], "category2": ["none"], "author": [], "headline": ["Human Embryo Genomes Edited For First Time"], "image": ["http://media.skynews.com/media/images/generated/2015/4/23/386541/default/v1/gettyimages-2973545-1-362x204.jpg"], "content": ["<p class=\"story__intro\">Chinese scientists have confirmed that they've created the world's first genetically modified human embryos.</p>", "<p>The experiments, carried out in secret, have outraged the scientific community.</p>", "<p>The work would be illegal in the UK because changes to an embryos DNA would be passed down the generations with unknown effects.</p>", "<p>Gene-function researcher Junjiu Huang, from Sun Yat-sen University in Guangzhou, used \"non-viable\" embryos - which cannot be used in a live birth - from local fertility clinics.</p>", "<p>The team tried to edit the gene responsible for a potentially fatal blood disorder using a gene-editing technique known as CRISPR.</p>", "<p>The technique has already been successfully used on cows, pigs and monkeys.</p>", "<p>But the experiment on human embryos was only partially successful - of the 86 embryos injected, only a fraction contained the replacement genetic material.</p>", "<p>In some of the embryos, the gene editing caused unintended mutations in other genes.</p>", "<p>Mr Junjiu said: \"If you want to do it in normal embryos, you need to be close to 100%.</p>", "<p>\"That’s why we stopped. We still think it’s too immature.\"</p>", "<p>The aim of gene editing is to eradicate genetic diseases before a baby is born.</p>", "<p>But opponents believe it may cross an ethical line.</p>", "<p>Dr David King, director of the UK's Human Genetics Alert said: \"This news emphasises the need for an immediate global ban on the creation of genetically modified designer babies.</p>", "<p>\"It is critical that we avoid a eugenic future in which the rich can buy themselves a baby with built-in genetic advantages.</p>", "<p>\"If China does not want to get the reputation of being the Wild West of the new eugenics it must join the many countries including the UK which would ban such research.</p>", "<p>\"Western governments must finally put pressure on China to change its policies in this area if it wants to be a respectable part of the international community.</p>", "<p>\"The research demonstrates the safety pitfalls of these techniques and is entirely unnecessary since there are already many ethical ways to avoid thalassaemia. This research is a classic example of scientific careerism - assuring one's place in the history books even though the research is unnecessary and unethical.\"</p>"], "link": "http://news.sky.com/story/1470606/human-embryo-genomes-edited-for-first-time"},
{"category": ["mobileTablet"], "category2": ["hardware"], "author": [], "headline": ["Fingerprint Risk On Samsung S5 Phone"], "image": ["http://media.skynews.com/media/images/generated/2014/2/25/291825/default/v1/samsung-galaxy-s5-1-362x204.jpg"], "content": ["<p class=\"story__intro\">Samsung is investigating claims that hackers can steal copies of fingerprints used to unlock its Galaxy S5 smartphone.</p>", "<p>Security researchers say there is a flaw in the Android system which controls where fingerprints on the phone are stored.</p>", "<p>While they are routed to a \"secure zone\", FireEye says that attackers can intercept them before they get there.</p>", "<p>From that data, the fingerprint can be reconstructed and be used elsewhere - potentially for nefarious reasons.</p>", "<p>Researcher Yulong Zhang told Forbes: \"If the attacker can break the kernel, although he cannot access the fingerprint data stored in the trusted zone, he can directly read the fingerprint sensor at any time.</p>", "<p>\"Every time you touch the fingerprint sensor, the attacker can steal your fingerprint. After that you can do whatever you want.\"</p>", "<p>He said that deep access to the phone was not necessary, and that the hack could be carried out by simply gaining access to the memory.</p>", "<p>The issue has been fixed on the newest version of Android - Lollipop - which runs on newer devices including the S6.</p>", "<p>Those running the older software are being urged to upgrade if possible.</p>", "<p>While Apple's TouchID system is similar, no attacker has demonstrated that it can be compromised using the hack.</p>"], "link": "http://news.sky.com/story/1470894/fingerprint-risk-on-samsung-s5-phone"},
{"category": ["software"], "category2": ["gaming"], "author": [], "headline": ["Oz National Park To Be Designed On Minecraft"], "image": ["http://media.skynews.com/media/images/generated/2014/8/21/330753/default/v2/kl6uz6a-1-362x204.png"], "content": ["<p class=\"story__intro\">Students are being asked to design Australia's next multimillion-dollar national park using the popular computer game Minecraft.</p>", "<p>The winning submission will be brought to life using a fund of around £6m which has been set aside by the local government in Adelaide.</p>", "<p>Entrants have been asked to incorporate spaces for activities like hiking and mountain bike trails, scenic vistas, and camp sites.</p>", "<p>Designs must also account for the flora and fauna in the Adelaide and Mount Lofty Ranges.</p>", "<p>Minecraft allows users to construct buildings and landscapes out of textured cubes in a 3D world.</p>", "<p>Environment minister Ian Hunter said: \"Whatever they create on the screen needs to be able to be translated into the real world.</p>", "<p>\"We'd like to see trails and other built features that are creative, practical, usable and sustainable, that complement the natural environment and the plants and animals living in it.\"</p>", "<p>The finalists' flyover videos will be posted on YouTube. The competition closes on 12 June.</p>", "<p>Entrants must use the basic version of Minecraft without any modifications or special texture packs.</p>"], "link": "http://news.sky.com/story/1469835/oz-national-park-to-be-designed-on-minecraft"},
{"category": ["business"], "category2": ["none"], "author": [], "headline": ["Google Launches Its Own Mobile Phone Network"], "image": ["http://media.skynews.com/media/images/generated/2013/5/16/238173/default/v2/google-sign-1-362x204.jpg"], "content": ["<p class=\"story__intro\">Google is launching its own mobile phone network in the US called Project Fi.</p>", "<p>Subscribers will pay a base fee of $20 (£13.30) a month which will cover unlimited domestic voice calling and texting.</p>", "<p>Data will cost $10 (£6.60) per gigabyte per month, and users will be charged only for what they use. Refunds will be issued for any unused data, the firm says.</p>", "<p>At first, only owners of the Nexus 6 smartphone will be able to sign up to the network.</p>", "<p>Google is renting the voice and data capacity from Sprint and T-Mobile, and will use existing Wi-Fi hotspots to provide the data service.</p>", "<p>Users will be switched between the networks depending on signal strength.</p>", "<p>The idea of a Google-created phone network was first publicly mentioned in February by Android executive Sundar Pichai, but little detail was provided.</p>", "<p>Google wrote on its blog this week: \"As you go about your day, Project Fi automatically connects you to more than a million free, open wi-fi hotspots we've verified as fast and reliable.</p>", "<p>\"Once you're connected, we help secure your data through encryption. When you're not on wi-fi, we move you between whichever of our partner networks is delivering the fastest speed, so you get 4G LTE in more places.\"</p>", "<p>Sprint reportedly has the right to renegotiate the deal if the popularity of the service grows above a certain size.</p>", "<p> </p>"], "link": "http://news.sky.com/story/1470721/google-launches-its-own-mobile-phone-network"},
{"category": ["software"], "category2": ["none"], "author": [], "headline": ["Google Joins Search For Loch Ness Monster"], "image": ["http://media.skynews.com/media/images/generated/2015/4/21/385975/default/v2/loch.ness.-196-2-1-362x204.jpg"], "content": ["<p class=\"story__intro\">Google has joined the search for the Loch Ness Monster by taking its Street View cameras across the famous Scottish loch.</p>", "<p>It sent teams to take pictures both above and below the waterline to help armchair Nessie hunters to explore the area.</p>", "<p>Google said the development was to mark the anniversary of the release of the Surgeon's Photograph - a 1934 hoax image claiming to show the monster in the misty waters of the lake.</p>", "<p>A post on Google's official blog said: \"Sail across the freshwater lake and take in its haunting beauty, made darker still by the peat particles found in its waters.</p>", "<p>\"Let the Loch unlock the spirit of your imagination, where the rippling water, tricks of the light, and drifting logs bring the legend of Nessie to life.\"</p>", "<p>It took Google around a week to take the photographs, with a diver being used to take the Street View Trekker camera under the waterline, before attaching it to a boat for the above-water shots.</p>", "<p>Loch Ness is the largest Scottish loch by water volume, containing more fresh water than all the lakes of England and Wales combined.</p>", "<p>Google says there are more searches for Loch Ness than the likes of Buckingham Palace.</p>"], "link": "http://news.sky.com/story/1469251/google-joins-search-for-loch-ness-monster"},
{"category": ["business"], "category2": ["none"], "author": [], "headline": ["Amazon Will Deliver Items To Your Car Boot"], "image": ["http://media.skynews.com/media/images/generated/2013/11/29/273622/default/v2/rtx15p9t-1-362x204.jpg"], "content": ["<p class=\"story__intro\">Amazon will begin delivering packages directly to car boots from next month.</p>", "<p>The online retailer has partnered with delivery firm DHL and Audi to send items to selected Audi-owning Prime customers in Munich.</p>", "<p>The delivery worker will get one-time keyless access to the car boot to drop off a package, and Audi insists there will be no extra insurance issues.</p>", "<p>Amazon said: \"During the checkout process, customers simply indicate the approximate location of their car during the delivery window.</p>", "<p>\"When a carrier driver arrives, the vehicle's car trunk can be momentarily accessed via a unique, order specific digital authorisation.</p>", "<p>\"The delivery agent then simply places the order into the trunk and closes the hatch which locks the car again.\"</p>", "<p>If successful, it could become an alternative to home delivery which can be awkward if you're not at home.</p>", "<p>Drivers who want to take part in the pilot will have to have their cars adapted to enable third-party access.</p>", "<p>Amazon says it wants the feature to be available to all Prime members eventually.</p>", "<p>Amazon is also looking into allowing customers to return items using the same method - leaving a package in their boot for a delivery driver to pick up.</p>", "<p>Volvo is also exploring a similar programme.</p>", "<p>Amazon Prime members pay an annual fee for services such as next-day delivery and streaming television and movies.</p>", "<p>Amazon already delivers items to lockers located in convenience stores and other locations.</p>"], "link": "http://news.sky.com/story/1470651/amazon-will-deliver-items-to-your-car-boot"},
{"category": ["socialMedia"], "category2": ["business"], "author": [], "headline": ["Facebook Revenue Growth Fails To Impress"], "image": ["http://media.skynews.com/media/images/generated/2015/3/19/378477/default/v2/rtr4c0vb-1-1-362x204.jpg"], "content": ["<p class=\"story__intro\">Facebook shares fell after-hours in New York on Wednesday night after a 46% jump in quarterly revenue to $3.54bn (£2.35bn) failed to impress investors.</p>", "<p>The social network's results for January to March showed continued progress in key areas but profits fell 20% as it spent big on development.</p>", "<p>There was a 13% rise in user numbers to 1.44 billion on the same period a year ago, with 24% more people accessing Facebook via a mobile device at least once a month.</p>", "<p>Facebook showed it had made further strides in mobile advertising to capture that shift in consumer behaviour, with 69% of its advertising revenue now coming from mobile ads.</p>", "<p>But that was where the good news stopped for shareholders, with the company missing Wall Street's expectations on its core financial numbers for the first time since 2013.</p>", "<p>Shares fell more than 2% after the Nasdaq close.</p>", "<p>Analysts had forecast revenue of $3.56bn while profits fell to $642m as its mobile app development spend contributed to an 83% rise in expenses in the period.</p>", "<p>Staff costs also rose - with the company's recruitment soaring 48% on the same period last year to pass the 10,000 mark.</p>", "<p>Facebook, which bought the popular photo-sharing app Instagram and the messaging service WhatsApp, has been coming out with its own stand-alone mobile apps to capture more of the time people spend on phones.</p>", "<p>Besides its Messenger app, Facebook's home-grown efforts have had limited success.</p>", "<p>On Wednesday, the company introduced Hello, a voice-calling app designed for Android phones.</p>", "<p>Analysts will be closely watching whether it takes off following Facebook's inability to persuade users to install its Home app, which lets Facebook take over the home screen on Android.</p>", "<p>Facebook finance chief David Wehner said mobile \"continues to be a key driver\" of the company's growth and it would continue to experiment with apps for mobile.</p>"], "link": "http://news.sky.com/story/1470530/facebook-revenue-growth-fails-to-impress"},
{"category": ["business"], "category2": ["none"], "author": ["By Sean Williams"], "headline": ["Crowdfunding Spotlight: From Website To Market"], "image": ["http://media.skynews.com/media/images/generated/2015/4/22/386316/default/v1/onpaste.20150422-134901-1-362x204.png"], "content": ["<p class=\"story__byline\">By Sean Williams</p>", "<p class=\"story__intro\">Millions of pounds have gone in to thousands of crowdfunding projects, but do the businesses ever come to market?</p>", "<p>Alternative finance has grown in popularity in the past five years. Benefiting many thousands of businesses in need of funds required to grow and prosper.</p>", "<p>But the big question is whether they actually do thrive and become the next big thing.</p>", "<p>Reward-based crowdfunding platforms such as Indiegogo, Kickstarter and the biggest UK platform, Crowdfunder.co.uk have helped thousands of ideas, prototypes and start-ups gain amounts from £100 to £15m.</p>", "<p>Some sceptics see the crowdfunding of quirky ideas and funky tech initiatives as a quick hit.</p>", "<p>But it is an e-commerce mechanism with the rewards part of the cycle essentially selling a product. The most successful being a good demonstration of this.</p>", "<p>The Pebble watch raised almost £7m on Kickstarter in 2012 and essentially guaranteed a raft of pre-orders in the process.</p>", "<p>It rapidly turned into a business success story and has since gone on to crowdfund its recent product launch – raising a further £13m in the process.</p>", "<p>Of course, these are the stand-out examples of crowdfunding and it’s not all multi-millions.</p>", "<p>In fact, the vast majority of businesses raise significantly less but it doesn't stop them from achieving business success.</p>", "<p>This week, Indiegogo crowdfunding project FOBO came to market through UK retailer Maplin.</p>", "<p>Initially a concept from Malaysia, the entrepreneurs behind \"the world’s first Bluetooth tyre pressure gauge\" raised £125,000 to get the first full production under way. Goal achieved.</p>", "<p>Yet more came of crowdfunding than they had expected. It was spotted by UK investors and after some successful negotiations, has now found its way onto the UK's high-street.</p>", "<p>The device helps tackle safety concerns surrounding dangerous under or over-inflated tyres that may lead to an accident.</p>", "<p>According to EU figures, under-inflated tyres are a contributory factor in 9% of all fatal road accidents and 41% of serious injuries on our roads.</p>", "<p>In addition, drivers with unroadworthy tyres can face penalties of up to £2,500 per wheel.</p>", "<p><strong>Other popular crowdfunding campaigns this week</strong></p>", "<p>According to social media research by Opinium, Indiegogo’s Smart Tracker, a device which allows you to track the whereabouts of anything, is the most talked about social media crowdfunding project this week with 3,226 tweets.</p>", "<p>Lynk, a security fob protecting your mobile or tablet data, and Gbreeze, a purifier project on Kickstarter gained 1,120 and 992 global tweets respectively.</p>"], "link": "http://news.sky.com/story/1470095/crowdfunding-spotlight-from-website-to-market"},
{"category": ["software"], "category2": ["none"], "author": ["By Tom Cheshire, Technology Correspondent"], "headline": ["To Catch A Sock Puppet: Exposing Web Frauds"], "image": ["http://media.skynews.com/media/images/generated/2012/9/7/191812/default/v1/rtr2xolk-1-362x204.jpg"], "content": ["<p class=\"story__byline\">By Tom Cheshire, Technology Correspondent</p>", "<p class=\"story__intro\">As the famous New Yorker cartoon put it: on the internet, no ones knows you're a dog. Or Tory chairman Grant Shapps (allegedly).</p>", "<p>Pretending to be someone else is a practice as old as the internet itself, dating back at least to 1993 and the days of Usenet.</p>", "<p><strong><a href=\"http://jargon-file.org/archive/jargon-4.1.0.dos.txt\">Jargon File</a></strong>, a dictionary of computer programming slang, defined sock puppetry: \"In Usenet parlance, a pseudo through which the puppeteer posts follow-ups to their own original message to give the appearance that a number of people support the views held in the original message.\"</p>", "<p>It also has the helpful etymology: \"From the act of placing a sock over your hand and talking to it and pretending it's talking back.\"</p>", "<p>Sock puppetry existed before the internet - Walt Whitman was outed as writing anonymous reviews of his own work in 1855.</p>", "<p>As the newspaper Daily Times wrote: \"This rowdy knight-errant who tilts against all lies and shams, himself perpetrates a lie and a sham at the very outset of his career.\"</p>", "<p>But sock puppetry really flourished online, where anyone can contribute their own anonymous reviews.</p>", "<p>It should also be differentiated from other online forms of impersonation, such as the catfish, who does more or less the same thing, but to trick people into love.</p>", "<p>In 2010, historian Orlando Figes wrote several pseudonymous reviews on Amazon taking his rivals down a peg, at the same time as praising his own work.</p>", "<p>He was caught out by the Times Literary Supplement, which spotted that the username - \"orlando-birkbeck\" - might have something to do with Figes, a professor at Birkbeck University of London.</p>", "<p>He initially blamed his wife, but nobly took full responsibility a couple of days later. \"I was under intense pressure … I have made some foolish errors.\"</p>", "<p>That pattern - get caught out, deny, blame someone else, admit everything, blame extenuating circumstances - tends to repeat.</p>", "<p>On Wikipedia, Johann Hari used the alias David Rose to praise his own work and to attack his own opponents, calling one anti-Semitic and another a drunk.</p>", "<p>The accusations first began in 2005; Hari denied the claim, but eventually apologised in 2011.</p>", "<p>So how do you catch a sock puppet? Well, inevitably, Wikipedia has a <a href=\"https://en.wikipedia.org/wiki/Wikipedia:Signs_of_sock_puppetry\"><strong>useful article on the subject</strong></a>.</p>", "<p>Warning signs include similar usernames, excessive support for one's cause, editing identical articles, uncivil editing , planned vandalism and a fictitious personality. Naturally.</p>", "<p>The article adds: \"Still, none of the signs are particularly clear, and the only definitive proof is an actual admission.\"</p>", "<p>And that's certainly not what we’ll see from Grant Shapps, <a href=\"http://news.sky.com/story/1469598/shapps-denies-editing-rivals-wikipedia-pages\"><strong>who strongly denies the allegation</strong></a>.</p>"], "link": "http://news.sky.com/story/1469968/to-catch-a-sock-puppet-exposing-web-frauds"},
{"category": ["business"], "category2": ["none"], "author": [], "headline": ["Security Expert Barred By Airline Over Tweet"], "image": ["http://media.skynews.com/media/images/generated/2014/8/26/331873/default/v1/united-1-362x204.jpg"], "content": ["<p class=\"story__intro\">A security researcher who tweeted that an airline's on-board communications systems could be hacked has been barred from boarding a California-bound flight.</p>", "<p>Chris Roberts was removed by the FBI from a United Airlines flight on Wednesday last week after landing in New York. He was questioned for four hours and had his computer equipment confiscated.</p>", "<p>Then late on Saturday he was turned away again despite clearing TSA security checks.</p>", "<p>A spokesman for the airline says he has now been banned from all flights with them.</p>", "<p>The move follows a message posted on Twitter in which he suggested he could take control of some of the plane's computer systems in order to deploy oxygen masks.</p>", "<p>The message was signed off with a smiley face, apparently indicating that it was meant as a light-hearted musing, but the airline and authorities have taken it seriously.</p>", "<p>He has said he was repeatedly able to connect his laptop to a box under his seat during a flight, which allowed him to view data from the aircraft's engines, fuel and flight-management systems.</p>", "<p>The FBI has not commented.</p>", "<p>Mr Roberts has given media interviews in recent weeks in which he has discussed airline system vulnerabilities.</p>", "<p>Last week the US Government Accountability Office said some commercial aircraft may be vulnerable to hacking over their onboard wireless networks. Modern aircraft are increasingly connected to the internet.</p>"], "link": "http://news.sky.com/story/1468574/security-expert-barred-by-airline-over-tweet"},
{"category": ["software"], "category2": ["none"], "author": [], "headline": ["Tidal Music App Crashes Down The Charts"], "image": ["http://media.skynews.com/media/images/generated/2015/3/31/380957/default/v3/cegrab-20150331-023450-687-1-362x204.jpg"], "content": ["<p class=\"story__intro\">Tidal - the service backed by the likes of Madonna and Kanye West to take on Spotify - appears to have flopped.</p>", "<p>It was designed to give musicians a bigger slice of streaming profits, but it is now no longer in the top 800 apps on Apple's store.</p>", "<p>Meanwhile, rival app Spotify has soared and appears in the top five apps, suggesting the launch of Tidal increased awareness of Spotify.</p>", "<p>Last week, Tidal chief executive Andy Chen left the company as part of a \"streamlining\" of the firm, which only launched in March.</p>", "<p>Tidal's iPhone app peaked at 27 three weeks ago, but has been steadily falling ever since.</p>", "<p>It is now the 872nd most downloaded app and 51st in the music category.</p>", "<p>Last week Kanye West deleted most of his tweets about Tidal, and removed his Tidal Twitter avatar.</p>", "<p>Tidal is billed as the first artist-owned platform for music and video.</p>", "<p>The service is backed by a series of A-list musicians including Chris Martin, Beyonce and Jay Z.</p>", "<p>Users can pay either £9.99 a month for a standard streaming service or £19.99 for high quality streaming. Unlike rival Spotify, the service does not have a free tier.</p>"], "link": "http://news.sky.com/story/1470842/tidal-music-app-crashes-down-the-charts"},
{"category": ["hardware"], "category2": ["business"], "author": [], "headline": ["ARM Hails Internet Of Things As Profits Leap"], "image": ["http://media.skynews.com/media/images/generated/2014/2/25/291993/default/v1/cegrab-20140225-204220-0-1-362x204.jpg"], "content": ["<p class=\"story__intro\">ARM Holdings has reported a 33% leap in pre-tax profit, partly due to surging sales of the latest iPhone models.</p>", "<p>The chip designer, which licences its products to the likes of Apple and Samsung, said that first quarter sales rose by 14%, royalties from processor designs jumped 31% but licensing revenue grew at the much slower rate of 3%.</p>", "<p>Profit before tax hit £103.4m while group revenues were £227.5m.</p>", "<p>Unlike its main rival Intel, ARM does not make chips, rather it designs and licenses them to third parties.</p>", "<p>It describes itself as the world's leading semiconductor intellectual property supplier.</p>", "<p>ARM chips sit inside no less than 95% of all smartphones and sales of new products from Apple were a major contributing factor to ARM's performance in the quarter. </p>", "<p>ARM technology will also sit inside the <strong><a href=\"http://news.sky.com/story/1462348/apple-watch-arrives-in-stores-around-the-world\" target=\"_blank\">new Apple watch</a> </strong>which is released on Friday.</p>", "<p>Looking forward, the company said that processors for microcontrollers and smart sensors to support the so-called Internet of Things would help underpin future revenue growth.</p>", "<p>The Internet of Things, which has been described as technology which will help create a new industrial revolution, involves connecting devices including everyday home objects such as fridges, as well equipment and components used in industry and healthcare. </p>", "<p>According to Cisco projections, by 2020 there will more than 50 billion devices connected to the Internet of Things.</p>", "<p>Simon Segars, ARM's chief executive, said: \"In Q1 (first quarter) we licensed ARMv8‑A processors for networking and server applications and Cortex-M processors for microcontrollers and smart sensors for the Internet of Things.</p>", "<p>\"These design wins underpin future royalty revenue growth and enable continued investment in future innovative technology to create long-term superior returns for our shareholders.\"</p>", "<p>Shares in ARM rose 6% in early trading on the FTSE 100 on Tuesday.</p>"], "link": "http://news.sky.com/story/1469259/arm-hails-internet-of-things-as-profits-leap"},
{"category": ["socialMedia"], "category2": ["none"], "author": [], "headline": ["Twitter To Let Anyone Send You Direct Messages"], "image": ["http://media.skynews.com/media/images/generated/2013/11/18/271238/default/v2/187243545-1-362x204.jpg"], "content": ["<p class=\"story__intro\">Twitter will now let anyone send you a direct message - not just the people you're following.</p>", "<p>It's a major overhaul for the site which until now has only allowed people who follow each other to exchange messages privately.</p>", "<p>The new feature is turned off by default but can be switched on in the settings menu.</p>", "<p>The feature has been tested before in October 2013, but it was killed off after just a few weeks.</p>", "<p>A prominent direct message button is also being added to the iPhone app to encourage people to use the often neglected feature.</p>", "<p>The move appears to be part of a move by Twitter to muscle in to the lucrative mobile-messaging market, which Facebook has recently made a big push into with its Messenger app.</p>", "<p>The feature will be particularly useful to celebrities and large companies who can now respond to people privately without having established a connection beforehand.</p>", "<p>Users can also send direct messages - known as DMs - to people who follow them, even if they do not follow them back and have not turned on the feature in the settings menu.</p>", "<p>Once a message is sent, the follower can respond.</p>", "<p>A Twitter spokesman said: \"We hope these changes help you connect more easily, and directly, on Twitter with the people, causes and businesses you care about most.\"</p>"], "link": "http://news.sky.com/story/1469125/twitter-to-let-anyone-send-you-direct-messages"},
{"category": ["socialMedia"], "category2": ["none"], "author": [], "headline": ["Facebook To Show You More Content From Friends"], "image": ["http://media.skynews.com/media/images/generated/2015/3/19/378477/default/v2/rtr4c0vb-1-1-362x204.jpg"], "content": ["<p class=\"story__intro\">If you're an avid Facebook user, you are about to see more content from your friends and family.</p>", "<p>The social network has tweaked its News Feed algorithms to prioritise content created by people you know.</p>", "<p>It will mean that posts from brands and news organisations will lose out, while photo galleries and status updates from your contacts will be pushed to the fore.</p>", "<p>Facebook says it comes as a result of page owners sharing more and more content.</p>", "<p>In a blog post the company said to page owners: \"The impact of these changes on your page's distribution will vary considerably depending on the composition of your audience and your posting activity.</p>", "<p>\"In some cases, post reach and referral traffic could potentially decline. Overall, pages should continue to post things that people find meaningful and consider these best practices for driving referral traffic.\"</p>", "<p>It comes after a survey of Facebook users found they would like to see more from people close to them.</p>", "<p>The site is also loosening restrictions which currently stop the site from showing multiple posts from the same person in the News Feed.</p>", "<p>It says: \"Now if you run out of content, but want to spend more time in News Feed, you’ll see more (from the same users).\"</p>", "<p>The other change made is that Facebook updates showing friends liking or commenting on a post will appear further down the News Feed, or not at all.</p>"], "link": "http://news.sky.com/story/1470187/facebook-to-show-you-more-content-from-friends"},
{"category": ["hardware"], "category2": ["none"], "author": [], "headline": ["Mysterious 'Supervoid' Is Largest Known Object"], "image": ["http://media.skynews.com/media/images/generated/2015/4/21/386008/default/v2/cmb7-wmap-circle-900-1-362x204.jpg"], "content": ["<p class=\"story__intro\">The largest-known structure ever discovered by mankind is a massive supervoid 1.8 billion light years across.</p>", "<p>The empty section of space - which would normally be expected to contain around 10,000 galaxies - was picked up using Hawaii's Pan-STARRS1 (PS1) telescope and Nasa's <strong><a href=\"http://www.nasa.gov/mission_pages/WISE/main/index.html\" target=\"_blank\">Wide Field Survey Explorer</a></strong> satellite.</p>", "<p>István Szapudi, who led the work at the University of Hawaii, said the discovery was \"the largest individual structure ever identified by humanity\".</p>", "<p>It could explain a large cold spot in the universe which has been unexplained for more than a decade.</p>", "<p>Areas of heat and cold are expected in the universe, but not the extent seen at the cold spot.</p>", "<p>But the supervoid only partially accounts for the low temperature, and there may be \"exotic physics\" - effects scientists don't yet understand - at play.</p>", "<p>The supervoid is not a vacuum but is around 20% less dense than a typical region of the universe.</p>", "<p>Scientists say it is an unprecedented find as the universe is evenly distributed at that scale.</p>"], "link": "http://news.sky.com/story/1469309/mysterious-supervoid-is-largest-known-object"}]