[{"category": ["mobielTablet"], "category2": ["software"], "author": ["James Rogerson"], "headline": ["Powerful new phone will let you dual-boot Android and Windows 10"], "image": ["http://cdn.mos.techradar.com/art/mobile_phones/Elephone%20dual-boot%20credit%20Neowin-320-80.jpg"], "content": ["<p><a href=\"/reviews/pc-mac/software/operating-systems/android-5-0-lollipop-1271651/review\">Android</a> and <a href=\"/reviews/phones/windows-phone-8-1-1239375/review\">Windows Phone</a> are about as different as two mobile operating systems can get, so there's every chance you might want the features of both. So far for the most part you've had to choose just one unless you want to juggle two handsets, but a new phone will reportedly let you dual-boot Android 5.0 and <a href=\"/reviews/phones/mobile-phones/windows-10-mobile-1286717/review\">Windows 10 Mobile</a>.</p>", "<p>The as-yet-unnamed phone is made by Elephone, a Chinese company you may not have heard of, but whose phones in many cases are available in the UK and US.</p>", "<p>The upcoming handset will come in two flavours according to <a href=\"http://www.neowin.net/news/new-elephone-flagship-to-launch-with-windows-10-and-android\">Neowin</a>, the dual-boot variety and one which just runs Android, with the Android one launching in May and the dual-boot version set to arrive in June.</p>", "<p>Both versions have a 5.5-inch 1440 x 2560 display, 4GB of RAM, 32GB of built in storage, a battery which exceeds 3800 mAh and a fingerprint scanner. From the pictures it also looks like they may have a metal shell, so whichever version you get it's set to be a seriously high-end handset.</p>", "<p>There are a few differences between the two versions beyond their OS options though. The Android version will apparently have a 64-bit MediaTek octa-core processor, while the dual-OS version will have a quad-core Intel chipset.</p>", "<p>There will also seemingly be a slight difference in their cameras, with the Android variant rocking a 21MP Sony IMX 230 snapper and the dual-boot version equipped with a 20.7MP Sony camera.</p>", "<p> While still a rumour at this point it looks fairly convincing, the only red flag being that a June release for a Windows 10 phone is perhaps a bit early. We sure hope it's true though, because a dual-booter with those specs could be a beast and it's likely to come with an affordable price tag too. </p>"], "link": "http://www.techradar.com/news/phone-and-communications/mobile-phones/powerful-new-phone-will-let-you-dual-boot-android-and-windows-10-1291863"},
{"category": ["wearables"], "category2": ["software"], "author": ["David Nield"], "headline": ["LG G Watch, G Watch R and Asus ZenWatch miss big Android Wear update"], "image": ["http://cdn.mos.techradar.com/art/Watches/LG%20G%20Watch/HandsOn/GWatch-HandsOn-06-320-80.JPG"], "content": ["<p>Google is rolling out <a href=\"/news/wearables/android-wear-s-new-update-puts-it-closer-in-line-with-the-apple-watch-1291500\">a major update for Android Wear</a> that, among other features, lets smartwatches latch on to Wi-Fi networks without a phone connection - that means you can update apps, send messages and more without your mobile.</p>", "<p>However, not all of the seven Android Wear watches currently on sale can take advantage of this Wi-Fi freedom - according to representatives from each company, the <a href=\"/reviews/phones/mobile-phone-accessories/lg-g-watch-1254912/review\">LG G Watch</a>, <a href=\"/reviews/phones/mobile-phone-accessories/lg-g-watch-r-1263332/review\">LG G Watch R</a> and the <a href=\"/reviews/wearables/asus-zenwatch-1263892/review\">Asus ZenWatch</a> are going to miss out.</p>", "<p>Together with the <a href=\"/reviews/phones/mobile-phone-accessories/samsung-gear-live-review-1256537/review\">Samsung Gear Live</a>, the LG G Watch was one of the first Android Wear watches to go on sale (with the <a href=\"/reviews/phones/moto-360-1264259/review\">Moto 360</a> arriving shortly after). However, it appears that getting to the market first has meant compromising in terms of internal components. The G Watch R is essentially the same watch with a circular design.</p>", "<p>As for the other Android Wear watches on the market, it looks like they all have the necessary internal circuitry to get online via Wi-Fi. Both <a href=\"http://motorola-blog.blogspot.de/2015/04/moto-360-its-time-for-update.html\">Motorola</a> (for the Moto 360) and <a href=\"http://blogs.sonymobile.com/2015/04/20/what-the-upcoming-android-wear-updates-mean-for-your-smartwatch-3/\">Sony</a> (for the <a href=\"/reviews/phones/mobile-phone-accessories/sony-smartwatch-3-1263328/review\">Sony Smartwatch 3</a>) have confirmed as much on their official blogs.</p>", "<p>LG's latest Android Wear watch, the <a href=\"/reviews/wearables/lg-watch-urbane-1285628/review\">LG Watch Urbane</a>, is definitely in line for a Wi-Fi boost - it's actually mentioned in <a href=\"http://googleblog.blogspot.co.uk/2015/04/android-wear-wear-what-you-want-get.html\">Google's official blog post</a> on the Android Wear update.</p>", "<p>That leaves the <a href=\"/reviews/phones/mobile-phone-accessories/samsung-gear-live-review-1256537/review\">Samsung Gear Live</a>, which launched at the same time as the LG G Watch. We're waiting to hear back from Samsung, but based on <a href=\"https://www.ifixit.com/Teardown/Samsung+Gear+Live+Teardown/27038\">a comprehensive Gear Live teardown</a> it looks like the necessary Wi-Fi components are included. We'll update this article if we get official confirmation.</p>"], "link": "http://www.techradar.com/news/wearables/lg-g-watch-and-asus-zenwatch-miss-out-on-wi-fi-update-1291664"},
{"category": ["business"], "category2": ["none"], "author": ["John McCann"], "headline": ["Disney puts words in your mouth with advanced Dubsmash tech"], "image": ["http://cdn.mos.techradar.com/art/other/Disney-VoiceOver-320-80.jpg"], "content": ["<p>Disney's Research lab has come up with a new automated system that can match various phrases to mouth shapes and make it look like you're saying something you're not. </p>", "<p>The system is \"literally putting plausible words into the mouth of the speaker\" which doesn't sound terrifying at all. </p>", "<p>The researchers demonstrated the tech in a video that's not exactly on a par with Frozen, quality-wise. An actor says the line \"clean swatches\" (which we obviously all say all the time, can't shut us up about clean swatches) and the system synthesizes it into a robot voice which it can then use to search for phrases that use the same vocal and mouth shapes. </p>", "<p>In the video example, alternative phrases include \"die swat saw\", \"see dick whine a toy\" and \"dead lube edge it a\", which you could record and dub over the actor's face and it would look like he was talking gibberish. Great! </p>", "<p>Obviously this has some useful implications for filmmakers, who sometimes needs to change dialogue in films without reshooting whole scenes and set-ups. There's also the potential to use it for better quality dubbing when releasing films in different languages. </p>", "<p>Evil dictators may also be interested in capturing political dissidents then releasing videos of them toeing the party line. Who's to say. Either way, hopefully it will lead to better quality Dubsmashes from your brother at 3am.</p>", "<p class=\"youtube-video\"> <object width=\"580\" height=\"356\"> <param name=\"movie\" value=\"http://www.youtube.com/v/Kt9_1eyQE38 &amp;hl=en&amp;fs=1\"><param name=\"allowFullScreen\" value=\"true\"><param name=\"allowscriptaccess\" value=\"always\"><embed src=\"http://www.youtube.com/v/Kt9_1eyQE38%20&amp;hl=en&amp;fs=1\" type=\"application/x-shockwave-flash\" allowscriptaccess=\"always\" allowfullscreen=\"true\" width=\"580\" height=\"356\"></embed></object> </p>"], "link": "http://www.techradar.com/news/world-of-tech/disney-puts-words-in-your-mouth-with-advanced-dubsmash-tech-1291861"},
{"category": ["wearables"], "category2": ["business"], "author": ["James Peckham"], "headline": ["Here are the six shops selling Apple Watch on launch day"], "image": ["http://cdn.mos.techradar.com/art/Watches/Apple%20Watch/Hands%20on%20iWatch/First%20option/Apple%20Watch%20review%20(1)-320-80.JPG"], "content": ["<p>The <a href=\"/news/wearables/apple-iwatch-release-date-news-and-rumours-1131043\">Apple Watch</a> officially goes on sale on April 24, but you won't be able to walk into an Apple store and leave with the Watch on your wrist. There are however, a select number of fashion outlets that will let you do just that.</p>", "<p>There are specifically six stores around the world who will have Apple Watch from tomorrow, giving you the traditional experience of entering a store and walking out with your new gadget in hand.</p>", "<p>Those stores include Dover Street Market in London and Beijing, Maxfield in LA, Colette in Paris, 10 Corso Como in Milan and The Corner in Berlin.</p>", "<p>If you're planning to buy in store you're going to need to reserve before you head on down to any of the high-end boutiques as stocks are very limited.</p>", "<p>The Apple Watch Edition in gold is apparently sold out in the Dover Street Market store and it only has 1,000 watches split between its London and Beijing stores.</p>", "<p class=\"webonly\"><a href=\"http://www.nytimes.com/2015/04/23/fashion/the-apple-watch-arrives-in-stores-just-not-its-own.html?_r=0\">Via New York Times</a></p>"], "link": "http://www.techradar.com/news/wearables/here-are-the-six-shops-selling-apple-watch-on-launch-day-1291835"},
{"category": ["mobileTablet"], "category2": ["none"], "author": ["James Rogerson"], "headline": ["Rumours suggest the Sony Xperia Z5 is the flagship we've been waiting for"], "image": ["http://cdn.mos.techradar.com/art/mobile_phones/Sony/XperiaZ3/Hands%20on%203/Sony%20Xperia%20Z3%20review%20(2)-320-80.JPG"], "content": ["<p>Sony's only just announced the <a href=\"/news/phone-and-communications/mobile-phones/sony-xperia-z4-what-we-want-to-see-1268100\">Xperia Z4</a>, but it's never too early for Xperia Z5 rumours, especially given what a modest upgrade the Z4 is.</p>", "<p>The good news is that if these rumours are to be believed the Xperia Z5 could not only be a worthy successor to the <a href=\"/reviews/phones/mobile-phones/sony-xperia-z3-1263309/review\">Xperia Z3</a>, but may even feature a much-needed redesign.</p>", "<p>That's the impression Twitter tipster <a href=\"https://mobile.twitter.com/Ricciolo1/status/590956147437412352/photo/1\">Ricciolo</a> has given anyway, in a post claiming that a new Sony flagship will have a new design/identity as well as a new camera, sensor, lens and software.</p>", "<p>The words Xperia Z5 are never used, but what else could it be really? Whatever it is the wait might not be too long, as Ricciolo also writes '#futureflagnotthatfar'. </p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"Xperia Z5 leak\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn0.mos.techradar.futurecdn.net//art/mobile_phones/Sony/Xperia%20Z5/Xperia%20Z5%20leak%20Ricciolo-320-80.jpg\" data-srcset=\"http://cdn0.mos.techradar.futurecdn.net//art/mobile_phones/Sony/Xperia%20Z5/Xperia%20Z5%20leak%20Ricciolo-320-80.jpg 320w, http://cdn0.mos.techradar.futurecdn.net//art/mobile_phones/Sony/Xperia%20Z5/Xperia%20Z5%20leak%20Ricciolo-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p>As well as those words a blurred image is attached, showing a scene selection menu, with a sunset photo taken under 'Normal' settings and on 'Sunrise &amp; Sunset HDR' mode. It doesn't reveal much, but it adds weight to the claims.</p>", "<p>Those aren't the only Xperia Z5 rumours flying around either, as we may even have seen a shot of the new phone, though it's er, questionable to say the least. An image found on <a href=\"http://www.weibo.com/3979603202/CetgoyeAp?type=comment#_rnd1429779486975\">Weibo</a> by <a href=\"http://stiri-telefoane.mobilissimo.ro/sony/iata-o-prima-imagine-cu-sony-xperia-z5-si-cateva-detalii-despre-dotari-si-lansare_26282.html\">Mobilissimo.ro</a> shows the back of a Sony branded device listed as the Z5, but details are so hard to make out that it could be almost anything.</p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"Xperia Z5 leak\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn0.mos.techradar.futurecdn.net//art/mobile_phones/Sony/Xperia%20Z5/Xperia%20Z5%20leak%20mobilissimo.ro-320-80.jpg\" data-srcset=\"http://cdn0.mos.techradar.futurecdn.net//art/mobile_phones/Sony/Xperia%20Z5/Xperia%20Z5%20leak%20mobilissimo.ro-320-80.jpg 320w, http://cdn0.mos.techradar.futurecdn.net//art/mobile_phones/Sony/Xperia%20Z5/Xperia%20Z5%20leak%20mobilissimo.ro-650-80.jpg 650w\" data-sizes=\"auto\"><figcaption>Credit: Mobilissimo.ro / Weibo</figcaption></figure></p>", "<p>There are a few things to take away from it though. For one it looks like it has a metallic edge, just like the Xperia Z4. It also looks to have a fairly small camera lens in the top left corner, which suggests that it may not have optical image stabilisation.</p>", "<p>Alongside the image there was a mention of a USB Type C port, which wouldn't be much of a surprise and also the words '9 month', which likely suggests a September release. That would at least line up with Ricciolo's claims that we don't have long to wait and fit with the roughly six month gap we typically see between Sony flagships.</p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"Xperia Z4 Compact leak\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn2.mos.techradar.futurecdn.net//art/mobile_phones/Sony/Xperia%20Z4%20Compact%20leak%20smhn.info-320-80.jpg\" data-srcset=\"http://cdn2.mos.techradar.futurecdn.net//art/mobile_phones/Sony/Xperia%20Z4%20Compact%20leak%20smhn.info-320-80.jpg 320w, http://cdn2.mos.techradar.futurecdn.net//art/mobile_phones/Sony/Xperia%20Z4%20Compact%20leak%20smhn.info-650-80.jpg 650w\" data-sizes=\"auto\"><figcaption>Credit: smhn.info</figcaption></figure></p>", "<p>Amidst all these Xperia Z5 rumours there have also been hints that we might see a Sony Xperia Z4 Compact, as <a href=\"https://translate.google.com/translate?sl=auto&amp;tl=en&amp;js=y&amp;prev=_t&amp;hl=en&amp;ie=UTF-8&amp;u=http%3A%2F%2Fsmhn.info%2F201504-xperia-z4-compact-a4-so-04g&amp;edit-text=\">smhn.info</a> got hold of a leaked accessory listing from Japanese mobile network NTT DoCoMo, which includes mention of an Xperia Z4 Compact.</p>", "<p>Sadly no image accompanies it, but as well as the name we get the model number of SO-04G, which is very similar to the SO-02G-packing Xperia Z3 Compact. Of course given that the Xperia Z4 is seemingly Japan-only we wouldn't hold our breath for the Z4 Compact making it west either.</p>"], "link": "http://www.techradar.com/news/phone-and-communications/mobile-phones/rumours-suggest-the-sony-xperia-z5-is-the-flagship-we-ve-been-waiting-for-1291830"},
{"category": ["wearables"], "category2": ["none"], "author": ["James Peckham"], "headline": ["LG Watch Urbane is just weeks away"], "image": ["http://cdn.mos.techradar.com/art/Watches/LG/LG%20Watch%20Urbane/LG%20Watch%20Urbane%20hands%20on/LG%20Watch%20Urbane%20review%20(5)-320-80.JPG"], "content": ["<p>LG has announced its third Android Wear wearable, the <a href=\"/reviews/wearables/lg-watch-urbane-1285628/review\">Watch Urbane</a>, will be launching on the Google Play Store by the end April.</p>", "<p>Those in the UK, Australia and the US will see the watch from next week, but there's no official release date for any of the online stores.</p>", "<p>The Watch Urbane is also coming to South Korea from today whilst Canada, France, Germany, Hong Kong, India, Ireland, Italy, Japan and Spain will see a release starting at the end of this month.</p>", "<p>Online retailer Clove UK previously revealed it will be stocking the Watch Urbane from April 30 at a pricey £259.99.</p>", "<p>When we went hands-on with the LG Watch Urbane we called it the best looking Android Wear smartwatch but noticed it still has some real issues - mostly the Android Wear platform.</p>"], "link": "http://www.techradar.com/news/wearables/lg-watch-urbane-is-just-weeks-away-1291816"},
{"category": ["mobileTablet"], "category2": ["hardware"], "author": ["David Nield"], "headline": ["LG's latest G4 promo video reveals UX and camera details"], "image": ["http://cdn.mos.techradar.com/art/mobile_phones/LG/LG%20G4/Leaks/G4%20UX%20Teaser-320-80.jpg"], "content": ["<p>Phone manufacturers have become as adept as the producers of the <a href=\"/news/home-cinema/star-wars-the-force-awakens-trailers-news-and-rumors-1290846\">Star Wars movies</a> when it comes to trickling out information about their upcoming releases, and today we've got another official promo video for the <a href=\"/news/phone-and-communications/mobile-phones/lg-g4-what-we-want-to-see-1266879\">LG G4</a> to pore over.</p>", "<p>The <a href=\"https://www.youtube.com/watch?v=EExBLxX14KE\">LG UX 4.0 Unveiled: Part 2 clip</a> focuses on the camera. There's a Quick Shot mode, for example, that lets you double-tap the button on the back of the handset to take a shot - it even works when the phone is locked. A feature Huawei introduced with the <a href=\"/reviews/phones/mobile-phones/huawei-ascend-p7-1246719/review\">Ascend P7</a> last year.</p>", "<p>For all you selfie lovers, Gesture Interval Shot lets you take four shots in a row with a wave of the hand. The idea is that at least one of the four is something you're going to be happy to post to Instagram, or wherever.</p>", "<p class=\"youtube-video\"> <object width=\"580\" height=\"356\"> <param name=\"movie\" value=\"http://www.youtube.com/v/EExBLxX14KE&amp;hl=en&amp;fs=1\"><param name=\"allowFullScreen\" value=\"true\"><param name=\"allowscriptaccess\" value=\"always\"><embed src=\"http://www.youtube.com/v/EExBLxX14KE&amp;hl=en&amp;fs=1\" type=\"application/x-shockwave-flash\" allowscriptaccess=\"always\" allowfullscreen=\"true\" width=\"580\" height=\"356\"></embed></object> </p>", "<p>LG UX 4.0 is also going to introduce Ringtone ID, where each contact can have a separate ringtone. It's an option that's been in Android for a while, but it looks like the difference here is that ringtones can be automatically composed as well as manually set.</p>", "<p>Finally, the video showcases another feature called Quick Memo+ - it lets you easily collect snippets from the web without all of the extraneous adverts and graphics and everything else.</p>", "<p>All will be revealed on 28 April at <a href=\"/news/phone-and-communications/mobile-phones/lg-just-confirmed-the-g4-release-date-along-with-some-other-interesting-details-1291462\">the official phone launch</a>, and we'll get to see whether the LG G4 has what it takes to challenge the likes of the <a href=\"/reviews/phones/mobile-phones/samsung-galaxy-s6-1285636/review\">Samsung Galaxy S6</a> and <a href=\"/reviews/phones/mobile-phones/htc-one-m9-1285623/review\">HTC One M9</a>.</p>"], "link": "http://www.techradar.com/news/phone-and-communications/mobile-phones/lg-s-latest-g4-promo-video-reveals-ux-and-camera-details-1291847"},
{"category": ["wearables"], "category2": ["none"], "author": ["Lily Prasuethsut"], "headline": ["Oculus Rift release looking even less likely for 2015"], "image": ["http://cdn.mos.techradar.com/art/events/F8%202015/f8-oculus-320-80.jpg"], "content": ["<p>During its Q1 earnings call today, social media giant Facebook confirmed <a href=\"/reviews/gaming/gaming-accessories/oculus-rift-1123963/review\">Oculus Rift</a> will not have \"large shipment volumes\" in 2015, meaning we probably won't be getting a consumer version of the VR headset in time for the holidays.</p>", "<p>Specifically, the company stated: \"We have not announced any specific plans for shipment volumes for 2015 related to Oculus ... Oculus is very much in the development stage and it's too early to be talking about large shipment volumes.\"</p>", "<p>This falls in line with the <a href=\"/news/wearables/facebook-cto-confirms-oculus-rift-will-release-in-2015-1289509\">clarification</a> Facebook CTO Mike Schroepfer issued during the Facebook developer conference last month. Schroepfer initially said users can expect VR this year but sent a follow-up tweet to clarify that he was referring to PC hardware capable and never meant to announce a release time frame for the Rift.</p>", "<p>Looks like we'll just have to settle for an <a href=\"/reviews/wearables/htc-vive-1286775/review\">HTC Vive</a> or even the new <a href=\"/reviews/wearables/samsung-gear-vr-s6-1286670/review\">Samsung Gear VR for S6</a> in 2015. </p>"], "link": "http://www.techradar.com/news/wearables/facebook-earnings-call-reveals-oculus-rift-will-not-ship-this-year-1291795"},
{"category": ["mobileTablet"], "category2": ["business"], "author": ["John McCann"], "headline": ["EE Harrier swoops in as the next low-cost 4G smartphone"], "image": ["http://cdn.mos.techradar.com/art/mobile_phones/EE/Harrier/Harrier-HarrierMini-01-320-80.jpg"], "content": ["<p>The EE Harrier and Harrier Mini are official - the latest 4G smartphones from the mobile network promising the most affordable 4G experience with Wi-Fi calling.</p>", "<p>The main attraction is the 5.2-inch EE Harrier which boasts a full HD resolution, 1.5GHz octa-core processor, <a href=\"/reviews/pc-mac/software/operating-systems/android-5-0-lollipop-1271651/review\">Android Lollipop</a>, 13MP rear camera, 2500mAh battery, Wi-Fi calling and of course CAT4 4G with average data speeds of 60Mbps.</p>", "<p>It'll set you back £199.99 on PAYG, or you can grab it free from £21.99 per month.</p>", "<p>If that's pushing your budget a bit, or you're put off by the large nature of the Harrier, then consider its smaller brother - the EE Harrier Mini.</p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"EE Harrier\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn2.mos.techradar.futurecdn.net//art/mobile_phones/EE/Harrier/Harrier-HarrierMini-02-320-80.jpg\" data-srcset=\"http://cdn2.mos.techradar.futurecdn.net//art/mobile_phones/EE/Harrier/Harrier-HarrierMini-02-320-80.jpg 320w, http://cdn2.mos.techradar.futurecdn.net//art/mobile_phones/EE/Harrier/Harrier-HarrierMini-02-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p>For the same price as the <a href=\"/reviews/phones/mobile-phones/ee-kestrel-1247869/review\">EE Kestrel</a> when it launched last year, the £99.99 Harrier Mini gives you a 4.7-inch 720p display, 1.2GHz quad-core processor, 8MP rear facing camera, Wi-Fi calling and 4G data speeds.</p>", "<p>The Harrier Mini has been dubbed the \"UK's most affordable 4G smartphone with Wi-Fi calling\" by EE, which isn't hard when you consider the other contenders from the network are the <a href=\"/reviews/phones/mobile-phones/samsung-galaxy-s6-1285636/review\">Galaxy S6</a>, <a href=\"/reviews/phones/mobile-phones/samsung-galaxy-s6-edge-1286088/review\">S6 Edge</a>, <a href=\"/reviews/phones/mobile-phones/iphone-6-1264565/review\">iPhone 6</a> and <a href=\"/reviews/phones/mobile-phones/iphone-6-plus-1264566/review\">6 Plus</a> - and now the Harrier as well.</p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"EE Osprey 2\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn1.mos.techradar.futurecdn.net//art/mobile_phones/EE/Harrier/Osprey2-Press-320-80.jpg\" data-srcset=\"http://cdn1.mos.techradar.futurecdn.net//art/mobile_phones/EE/Harrier/Osprey2-Press-320-80.jpg 320w, http://cdn1.mos.techradar.futurecdn.net//art/mobile_phones/EE/Harrier/Osprey2-Press-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p>There's also two new mobile hotspots - the Osprey 2 and Osprey 2 Mini - providing 4G data speeds for up to 10 connected devices and the former also doubles as a 5150mAh battery pack to recharge your tech.</p>", "<p>The Osprey 2 will set you back £69.99 on PAYG, or you can get it free on contracts from £15 per month. The Osprey 2 Mini is just £49.99 on PAYG or free from £15 per month.</p>"], "link": "http://www.techradar.com/news/phone-and-communications/mobile-phones/ee-harrier-swoops-in-as-the-next-low-cost-4g-smartphone-1291758"},
{"category": ["hardware"], "category2": ["none"], "author": ["Duncan Geere"], "headline": ["Robot seized and released after buying ecstasy online"], "image": ["http://cdn.mos.techradar.com/art/Randoms/robot_chains-320-80.jpg"], "content": ["<p>Police in Switzerland have confirmed that they have <a href=\"http://www.theguardian.com/world/2015/apr/22/swiss-police-release-robot-random-darknet-shopper-ecstasy-deep-web?CMP=edit_2221\">released a robot</a> that they confiscated after it bought ten ecstasy tablets on the internet.</p>", "<p>The bot was taken into custody in January 2015 alongside all of the purchases it had made online - a pair of fake Diesel jeans, a Hungarian passport, 200 Chesterfield cigarettes, a baseball cap with hidden camera, a fake Louis Vuitton handbag, a set of Nike trainers, a collection of fire brigade-issued master keys, a Sprite can with a hole cut out in order to store cash and a Lord of the Rings e-book collection.</p>", "<p>It has now been returned to its owners, the art group !Mediengruppe Bitnik. They'd programmed the bot to go on a shopping spree on the darknet once a week with $100 in bitcoins and mail the results home - which were then added to an installation in a gallery. </p>", "<p>According to a <a href=\"https://wwwwwwwwwwwwwwwwwwwwww.bitnik.org/r/2015-04-15-random-darknet-shopper-free/\">blog post from the group</a>, the public prosecutor said that \"the possession of Ecstasy was indeed a reasonable means for the purpose of sparking public debate about questions related to the exhibition\".</p>", "<p>A spokesperson for the Swiss police <a href=\"http://www.cnbc.com/id/102604472\">told CNBC</a>: \"We decided the ecstasy that is in this presentation was safe and nobody could take it away. Bitnik never intended to sell it or consume it so we didn't punish them.\"</p>", "<p>Neither the robot nor the artists will be charged with a criminal offence, but the ecstasy tablets were destroyed.</p>"], "link": "http://www.techradar.com/news/world-of-tech/robot-seized-and-released-after-buying-ecstasy-online-1291824"},
{"category": ["software"], "category2": ["none"], "author": ["Chuong Nguyen"], "headline": ["Microsoft debuts new Mail, Calendar apps in latest Windows 10 release"], "image": ["http://cdn.mos.techradar.com/art/TRBC/Software/Windows%2010%20Jan%202015%20Hands%20On/windows-10-jan-15-hero-320-80.jpg"], "content": ["<p>Microsoft rolled out a new build of its <a href=\"/reviews/pc-mac/software/operating-systems/windows-10-1267364/review\">Windows 10</a> Technical Preview late Wednesday afternoon. The update brings Windows 10 Technical Preview to build 10061, and comes with new versions of the Mail and Calendar apps. </p>", "<p>At this time, the release is only available to Windows Insider customers who are in the fast ring and not the slow ring. In Microsoft's two-stage preview approach, fast ring customers get releases earlier than customers in the slow ring, but may encounter more bugs or issues. </p>", "<p>In this release, customers will now have access to the new Mail and Calendar apps. These apps were also delivered recently to mobile customers in the <a href=\"/reviews/phones/mobile-phones/windows-10-mobile-1286717/review\">Windows 10 for phones</a> technical preview. </p>", "<p>Microsoft says that both apps support Office 365, Exchange, Outlook, Gmail, IMAP, POP, and other protocols. </p>", "<p>There is a three-pane UI for quick navigation, an easy toggle to switch between the two apps and also gesture support to perform quick tasks like on the mobile version.</p>", "<p>\"Mail includes customizable Swipe Gestures, letting you swipe right or left to take actions like delete, flag, move or mark as read/unread,\" Microsoft said in a blog post. \"Also check out the new email authoring experience. Mail leverages the familiar and rich capability of Word to that allows you to easily insert tables, add pictures and use bullets and color to your text.\"</p>", "<p>Users who upgrade to the latest build are advised to visit the Store Beta, which is the grey Store tile, to update both apps. \"The version of the Mail and Calendar apps included in this build have a known issue that causes every typed letter to appear twice,\" Microsoft said, but the update from the store should fix the problem. </p>", "<p>There are also other improvements as well. Tablets owners will have a better experience with the new 10061 build as the taskbar now grows in size to support better touch.</p>", "<p>\"Entering Tablet Mode causes the Start button, Cortana, and the Task View buttons to all grow in size and space out to be more touchable,\" Microsoft said of the experience. \"Items in the Notification area also widen to improve touchability. Also, pinned and running apps are removed by default to reduce clutter and simplify the experience.\"</p>", "<p>There are also new improvements to the task view and a new black theme.</p>", "<p>For multitasking customers who need more desktop space, Windows 10 now also supports unlimited virtual desktops.</p>"], "link": "http://www.techradar.com/news/software/operating-systems/microsoft-debuts-new-mail-calendar-apps-in-latest-windows-10-release-1291799"},
{"category": ["software"], "category2": ["none"], "author": ["Jamie Carter"], "headline": ["The incredible story of the underwater internet"], "image": ["http://cdn.mos.techradar.com/art/TRBC/Miscellaneous/underwater%20internet%20feature/underwater%20internet%201%20hero-320-80.jpg"], "content": ["<p>Mother Earth is a motherboard. The 'last mile' is much discussed, but much more important is the 'middle mile' – and that means deep ocean cables. A whopping 99% of international data is transmitted along the bottom of the ocean via submarine communications cables, with new, high-cost and high-tech projects planned to further boost global broadband speeds.</p>", "<p>\"Submarine cables are critical to supporting the internet, carrying virtually all traffic back and forth across the world,\" says Kaveh Ranjbar, Chief Information Officer, RIPE NCC, one of five Regional Internet Registries (RIRs). \"Their importance means that there are a lot of them, which in turn means the internet has redundancies in place in the event one section does get damaged,\" he says. </p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"Underwater cables\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn2.mos.techradar.futurecdn.net//art/TRBC/Miscellaneous/underwater%20internet%20feature/underwater%20internet%202-320-80.jpg\" data-srcset=\"http://cdn2.mos.techradar.futurecdn.net//art/TRBC/Miscellaneous/underwater%20internet%20feature/underwater%20internet%202-320-80.jpg 320w, http://cdn2.mos.techradar.futurecdn.net//art/TRBC/Miscellaneous/underwater%20internet%20feature/underwater%20internet%202-650-80.jpg 650w\" data-sizes=\"auto\"><figcaption>Fishing trawlers frequently destroy undersea cables near the coast</figcaption></figure></p>", "<p>Earthquakes and natural disasters are rare, but deadly. \"When we had the tsunami in Japan in 2011 it destroyed nearly all of the cables in the area,\" says Jean-Luc Vuillemin, Senior Vice-President, International Backbones &amp; Networks at Orange Marine. Five years previously, an earthquake severed 80% of the cable connections between Taiwan and the world, wiping out half of Hong Kong's internet capacity and leaving its banks floundering.</p>", "<p>However, the biggest problem is with ships' anchors and the fishing industry. \"The problem isn't at all with sharks, as I read in some newspapers, but fishing trawlers, especially near the coast,\" says Vuillemin, \"so we bury the marine cables up to 3m in the seabed, especially near the coast.\" </p>", "<p>All this is why the network now has so much redundancy. \"A cable break is problematic as a minimum of two to three weeks is required before it will be functioning again,\" says Eric Loos, Senior Product Manager Capacity &amp; IP, BICS, whose 75 submarine cables have 200 landing points.</p>", "<p>The process goes something like this – a global consortium proposes a new high-speed cable to link two disparate countries, and invites investment from global capital and any country along the way that wants to benefit. National governments, telecoms companies or private investors then contribute to the construction of the cable, and pay for a landing station to connect to it.</p>", "<p>Take Orange Marine's Sea-Me-We 5, a 20,000km-long cable that will link France and Singapore from 2016, with 18 cable landing points in 17 countries including Myanmar, Bangladesh and Sri Lanka. For a developing country, a new cable passing nearby is a huge – and hugely expensive – opportunity. </p>", "<p>For instance, the Bangladeshi government has taken a <a href=\"http://www.thedailystar.net/idb-offers-44m-for-second-undersea-cable-38684\">loan</a> of $44 million (around £29.5 million, AU$56.6 million) from the Islamic Development Bank to help pay its total contribution of $72.5 million (around £48.7 million, AU$93.3 million) towards the SMW5 cable. Of the total, $40 million (around £26.9 million, AU$51.4 million) is for the deep-sea cable's manufacture and installation, and $32.5 million (around £21.8 million, AU$41.8 million) is for the branch cable and landing station.</p>", "<p>Neighbouring Myanmar's decision to also link to SMW5 made it cheaper for Bangladesh to join to it. The stakes are high – Bangladesh's current internet bandwidth total is around 200Gbps thanks to the sole submarine cable it links to, though it also has overland links to Indian cables. By the time SMW5 is completed, the country will have seven times more capacity. </p>", "<p>\"Landing stations can be open or closed,\" says Vuillemin. \"If it's open, all telecom operators can connect to the cable, but if it's closed, only the operator that has paid for the landing station can connect.\" The cable is being manufactured at one end by Alcatel-Lucent and from the Singapore end by NEC, and laid using one of Orange Maritime's four cable-laying ships. </p>", "<p>\"Fast web access can have transformative powers on developing communities, especially when you think of it in terms of access to education, and better communications during disaster scenarios,\" says Liam Fisher at Built Invisible.</p>", "<p>Rather incredibly, there's a new project called Arctic Fibre whose 15,000km will pass through the frozen North West Passage – the Canadian and Alaskan Arctic – to directly connect Tokyo with New York and London.</p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"Doug Madory director of Internet analysis at Dyn\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn4.mos.techradar.futurecdn.net//art/TRBC/Miscellaneous/underwater%20internet%20feature/underwater%20internet%204-320-80.jpg\" data-srcset=\"http://cdn4.mos.techradar.futurecdn.net//art/TRBC/Miscellaneous/underwater%20internet%20feature/underwater%20internet%204-320-80.jpg 320w, http://cdn4.mos.techradar.futurecdn.net//art/TRBC/Miscellaneous/underwater%20internet%20feature/underwater%20internet%204-650-80.jpg 650w\" data-sizes=\"auto\"><figcaption>Doug Madory, director of internet analysis at Dyn</figcaption></figure></p>", "<p>\"Arctic Fibre is a novel and ambitious project that, if successful, would potentially achieve the fastest internet route between New York City and Tokyo, as well as providing high speed internet to cities in northern Canada and Alaska,\" says Doug Madory, director of Internet analysis at Dyn, whose blog contains some fascinating investigations into <a href=\"http://research.dyn.com/2014/12/whats-next-cuba/\">Cuba's</a> lack of submarine cables and on <a href=\"http://research.dyn.com/2014/07/no-turning-back-russia-crimea/\">Russia</a> secretly activating the Crimean cable.</p>", "<p>\"The Arctic Fibre team is having to contend with issues that have never before been faced by a submarine cable installation project – it's another example of the amazing work engineers are doing out there to create a more resilient and performant internet.\"</p>"], "link": "http://www.techradar.com/news/internet/the-incredible-story-of-the-underwater-internet-1291295"},
{"category": ["hardware"], "category2": ["none"], "author": ["Gabie Kur"], "headline": ["Best workstation: the top enterprise desktops"], "image": ["http://cdn.mos.techradar.com/art/desktop_pcs_and_macs/HP/Z1%20G2/hp-z1-g2-320-80.JPG"], "content": ["<p>What comes to mind when we say workstation? If you're thinking some big, spaceship-like contraption, you'd traditionally be right. But these days, workstations are sleek and trendy machines that still provide intelligent performance for most applications. They're useful tools for designers, engineers, financial analysts and researchers running more demanding applications, like rendering complex graphics, financial analysis and computations and digital content creation. There are even a few amazing options that come in <a href=\"/news/mobile-computing/best-mobile-workstation-5-ideal-laptops-for-business-1271480\">laptop</a> form. </p>", "<p>But, with so many on the market, what merits do the office \"power users\" look for when deciding upon which workstation is the best investment for an increase in productivity, limited downtime and improved reliability? Here are a few that we've reviewed that we recommend:</p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"best workstation\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn1.mos.techradar.futurecdn.net//art/desktop_pcs_and_macs/Dell/Precision%20T7610/dell_precision_t7610-320-80.jpg\" data-srcset=\"http://cdn1.mos.techradar.futurecdn.net//art/desktop_pcs_and_macs/Dell/Precision%20T7610/dell_precision_t7610-320-80.jpg 320w, http://cdn1.mos.techradar.futurecdn.net//art/desktop_pcs_and_macs/Dell/Precision%20T7610/dell_precision_t7610-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p>Boasted by Dell as the world's most powerful workstation, the Precision is a capable mid-range workstation, born out of the years of experience from the Austin-based vendor. It is well thought out, expertly designed, sturdy, powerful and reasonably priced for its value proposition to customers. This Dell system sticks to the big box approach, standing large at 438 (h) x 216 (w) x 545mm (d) (16.95 x 8.50 x 20.67 inch) and 14kg (31lb.), unlike Apple Mac Pro's minimalist look-and-feel and HP Z1 G2's all-in-one approach. Despite its size, two integrated aluminum handles, one at the front and one at the back, moving the bulky workstation is deceptively easy and ergonomically sensible.</p>", "<p>Within the Dell Precision T7610 lies a full-size Extended ATX motherboard with an Intel C602 chipset. The latter is populated with 16GB of RAM (four 4GB modules) ECC DDR3 RDIMM clocked at 1.866GHz, an integrated LSI 2308 SAS/SATA controller and a 3GB Nvidia Quadro K4000 full-size card with two DP and one DVI-I port.</p>", "<p>Expansion capabilities are nothing short of exceptional with one free processor socket as well as 12 other free memory slots (allowing up to 256GB when filled with 16GB memory modules) plus a 1TB hard disk drive from Western Digital, a Caviar Blue model with 64MB cache, along with a slimline optical drive plus a removable 1300W PSU. </p>", "<p>Two Intel-powered GbE NICs (82579LM and I210), four front-facing USB ports (one of them USB 3.0), 6 rear ones (half of them USB 3.0), legacy IOs (serial plus a pair of PS/2 ports), up to 5 free PCIe slots of various flavors (when used with two processors) and one PCI, one external 5.25-inch bay, 4 x 3.5-inch or 8 x 2.5-inch front accessible hard drive bays. Four are accessible from an external 5.25-inch bay behind a removable plastic bay.</p>", "<p>There are even customization options. Users can choose to add a storage solution from Intel called the Cache Acceleration Software - Workstation ( or CAS-W), which is described as the first enterprise-grade caching acceleration software application for workstations. Although, it is worth noting that should you want more system memory or two processors, you will have to chat with one of Dell's Customer Service Assistants as you won't be able to configure the base until at all online.</p>", "<p>You can only tweak the software (McAfee, Microsoft Office or Dell's Data Protection Encryption Software), the peripherals (display, keyboard or mouse) or the services bundled with the machine (data protection, client installation, etc.). The upside - customers get a three-year next business day basic warranty plus a keyboard and mouse.</p>", "<p>Why love the T6710? It proves to be a sturdy, capable, dependable and quiet workstation, delivering top-of-the-line firepower and data churning capabilities. Its base unit price starts at approximately $3445 (£2027.40 or AU$3660). Despite its size, it is a brilliant piece of hardware that is surprisingly quiet when in use, even under load.</p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"Fujitsu Celcius W530\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn2.mos.techradar.futurecdn.net//art/TRBC/Desktops/Fujitsu/W530%20Workstation/Celsius%20W530%20main%20image-320-80.JPG\" data-srcset=\"http://cdn2.mos.techradar.futurecdn.net//art/TRBC/Desktops/Fujitsu/W530%20Workstation/Celsius%20W530%20main%20image-320-80.JPG 320w, http://cdn2.mos.techradar.futurecdn.net//art/TRBC/Desktops/Fujitsu/W530%20Workstation/Celsius%20W530%20main%20image-650-80.JPG 650w\" data-sizes=\"auto\"></figure></p>", "<p>Desktop workstations can be both big and expensive, but not with the Fujitsu Celsius W530, a compact and affordable entry-level workstation designed to bridge the gap between high-end PCs and much more expensive professional models.</p>", "<p>It only has one processor, but that's reflected in the £1,430 recommended price (around $2,160, AU$2,680), and we found it selling for a lot less than that online. </p>", "<p>Despite the single socket and DDR3 memory, the Celsius workstation manages to deliver an impressive level of performance with its Quadro K2200 more than keeping pace with the Xeon processor on the graphics front. The decision to go with an SSD as a boot disk further helps here and although a 1TB data disk is far from generous there's room to upgrade and add more if needed.</p>", "<p>Other things we liked were the built-in card reader and a good quality keyboard and mouse which, although not wireless, were a lot better than the very basic peripherals that came with the Dell Precision workstation.</p>", "<p>Overall build quality is a little down on Dell standards, but that's to be expected given the price, and it is a tool-free design which makes it very easy to maintain.</p>", "<p>Conservatively styled, the Celsius W530 is a very nice little entry-level workstation that we could see being used to run a mix of CAD/CAM, image editing and other graphics-intensive applications whilst also hosting general office productivity tools.</p>"], "link": "http://www.techradar.com/news/computing/best-workstation-the-best-enterprise-desktop-for-you-1271279"},
{"category": ["socialMedia"], "category2": ["none"], "author": ["Lily Prasuethsut"], "headline": ["This is the staggering amount of people who use Facebook"], "image": ["http://cdn.mos.techradar.com/art/events/F8%202015/f8-zuckerberg-320-80.jpg"], "content": ["<p>How much does Facebook affect our lives? Apparently quite a lot. </p>", "<p>Facebook CEO Mark Zuckerberg divulged just how much during the company's quarterly earnings call today by listing off a bunch of numbers that are pretty crazy when you think about it.</p>", "<p>Here are the more interesting bits:</p>", "<p>We also use Facebook on mobile the most with 1.5 million people logging on via a mobile device in March.</p>", "<p>That's a lot of us using Facebook, Instagram and WhatsApp, and somehow it seems like the numbers are only increasing every year. </p>"], "link": "http://www.techradar.com/news/internet/this-is-the-staggering-amount-of-people-who-use-facebook-1291789"},
{"category": ["mobileTablet"], "category2": ["none"], "author": ["Chuong Nguyen"], "headline": ["Good delivers smart card-level authentication to Android phones"], "image": ["http://cdn.mos.techradar.com/art/internet/security/Good%20Technology-320-80.jpg"], "content": ["<p>Continuing the <a href=\"/news/world-of-tech/rsa-chief-blasts-security-industry-for-failure-to-protect-1291639\">RSA 2015</a> theme that hardware-based security delivers better threat protection than software approaches, Good Technology is rolling out what it is calling the industry's first Trusted Execution Environment for enterprise mobility management. Available initially for Android smartphones and tablets, Good's solution protects your log-in credentials in a secure container, separate from Google's operating system. </p>", "<p>By isolating credentials into a separate container, Good says that even if Android gets compromised, malicious software won't be able to intercept your passwords or PINs. </p>", "<p>Chief technology officer Nicko van Someren says that Good was able to deliver this feature based on the TrustZone architecture on ARM-based processors. ARM processor cores can run the Android OS and have a secure component to house the separate trusted operating system to handle PINs. </p>", "<p>By migrating security to the hardware - in this case, a component of the ARM chip - Someren says that this approach is equivalent to having an enterprise-grade smart card for your phone or tablet. To use TrustZone, devices must have a ROM that supports this feature. Most high-end Android devices already ship with a TrustZone support today. </p>", "<p>As part of its vision to expand secure mobility, Someren says that Good's Trusted Execution Environment solution will help change the perception of Android. Current enterprise activation number is about three to one between iOS and Android, with businesses favoring Apple's operating system because of security. </p>", "<p>However, that may change as Trusted Execution Environment (TEE) will be able to protect login credentials even if Android is fully attacked. </p>", "<p>As the credentials and the authentication lives outside of the rich operating system - Android - and inside the trusted operating system, malware would not be able to penetrate. User's credentials cannot be accessed even if the device is rooted, and malicious attacks cannot intercept the user's PIN or log keystrokes.</p>", "<p>Someren says that the TEE requires a trusted code, which is signed, to authenticate. This makes it secure and reduces friction as users no longer need complicated passcodes with hardware-based security.</p>", "<p>In addition to achieving greater security in the event of a malicious code attack on Android, TEE also provides the benefit of simple PINs. Organizations and IT managers could ease requirements to allow shorter PIN codes without compromising security.</p>", "<p>TEE will be able to authenticate itself with the back-end server using a PIN and the device's hardware. </p>", "<p>Like Microsoft's <a href=\"/news/software/security-software/device-guard-safeguards-windows-10-with-hardware-authentication-1291767\">Device Guard</a> for Windows 10, Good's TEE will also allow horizontal single sign-on. Once a user authenticates with the system, the user will automatically be signed on to other apps that are part of Good's suite. This suite includes over 1,600 partner and customer applications developed on the Good Dynamics Secure Mobility Platform. </p>", "<p>Someren and his team demonstrated horizontal single sign-on on an Android Kyocera smartphone. With Good's suite installed, a user would log into Good, and a user would also be logged on to connected apps, like Microsoft's Lync communication tool. </p>", "<p>In the past single sign-on across different third-party apps was not possible because it would expose the log-in credentials. This is no longer the case with TEE.</p>", "<p>TEE will be available to customers starting May.</p>"], "link": "http://www.techradar.com/news/software/business-software/good-delivers-smart-card-level-authentication-to-android-phones-1291786"},
{"category": ["mobileTablet"], "category2": ["business"], "author": ["By Leo Kelion"], "headline": ["Google launches Project Fi mobile phone network"], "image": ["http://ichef.bbci.co.uk/news/200/media/images/82499000/jpg/_82499524_b339bcb3-4e56-4278-9d1c-de23694f8e01.jpg"], "content": ["<p class=\"story-body__introduction\">Google has detailed its plan to run a mobile phone network in the US.</p>", "<p>The firm will rent voice and data capacity from two existing operators - Sprint and T-Mobile - and use existing wi-fi hotspots, rather than build new infrastructure from scratch.</p>", "<p>Initially, Project Fi will only be offered to Nexus 6 handset owners.</p>", "<p>Google Fiber, the firm's \"ultra-fast\" broadband service, is already seen as a disruptive force in the US telecoms market.</p>", "<p>It has been credited with encouraging Comcast and Time Warner Cable to offer their own customers speed boosts without higher prices.</p>", "<p>However, Fiber's roll-out involved Google buying infrastructure built by companies that had collapsed as well as laying its own fibre optic cables - giving it full control of the service.</p>", "<p>By contrast, one expert said running a mobile virtual network - which is dependent on rivals' equipment - might limit Project Fi's impact.</p>", "<p>\"The example of MVNOs in the US and elsewhere suggests that it's hard for their operators to dramatically change the industry because of their nature,\" said Ian Fogg from the IHS Technology consultancy.</p>", "<p>\"But the past isn't always a guide to the future. </p>", "<p>\"No-one would have thought that a handset manufacturer could transform the mobile industry by teaming up with one network - but that's what happened with Apple and AT&amp;T when the iPhone launched.</p>", "<p>\"And Google itself has repeatedly shown that it is capable of changing the direction of an industry by entering it.\"</p>", "<p>Examples of existing MVNOs include Tesco Mobile, GiffGaff, Red Pocket Mobile and Virgin Mobile.</p>", "<p>Sundar Pichai, chief of Google's Android platform, first mentioned the company's plan to create a phone network in February, but provided little detail at the time.</p>", "<p>The company has now revealed that its subscribers will be automatically switched between 4G signals provided by Sprint and T-Mobile, depending on whichever is stronger at the time.</p>", "<p>They will also be able to make calls over wi-fi without having to use a special app, similar in nature to the Wi-fi Calling facility recently introduced by EE in the UK.</p>", "<p>\"As you go about your day, Project Fi automatically connects you to more than a million free, open wi-fi hotspots we've verified as fast and reliable,\" <a href=\"http://googleblog.blogspot.co.uk/2015/04/project-fi.html\" class=\"story-body__link-external\">Google said on its blog</a>.</p>", "<p>\"Once you're connected, we help secure your data through encryption. When you're not on wi-fi, we move you between whichever of our partner networks is delivering the fastest speed, so you get 4G LTE in more places.\"</p>", "<p>When alternatives are not available, users will also be able to use 3G and 2G signals.</p>", "<p>Customers will only be billed for the amount of data they actually use, rather than having an allowance that resets every month, as is typical on existing services.</p>", "<p>The way this will work is that customers will pay a $20 (£13.30) monthly fee for unlimited calls and texts, an extra $10 for mobile data access while in the US and abroad, and then a further $10 for each gigabyte of data they decide to consume.</p>", "<p>\"Let's say you go with 3GB for $30 and only use 1.4GB one month. You'll get $16 back, so you only pay for what you use,\" the firm explained.</p>", "<p>\"This is Google dipping its toe in the water to see what it can do,\" said Chris Green from the Davies Murphy Group consultancy.</p>", "<p>\"It's a low-risk way to enter the market with its own branded service.</p>", "<p>\"Were it to later want to go deeper, it's probable that it would be via an acquisition, given the huge costs involved in building a network from scratch.\"</p>", "<p>The service will work with existing copies of the Nexus 6 handset, manufactured by Motorola, but will require a new Sim card.</p>", "<p>Google said the device's cellular radio had been deliberately designed to work across a wide range of 4G networks in the US and beyond, making it possible to switch between providers.</p>", "<p>Since changing networks will impact the phone's battery life, the firm said it would only move customers \"when absolutely necessary\".</p>", "<p>At this point Google said it had no plan to extend the scheme to other models and was limiting access to invitees.</p>", "<p><a href=\"http://www.wsj.com/articles/google-set-to-unveil-wireless-service-1429660082\" class=\"story-body__link-external\">According to the Wall Street Journal</a>, this may be because Sprint has reserved the right to renegotiate its deal if the service grows above a certain size.</p>", "<p>\"Google is taking an unusual technology approach by relying on its Sim card and a single handset to bind two 4G networks into one network offering,\" commented Mr Fogg.</p>", "<p>\"In other countries, consumers gain the same dual network benefits using any handset when two operators work together on network sharing or site sharing deals. </p>", "<p>\"Project Fi's focus on a usage-based data charging model will most benefit those consumers who use smaller amounts of data, not the enthusiasts who tend to own Nexus devices. </p>", "<p>\"For Project Fi to have significant impact, Google must widen the offering to support more smartphone models.\"</p>"], "link": "http://www.bbc.co.uk/news/technology-32422193#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa"},
{"category": ["socialMedia"], "category2": ["business"], "author": [], "headline": ["Facebook shares fall as higher costs squeeze profits"], "image": ["http://ichef.bbci.co.uk/news/200/media/images/82501000/jpg/_82501193_tv026481947.jpg"], "content": ["<p class=\"story-body__introduction\">Facebook shares fell 2% in after-hours trading on Wall Street after the company posted slower revenue growth, while research and development costs ate into profits.</p>", "<p>The social networking giant said profit in the first quarter of 2015 was $512m (£341m), down 20% on a year earlier.</p>", "<p>While revenue rose 42% to $3.5bn, that was slightly below analysts' forecasts.</p>", "<p>A bright spot was the rise in monthly active users, up 13% from a year earlier to 1.44 billion.</p>", "<p>Notably, for those investors concerned about the firm's efforts to appeal to younger users who access Facebook on their smartphones, monthly mobile users increased by 24% to 1.25 billion, a majority of the site's users.</p>", "<p>Facebook has been particularly adept at channelling that growing mobile user base into advertising dollars. The company said that during the quarter, revenue from mobile ad sales made up nearly three-quarters of total ad sales.</p>", "<p>\"This was a strong start to the year,\" said founder and chief executive Mark Zuckerberg <a href=\"http://investor.fb.com/releasedetail.cfm?ReleaseID=908022\" class=\"story-body__link-external\">in a statement</a>.</p>", "<p>Investors have been worried about slowing revenue growth, as well as increasing costs at the company. Facebook has been spending more on research and development as it moves beyond its original social networking operation.</p>", "<p>Spending on research and development jumped to $566m from $181m a year earlier.</p>", "<p>The company has warned that those costs are set to increase, as it looks to expand some of its acquisitions including photo-sharing site Instagram, messaging service WhatsApp, and virtual reality firm Oculus Rift.</p>", "<p>\"It's a generally solid quarter,\" said Macquarie Research analyst Ben Schachter. \"The trends are all going in the right direction. The cost rise is one thing that can derail this story.</p>", "<p>\"The question is, can they keep costs under control and what will be the new revenue streams around video, Instagram and virtual reality around Oculus?\"</p>"], "link": "http://www.bbc.co.uk/news/business-32424487#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa"},
{"category": ["mobileTablet"], "category2": ["hardware"], "author": [], "headline": ["Samsung S5 fingerprint flaw exposed"], "image": ["http://ichef.bbci.co.uk/news/200/media/images/82510000/jpg/_82510644_474668207.jpg"], "content": ["<p class=\"story-body__introduction\">Hackers can take copies of fingerprints used to unlock the Samsung Galaxy S5 phone, claim security researchers. </p>", "<p>A flaw in Android makes it possible to steal the personal information so it can be used elsewhere, said the experts from security firm FireEye.</p>", "<p>Other Android-based phones that also use fingerprint ID systems could also be vulnerable, they said.</p>", "<p>Samsung said it took security \"very seriously\" and was investigating the researchers' findings. </p>", "<p>Fingerprint ID systems are being used more and more in smartphones to unlock the devices or as a way to check who is authorising a transaction. Paypal and Apple already accept fingerprints as an ID check and a growing roster of firms that are members of the Fido Alliance are keen to use them in the same way to remove the need for passwords. </p>", "<p>Android phones typically store sensitive data such as fingerprint information in a walled-off area of memory known as the Trusted Zone. </p>", "<p>However, Yulong Zhang and Tao Wei found it was possible to grab identification data before it is locked away in the secure area. This method of stealing data was available on all phones running version 5.0 or older versions of Android provided the attacker got high level access to a phone. </p>", "<p>They also found that on Samsung Galaxy S5 phones, attackers did not need this deep access to a phone. Instead, they said, just getting access to the gadget's memory could reveal finger scan data. </p>", "<p>Using this information an attacker could make a fake lock screen that makes victims believe they are swiping to unlock a phone when they are actually authorising a payment. </p>", "<p>In addition, they found, it was possible for attackers to upload their own fingerprints as devices did not keep good records of how many prints were being used on each device. </p>", "<p>Mr Zhang and Mr Wei <a href=\"https://www.rsaconference.com/writable/presentations/file_upload/hta-f01-to-swipe-or-not-to-swipe-a-challenge-for-your-fingers_final.pdf\" class=\"story-body__link-external\">are due to present their findings at the RSA security conferenc</a>e in San Francisco on 24 April.</p>", "<p><a href=\"http://www.forbes.com/sites/thomasbrewster/2015/04/21/samsung-galaxy-s5-fingerprint-attacks/\" class=\"story-body__link-external\">In an interview with Forbes magazine</a>, Mr Zhang said the flaws they uncovered were likely to be widespread throughout handsets running Android 5.0 and below. Updating to the latest version of Android, version 5.1.1, should remove the vulnerabilities, he said.</p>", "<p>The flaw is the latest in a series of problems uncovered with fingerprint ID systems on phones. </p>", "<p>In April last year, hackers discovered a way to fool the print sensor on the S5 by taking a photograph of a print left on a smartphone screen, making a mould from the image and using that to make a replica fake finger. </p>", "<p>In 2013, a German hacker group used a similar method to bypass the fingerprint reader on Apple's iPhone 5. Hackers from the Chaos Computer Club used a picture of a person's fingerprint left on a glass surface to make a fake finger that unlocked the phone.</p>"], "link": "http://www.bbc.co.uk/news/technology-32429477#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa"},
{"category": ["business"], "category2": ["none"], "author": ["By Dan Simmons"], "headline": ["Tesco broadband offline for thousands across UK"], "image": ["http://ichef.bbci.co.uk/news/200/media/images/82462000/jpg/_82462401_images.jpg"], "content": ["<p class=\"story-body__introduction\">UPDATE: Tesco broadband has told the BBC its service is now back online and the problem \"was caused by a technical failure at a network level\".</p>", "<p>Tesco had said that its UK broadband service went down for thousands of customers across the country. </p>", "<p>The problem started at 12:00 BST on Tuesday. The firm said up to 10,000 of its 75,000 customers were without service across different areas of the UK.   </p>", "<p>Tesco is in the process of selling the business to Talk Talk during this year.</p>", "<p>An investigation is under way. At 17:30 BST the company suggested in its Twitter page that the \"search for the issue is narrowing\". </p>", "<p>\"Some customers are experiencing network problems. This is not related to the migration of customers to TalkTalk,\" it said in a statement.   </p>", "<p>\"We are liaising with our network partner [Vodafone] to get the issue resolved as quickly as possible and apologise to any customers affected for the inconvenience.\"</p>", "<p>It is the tenth network failure this month according to the company's Twitter page. Customers in London, the south east of England, and in the West Midlands have been affected in the last two weeks.  </p>", "<p>A Tesco spokesperson told the BBC:</p>", "<p>\"Tesco broadband uses its Twitter feed to update customers on all network outages as our customers have told us they find this very helpful.  </p>", "<p>\"This means that we report on any network problem even if just a handful of customers are experiencing issues.  </p>", "<p>\"Our fault rate is in line with the industry and we have high customer satisfaction ratings.\" </p>"], "link": "http://www.bbc.co.uk/news/technology-32395885#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa"},
{"category": ["business"], "category2": ["none"], "author": ["By Leo Kelion"], "headline": ["AdBlock Plus defeats German publishers in court"], "image": ["http://ichef.bbci.co.uk/news/200/media/images/82486000/jpg/_82486239_de01f640-f1ed-4355-af9e-1b36c407d7f3.jpg"], "content": ["<p class=\"story-body__introduction\">The creator of software that stops adverts from appearing on websites has defeated two news publishers that want to prevent its tech being used on their pages.</p>", "<p>The owners of Germany's Die Zeit and Handelsblatt had claimed that AdBlock Plus's product was anti-competitive and threatened their ability to make money.</p>", "<p>But a court in Hamburg ruled that users do have the right to use the plug-in.</p>", "<p>The judgement has implications for other disputes involving the tool.</p>", "<p>\"The Hamburg court decision is an important one because it sets a precedent that may help us avoid additional lawsuits and expenses defending what we feel is an obvious consumer right: giving people the ability to control their own screens by letting them block annoying ads and protect their privacy,\" wrote AdBlock Plus's <a href=\"https://adblockplus.org/blog/restating-the-obvious-adblocking-declared-legal\" class=\"story-body__link-external\">project manager, Ben Williams, on its blog</a>.</p>", "<p>\"Now that the legalities are out of the way, we want to reach out to other publishers and advertisers and content creators and encourage them to work with Adblock Plus rather than against us.\"</p>", "<p>However, the publishers have indicated that they intend to fight on.</p>", "<p>\"We are still convinced that AdBlock Plus is an illegal and anti-competitive practice,\" they said in a joint statement.</p>", "<p>\"It infringes the freedom of the press. Therefore, we will await the written reasons for the judgment, analyse them and examine the prospects of an appeals procedure.\"</p>", "<p>AdBlock Plus - which is owned by the Cologne-based firm Eyeo - faces three separate but related cases involving the media groups, ProSiebenSat.1, RTL Interactive and Axel Springer.</p>", "<p>The recent court case had contested the legality of AdBlock Plus's software suppressing adverts from the pages of the Zeit Online, Handelsblatt and Wirtschafts Woche news sites.</p>", "<p>Their publishers had sought damages, but said their motivation was to challenge the software provider's wider business model.</p>", "<p>\"We are, of course, questioning the offer [of] Adblock Plus in general,\" Ebba Schroder, a spokeswoman for Zeitverlag Gerd Bucerius told the BBC.</p>", "<p>While AdBlock Plus offers its web browser add-on to the public for free, it makes money by operating a \"white list\" of adverts that it allows to get through its filters.</p>", "<p>Such ads <a href=\"https://adblockplus.org/en/acceptable-ads#criteria\" class=\"story-body__link-external\">must meet certain criteria</a>, for instance they must not include animations or sounds and cannot be pop-ups that cover other content.</p>", "<p>Website operators that want ads on their site added to the white list must seek permission. </p>", "<p>Although AdBlock Plus states that \"no one can buy their way onto the white list\", it does charge fees for what it terms \"support services\", the details of which are not made public.</p>", "<p>In February, <a href=\"http://www.ft.com/cms/s/0/80a8ce54-a61d-11e4-9bd3-00144feab7de.html#axzz3Y2AGJ4r2\" class=\"story-body__link-external\">the Financial Times reported that one unnamed media company</a> had said it had been asked to pass on the equivalent of 30% of the extra revenues it would have made by having ads on its platform unblocked.</p>", "<p>That has led some critics to claim that <a href=\"http://daringfireball.net/linked/2015/02/02/adblock\" class=\"story-body__link-external\">the Eyeo is engaged in</a> a \"racket\".</p>", "<p>But the firm insists that term is \"imprecise and wrong\".</p>", "<p>It highlights that its service has proved popular with many users, with AdBlock Plus having been downloaded nearly 400 million times.</p>", "<p>It also notes that it does not charge fees to smaller businesses and blogs, and allows users to block its white-listed ads if desired.</p>", "<p>\"If we are racketeers we are terrible racketeers because 90% of the people on the white list don't pay anything and the criteria is the same for everyone,\" Mr Williams told the BBC.</p>", "<p>\"[The ruling] is living proof of the unalienable right of every user to enjoy online self-determination.\"</p>", "<p>However, one lawyer, who is not involved in the German cases, noted that other European courts might not necessarily take the same view.</p>", "<p>\"The Hamburg court based its decision on the provisions of EU Law... other national courts in EU member states must do likewise, but are not bound to reach the same legal conclusions,\" said Paul Henty from the law firm Charles Russell Speechlys.</p>", "<p>\"There could also be different factual or economic circumstances in those jurisdictions which lead to a different result.</p>", "<p>\"Nonetheless, the Hamburg judgment may be persuasive as an authority and will certainly be a boon to Eyeo in similar AdBlock disputes.\"</p>"], "link": "http://www.bbc.co.uk/news/technology-32409952#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa"},
{"category": ["socialMedia"], "category2": ["none"], "author": [], "headline": ["Twitter cyberbullies targeted with new anti-abuse tools"], "image": ["http://ichef.bbci.co.uk/news/200/media/images/82455000/jpg/_82455253_98f754d1-78d8-474a-aba8-ad10da5e6778.jpg"], "content": ["<p class=\"story-body__introduction\">Twitter is to act against a wider range of violent threats as part of renewed efforts to tackle abuse.</p>", "<p>The social network has acknowledged that its previous rules, which said a threat needed to be \"direct\" and \"specific\" to justify its intervention, had been too \"narrow\".</p>", "<p>The firm will still require a complaint to be made before it blocks an account.</p>", "<p>But it said it was also attempting to automatically make a wider range of abusive tweets less prominent.</p>", "<p>Its actions follow a series of high-profile cyberbullying incidents.</p>", "<p>Earlier this month, TV host Sue Perkins stopped posting to Twitter <a href=\"https://twitter.com/sueperkins/status/587925767520133120\" class=\"story-body__link-external\">after reporting that her timeline was</a> \"full of blokes wishing me dead\", following false claims that she was to present the TV show Top Gear.</p>", "<p>Shaun Himmerick, producer of the video game Mortal Kombat X, also recently stopped using the network after he said users <a href=\"https://twitter.com/lover_of_tacos/status/581469843255209986\" class=\"story-body__link-external\">had threatened his wife and daughter</a>.</p>", "<p>The problem is not limited to Twitter - in March, a study of 1,000 UK-based 13-to-17-year-olds by broadband provider Europasat indicated that nearly half of those surveyed had been sent abusive messages over the internet.</p>", "<p>But in February, Twitter's chief executive Dick Costolo highlighted the issue when he sent a memo to staff telling them that \"we suck at dealing with abuse and trolls on the platform and we've sucked at it for years\".</p>", "<p>Twitter's rules now state that it may act after being alerted to tweets that contain \"threats of violence against others or promote violence against others\".</p>", "<p>By making its criteria more vague than before, the platform can now intervene if, for example, someone says that a victim ought to be beaten up.</p>", "<p>It had previously required the aggressor to have provided specific details, such as the fact they planned to commit the act using a baseball bat at the victim's place of work, before it would respond.</p>", "<p>\"Our previous policy was unduly narrow, and limited our ability to act on certain kinds of threatening behaviour,\" wrote Shreyas Doshi, Twitter's director of product management, on the firm's blog.</p>", "<p>\"The updated language better describes the range of prohibited content and our intention to act when users step over the line into abuse.\"</p>", "<p>In addition, Twitter will begin freezing some abusers' accounts for set amounts of time, allowing those affected to see the remaining duration via its app. Abusers may also be required to verify their phone number and delete all their previous offending tweets in order to get their account unlocked.</p>", "<p>The firm said it could use this facility to calm situations in which a person or organisation came under attack from several people at once, where it might not be appropriate to enforce permanent bans on all involved.</p>", "<p>While such decisions would be taken by Twitter's staff, the company said it had also started using software to identify tweets that might be abusive, based on \"a wide range of signals and context\".</p>", "<p>Such posts will be prevented from appearing in people's feeds without ever having been checked by a human being. However, they will still show up in searches and remain subject to the existing complaints procedure.</p>", "<p>A side-effect of this could be that some abusive tweets become harder to detect.</p>", "<p>But the UK Safer Internet Centre, which represents a number of campaign bodies, welcomed the move.</p>", "<p>\"These are really good steps,\" said Laura Higgins, the organisation's online safety operations manager.</p>", "<p>\"Regrettably some people might fall foul of bad behaviour before [Twitter] can put some of these safeguards in place, but at least it is always looking for new solutions.</p>", "<p>\"In cases when there is massive amounts of abuse and it's all of a similar theme, I think [the new system] will be good at picking it up, and that's great. But it would be good to hear what will happen to that data once Twitter has it.\"</p>", "<p>The announcements build on other recent changes made by Twitter, <a href=\"https://blog.twitter.com/2015/update-on-user-safety-features\" class=\"story-body__link-external\">including hiring more workers to handle abuse reports</a> and letting third-parties flag abuse.</p>", "<p>The firm had originally required victims to file complaints themselves before it would act.</p>"], "link": "http://www.bbc.co.uk/news/technology-32392811#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa"},
{"category": ["business"], "category2": ["none"], "author": [], "headline": ["HBO Now users outside US to be 'cut off'"], "image": ["http://ichef.bbci.co.uk/news/200/media/images/82307000/jpg/_82307130_gameofthrones1.jpg"], "content": ["<p class=\"story-body__introduction\">Pay TV service HBO is threatening to cut off paying customers of its Now service if they are outside the US.</p>", "<p>It has sent emails to people around the world it has detected are using software tools to watch HBO Now shows.</p>", "<p>HBO said it took the action because it only has the right to broadcast shows in the US and to people living in the country.</p>", "<p>Email messages were sent to people in Canada, the UK, Germany and Australia, <a href=\"http://torrentfreak.com/hbo-cracks-down-on-paying-vpn-pirates-150420/\" class=\"story-body__link-external\">reported tech news site Torrent Freak</a>.</p>", "<p>HBO Now was introduced as a way for people to watch HBO's programmes without the need to have a subscription to a television or cable service. HBO Now costs $14.99 (£9.50) a month. </p>", "<p>However, many people living in other nations have subscribed to HBO Now and used a variety of tools, including virtual private networks (VPNs), to get around the restrictions designed to stop people outside the US seeing popular shows such as Game of Thrones. </p>", "<p>In some countries, the cost of an HBO Now subscription was far lower than the price of buying a service from a native cable TV provider. The Sydney Morning Herald pointed out that watching HD versions of Game of Thrones in Australia via means other than HBO Now would cost more than 660 Australian dollars (£342).</p>", "<p>Earlier this week, HBO started sending emails to many people who use region-unlocking tricks and tools. The messages warned them that they would be cut off on 21 April if they did not contact HBO and satisfy it that they were eligible to watch the service. </p>", "<p>Those who did not contact HBO would be cut off without further notice, said the company. </p>", "<p>Earlier this year, Netflix started to take action against some VPN users and changed how its Android app worked in a bid to thwart some of those using software tools to defeat region locks. </p>", "<p>Netflix boss Reed Hastings said earlier this week that VPN users were \"less bad\" than pirates because they were at least paying for the service. His comments came during press interviews discussing the company's financial results.</p>"], "link": "http://www.bbc.co.uk/news/technology-32392639#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa"},
{"category": ["software"], "category2": ["none"], "author": [], "headline": ["Disney video-dubbing software makes people speak gibberish"], "image": ["http://ichef.bbci.co.uk/news/200/media/images/82493000/jpg/_82493670_55f086f9-1212-4f5e-81dc-f5a07484f871.jpg"], "content": ["<p class=\"story-body__introduction\">Disney has developed software that automatically redubs video clips with new words that fit the speaker's lip movements.</p>", "<p>The program works by tracking variations in the shape of a subject's mouth and jaw, and then searching a pronunciation dictionary to find alternative words that match the moves.</p>", "<p>The firm says it can \"literally put plausible words\" into a person's mouth.</p>", "<p>But for now, the examples it has produced are of limited use.</p>", "<p><a href=\"https://www.youtube.com/watch?v=Kt9_1eyQE38\" class=\"story-body__link-external\">A video posted to YouTube</a> shows an actor saying the short phrase \"salary and tenure\".</p>", "<p>The software identifies thousands of alternative phrases that could replace the utterance based on factors such as when the lips open to enunciate a vowel or close to express certain types of consonants.</p>", "<p>The program then ranks the strings of words according to the likelihood they would appear in that order in normal speech. This prevents it using ungrammatical phrases.</p>", "<p>A voice synthesiser subsequently creates some of the highly ranked phrases, ensuring each bit of sound - known as a phoneme - is timed to coincide with the appropriate lip movements. This is then used to replace the original sound.</p>", "<p>Examples of the replacement expressions created include:</p>", "<p>The system appears to have limitations.</p>", "<p>The actor involved had to be asked to keep the position of his head as still as possible and speak in a neutral tone to get the best results.</p>", "<p>And even with the ranking mechanism, many of the generated phrases appear to be gibberish.</p>", "<p>Disney's researchers acknowledge that the primary application of speech redubbing is to translate films and television programmes from one language to another. </p>", "<p>And it seems unlikely that the system could be used to find enough suitable matching phrases to re-voice a complete film or programme imperceptibly.</p>", "<p>However, it could potentially be used for more gimmicky applications.</p>", "<p>One YouTube video maker, for example, <a href=\"https://www.youtube.com/user/BadLipReading\" class=\"story-body__link-external\">already specialises in making clips that replace the voices of well-known personalities</a> with deliberately ridiculous lip-synched utterances for comedic effect. </p>", "<p>His creations include Beyonce singing nonsensically at US President Barack Obama's inauguration ceremony and a version of Game Of Thrones where the characters appear to believe they are working in a theme park, both of which have been watched millions of times.</p>", "<p>Patrick Walker, chief executive of the viral video distribution network Rightster, noted that an existing app called Dubsmash had become popular by letting users replace their own voices in self-made videos with well-known quotes and sounds from films and songs.</p>", "<p>\"Putting these kinds of tools in the hand of creators is the most important thing,\" he told the BBC.</p>", "<p>\"If there was some way in which friends could get together and create their own versions of licensed clips from the Disney archive that would be interesting.</p>", "<p>\"The other alternative would be a kind of 'lip synch roulette', in which you would say a phrase and then the app would fit it to a video clip from a database that it thought best matched. That would be cool and those clips could go viral.\"</p>", "<p>For its part, Disney's research team <a href=\"http://www.disneyresearch.com/publication/a-mouth-full-of-words-visually-consistent-acoustic-redubbing/\" class=\"story-body__link-external\">says the most interesting insight</a> from its work is the \"extreme level of ambiguity\" involved in trying to carry out speech recognition based on visual information alone.</p>"], "link": "http://www.bbc.co.uk/news/technology-32416031#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa"},
{"category": ["business"], "category2": ["none"], "author": ["By Dan Simmons"], "headline": ["Uber drivers accused of turning away guide dogs"], "image": ["http://ichef.bbci.co.uk/news/200/media/images/82455000/jpg/_82455760_92628585.jpg"], "content": ["<p class=\"story-body__introduction\">The ride-sharing firm, Uber is being taken to court over allegations that its drivers are discriminating against people with visual impairment. </p>", "<p>The National Federation for the Blind of California is one of those bringing the case which cites at least 40 instances where drivers have refused to carry guide dogs. </p>", "<p>Uber said drivers are told to comply with all laws relating to the carriage of service animals.</p>", "<p>It said the claims have no merit. </p>", "<p>The case against Uber includes two instances in which Uber drivers allegedly yelled \"no dogs\" at riders. </p>", "<p>In another instance an Uber driver allegedly refused a blind woman's plea to pull over once she realised the driver had locked her guide dog in the boot of his car.</p>", "<p>Aaron Zisser, a lawyer for Disability Rights Advocates in Berkeley, California, which helped bring the case, said: </p>", "<p>\"Uber is a very popular service, and it is important for riders with service animals to be able to use it like anyone else,\"</p>", "<p>Uber supervises drivers who wish to use their own private vehicles to offer a taxi-like service and who use the company to find potential passengers. </p>", "<p>It had argued that the case should not be allowed to be brought by a group of individuals and institutions but rather that each should seek arbitration separately. </p>", "<p>It added that it was \"on the cutting edge of expanding accessibility\" for the disabled. </p>", "<p>But US Judge Nathanael Cousins has allowed the case to be heard and gave Uber until 2 May to formally respond to the complaint. </p>", "<p>James White from UK charity, Guide Dogs, said dogs being refused transit is a significant problem in the UK. </p>", "<p>\"Far too often we hear about guide dog owners being refused access to taxis. </p>", "<p>\"This is extremely upsetting, embarrassing and frustrating for the person involved.  </p>", "<p>\"Such discrimination can prevent people with guide dogs from getting out and about with confidence. </p>", "<p>\"Without the appropriate legal exception it is a criminal offence for minicabs and taxis to refuse a passenger who is accompanied by an assistance dog.\"</p>", "<p>The UK's Royal National Institute of Blind People added that taxi drivers had very few circumstances where they could refuse carriage: </p>", "<p>\"In the UK .. taxi and private hire drivers have to carry guide dogs and assistance dogs at no extra cost to the passenger.\" </p>", "<p>\"Drivers who have a medical condition that means they are unable to assist passengers or carry dogs in their vehicle may apply for an exemption from these duties.\"</p>", "<p>The case is the latest lawsuit of many faced by Uber globally. </p>", "<p>Last week a Berlin court upheld a decision taken last summer to ban Uber from operating because its drivers did not comply with public insurance requirements. </p>", "<p>The question for Uber and the courts in many of these cases is to what degree liability for complying with local laws should rest with Uber and how much drivers using the service to find passengers should be responsible for. </p>"], "link": "http://www.bbc.co.uk/news/technology-32395883#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa"},
{"category": ["business"], "category2": ["none"], "author": [], "headline": ["Yahoo profits plunge adds to post-Alibaba worries"], "image": ["http://ichef.bbci.co.uk/news/200/media/images/82473000/jpg/_82473712_493360991.jpg"], "content": ["<p class=\"story-body__introduction\">Internet search giant Yahoo has reported worse-than-expected profits for the first three months of this year, adding to investor concern.</p>", "<p>The company said it earned $21m (£14m) in the first quarter, compared with $312m a year earlier.</p>", "<p>Although revenue from the company's mobile offerings increased by 61%, overall revenue from operations was $1.04bn, below expectations.</p>", "<p><a href=\"http://www.bbc.co.uk/news/business/market_data/shares/4/112810/one_month.stm\" class=\"story-body__link\">Shares in the firm</a> fell nearly 2% in trading after markets closed.</p>", "<p>\"Yahoo is amidst a multi-year transformation to return an iconic company to greatness,\" said chief executive Marissa Mayer in a statement accompanying the earnings.</p>", "<p>Investors are concerned about how the company will continue to generate revenue once it spins off its 15% stake in Chinese e-commerce giant Alibaba.</p>", "<p>Ms Mayer highlighted a re-negotiated contract with Microsoft as a potential area of new growth.</p>", "<p>She also said the company's partnership with search engine Mozilla had led to increased search traffic.</p>"], "link": "http://www.bbc.co.uk/news/business-32406831#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa"},
{"category": ["hardware"], "category2": ["none"], "author": [], "headline": ["Enraged US man shoots his malfunctioning computer"], "image": ["http://ichef.bbci.co.uk/news/200/media/images/82475000/jpg/_82475463_82475462.jpg"], "content": ["<p class=\"story-body__introduction\">A man in the US city of Colorado Springs faces police action after becoming so frustrated with his computer that he took it outside and shot it eight times, police say.</p>", "<p>\"He was having technology problems, so he took it to the back alley and destroyed it,\" a police spokesman said.</p>", "<p>Lucas Hinch was briefly detained for discharging a firearm within the city.</p>", "<p>He did not realise he was breaking the law when he went \"Wild West\" on his machine, local media reported.</p>", "<p>A judge is due to decide what penalty he will receive.</p>", "<p>\"He got tired of fighting with his computer for the last several months,\" police spokesman Jeff Strossner told the <a href=\"http://gazette.com/man-kills-computer-in-colorado-springs-alley-gets-revenge-he-wanted-and-a-citation/article/1550042\" class=\"story-body__link-external\">Colorado Springs Gazette</a>.</p>", "<p>The paper said that Mr Hinch \"shot the darn thing\" when ctrl+alt+delete - the traditional method used to re-boot computers - \"consistently did not work\" on Monday evening.</p>", "<p>\"He was able to wreak the kind of revenge most of us only dream about,\" the paper said. \"The computer is not expected to recover.\"</p>"], "link": "http://www.bbc.co.uk/news/world-us-canada-32407688#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa"},
{"category": ["mobileTablet"], "category2": ["none"], "author": [], "headline": ["Google’s 'mobilegeddon'"], "image": ["http://ichef.bbci.co.uk/news/200/media/images/82452000/jpg/_82452160_thinkstock_google.jpg"], "content": ["<p class=\"story-body__introduction\">If your business depends on people finding your website, then this will be an anxious day for you. </p>", "<p>Google is making changes to the way its search engine ranks sites, and that could send some hurtling down the rankings.</p>", "<p>Of course, the company tweaks its algorithm on a daily basis as it battles with Search Engine Optimisation (SEO) specialists who try to game the system on behalf of their clients. </p>", "<p>But this is a big change - dubbed \"mobilegeddon\" by some - designed to favour sites that are optimised for the mobile internet. </p>", "<p>Google gave plenty of warning, telling developers about the change in a blog post in February and providing a simple tool to check whether sites were <a href=\"http://www.google.com/webmasters/tools/mobile-friendly/\" class=\"story-body__link-external\">mobile friendly</a>. </p>", "<p>The search firm is trying to reassure website owners that this won't be an earthquake which turns their businesses upside down but quite a subtle evolution. </p>", "<p>But SEO specialists say this looks like the biggest change since 2011 - and for some that will unearth some unpleasant memories.</p>", "<p>For any online retailer, appearing on page one of Google's search results can make all the difference between a profitable business and one heading for the scrapyard. </p>", "<p>Just ask Jenny Hurren, owner of a furniture retailer called Out There Interiors which sells its products exclusively online.  </p>", "<p>Search Google for \"mirrored furniture\" and her site pops up on page one - though made somewhat less obvious by the paid ads and the Google shopping box, which Jenny says is far too expensive for her. </p>", "<p>But in 2011 when Google released the Panda update to its search engine, disaster struck. </p>", "<p>\"We went from having page one positions, to being nowhere or page six or seven,\" she remembers. </p>", "<p>\"It had a massive impact, we almost lost the business because of that algorithm change.\"</p>", "<p>Since then, she has tried to depend less on crude SEO techniques, more on the kind of PR which will get the firm linked to from high-quality sources, and so boost its search ranking.  </p>", "<p>Now she is not so worried about the latest change because the work has been done to make the site mobile friendly.</p>", "<p>\"It should be good for us - our site is ready, many of our competitors aren't.\" </p>", "<p>But Jenny says she's also learned a key lesson - not to be so completely dependent on Google searches for her business.</p>", "<p>My next search was for something specialist - \"buy outsize shoes\". </p>", "<p>A quick check of the sites on the first results page seemed to show that most would pass Google's mobile test. </p>", "<p>But when I contacted a firm called Magnus Shoes, the owner Simon Drinkwater admitted that he had been a little concerned when he heard about the latest Google update. </p>", "<p>\"We are just in the middle of upgrading to a mobile-friendly site,\" he told me.</p>", "<p>I ran a check on another page of his site and found that, yes, Google was listing it as \"not mobile friendly\", with the text too small and the links too close together to be comfortably read on a phone.</p>", "<p>Mr Drinkwater said he would be concerned if the site slipped off page one of the search results, but didn't think it would have life-threatening consequences for a business which, unlike Out There Interiors, was not born on the internet. </p>", "<p>\"We've got thousands of loyal customers who know where we are.\" </p>", "<p>Still, he concedes that winning new customers would be very hard without a prominent position in a search for outsize shoes.</p>", "<p>Google's move to make mobile capabilities more important in search rankings seems eminently sensible as our phones become the key route to finding goods and services online. </p>", "<p>But over the next few weeks we can expect cries of pain from those whom the all-powerful search algorithm has deemed less worthy. </p>", "<p>And, coming just days after the European Commission accused Google of abusing its dominance, it will be another illustration of just how important a role the Californian company plays in every corner of the global economy.</p>"], "link": "http://www.bbc.co.uk/news/technology-32393050#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa"},
{"category": ["business"], "category2": ["none"], "author": ["By Jane Wakefield"], "headline": ["Can paper survive the digital age?"], "image": ["http://ichef.bbci.co.uk/news/200/media/images/82034000/jpg/_82034753_paper.jpg"], "content": ["<p class=\"story-body__introduction\">The phrase 'paperless office' was coined way back in the 1970s, when commentators, buoyed by the exciting potential offered by technology, predicted that all record handling would be purely electronic by the 1990s.</p>", "<p>But, as the above picture of my desk demonstrates - we are still a long way off.</p>", "<p>Partly that is down to cost - it is a whole lot cheaper to give employees a piece of paper than an electronic device - and the cloud storage that many companies are adopting can also have high costs.</p>", "<p>But on a more visceral level, there is something quite comforting about paper. </p>", "<p>\"When the act of writing takes on a personal dimension, that's when paper and handwriting is superior to typing on a keypad,\" said Arrigo Berni, chief executive of Italian notebook maker Moleskine.</p>", "<p>Moleskine was recently at Ted (the technology, entertainment and design conference) in Vancouver, talking up the benefits of paper and keen to show how it can live side by side with digital alternatives.</p>", "<p>The company may at first seem like an unlikely bedfellow for the conference known for its cutting-edge tech demos.</p>", "<p>But the notebook has become a staple of the conference - given away in the famous Ted gift bag and often used by delegates for note-taking during its 18-minute Ted talks.</p>", "<p>As Mr Berni pointed out, everyone needs to make notes and, at a conference whose tagline is 'ideas worth spreading', there is certainly no shortage of scribbling.</p>", "<p>\"Paper will always be around. It helps express a fundamental part of human experience,\" he said.</p>", "<p>But, he acknowledged, paper does face competition from digital tools.</p>", "<p>To address this Moleskine has formed partnerships with firms such as Adobe and Livescribe, a provider of electronically-enabled pens.</p>", "<p>In 2012 it hooked up with Evernote to create a paper-digital hybrid notebook.</p>", "<p>Evernote, the quintessential Silicon Valley start-up that promised to digitise our productivity, now has 100 million users.</p>", "<p>Its partnership with Moleskine created smart notebooks which mean users can photograph their paper notes and place them in Evernote's app where they become catalogued, searchable digital content. </p>", "<p>The notebooks have a special layout to make it easy to capture handwriting while smart stickers allow users to sort and search the notes.</p>", "<p>Smart notebooks offer to bridge the physical and digital worlds as part of an increasing move to eliminate the waste and confusion that piles of paper creates.</p>", "<p>And our paperless journey does not end there. </p>", "<p>Look around you on your next commuter journey and far fewer people are negotiating unwieldy newspapers - opting instead to read their news via a smartphone or tablet.</p>", "<p>Get off the train and the sea of commuters are much more likely to flow through the barriers with the swipe of a smartcard or credit card, while paper tickets are becoming a rarity at airports too.</p>", "<p>Even our interactions with government are taking a decidedly digital turn, with the UK government scrapping the paper car tax disc and people now routinely filling in tax returns electronically.</p>", "<p>According to the American Forest and Paper Association, total US paper shipments decreased by 5% in February, compared to the same time last year while anecdotal data suggests that we use a third less paper than 20 years ago.</p>", "<p>Despite this, the industry remains pretty healthy - last year the US produced about 21 million tons of paper - equivalent to between 55 to 110 million trees, according to some estimates.</p>", "<p>And in offices, paper remains a key tool. According to sustainability charity Wrap (Waste and Resources Action Programme), the average office worker uses up to 45 sheets of paper per day, of which over half is considered waste while office productivity firm Iron Mountain estimates that only a paltry 1% of offices are truly paperless.</p>", "<p>\"Paper is declining slowly, but the sky is not going to fall in any time soon,\" said Mick Heys, an analyst at research firm IDC.</p>", "<p>\"I now board a plane by showing an electronic ticket on my phone, but I still have a paper passport and that document is going to take a while to replace.\"</p>", "<p>Offices are making incremental steps towards reducing their paper loads - and even something as simple as a print management system, which will cancel jobs not printed overnight or restrict how many emails can be printed out, can reduce paper use by up to 20%, according to Mr Heys.</p>", "<p>\"But paper remains better for some things and people like it. Studies have shown that learning from a screen activates a different part of the brain to learning from paper,\" he added.</p>", "<p>So it seems paper will be with us for a while longer - which, if nothing else, will probably please a generation of bored schoolchildren for whom the humble paper aeroplane can still provide some much-needed distraction.</p>"], "link": "http://www.bbc.co.uk/news/technology-32130647#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa"},
{"category": ["business"], "category2": ["none"], "author": ["By Matthew Wall"], "headline": ["Wikipedia editing rules in a nutshell"], "image": ["http://ichef.bbci.co.uk/news/200/media/images/82486000/jpg/_82486625_137262871.jpg"], "content": ["<p class=\"story-body__introduction\">In the wake of a <a href=\"http://www.bbc.co.uk/news/election-2015-32407991\" class=\"story-body__link\">Wikipedia row between the Guardian and Conservative Party chairman Grant Shapps</a>, what are the editorial rules governing this massively popular online encyclopaedia?</p>", "<p>Don't pretend you don't know. It's the not-for-profit multilingual online encyclopaedia co-founded by Jimmy Wales and supported by the Wikimedia Foundation. The English-language version of the Wiki contains nearly five million articles and has an estimated 25 million users.</p>", "<p>Anyone can - it's open to all and can be modified and edited by anyone. However, Wikipedia's administrators protect some pages from direct editing if they believe they are regularly subjected to \"vandalism\" - the addition of abusive language or falsehoods.</p>", "<p>Wikipedia is self-policing and relies on its community of volunteer editors to improve the quality and accuracy of the pages over time. It's the \"wisdom of crowds\" principle in action. Writers are encouraged to back up factual statements with verifiable references and authoritative sources as often as possible.</p>", "<p>Wikipedia has rules - lots of rules. One obvious one is not being dishonest. Another is avoiding opinion and sticking to verifiable facts. But it is possible to set up a user account with a pseudonymous username to allow you to edit anonymously. However, using anonymous accounts for blatant misrepresentation and puffery - known as sock puppetry - is often spotted and the offending content challenged or removed by other editors. </p>", "<p>Blatant self-promotion is frowned upon by the community and viewed as a conflict of interest. Anyway, as you don't control the page, less flattering information may soon be added by others. But examples of Wikispam, as it's sometimes called, are \"speedily deleted\" according to the website.</p>", "<p>You don't need to log in to the site to read or edit articles, but setting up an account and registering allows you to create your own pages, upload content and edit without your internet protocol (IP) address - the number that identifies a mobile phone or computer on a network - being visible to the public.</p>", "<p>The 1,300-or-so Wiki administrators can usually identify the IP address of someone editing articles, and this can be tracked to a rough location, enabling them to spot suspicious patterns of behaviour. Offending accounts can be suspended, without individuals necessarily being identified. </p>", "<p>Er... yes. If the IP address is different - you use a different computer or phone than the one you used before and, if you're being really sneaky, move location to do your editing - there's no reason why you can't set up another anonymous account and carry on as before. And there are plenty of services allowing internet users to hide their IP addresses anyway, for example, by using an encrypted virtual private network. </p>", "<p>Someone going to great lengths to hide their IP address is sometimes enough to arouse suspicion amongst the site's administrators. And patterns of behaviour - from the adoption of similar usernames to a focus on specific topics and types of edit - can reveal a lot about motivations and personality. Multiple accounts can often be tracked to one individual - we're never as anonymous as we like to believe. But any open and collaborative system will always be open to abuse.</p>"], "link": "http://www.bbc.co.uk/news/technology-32412121#sa-ns_mchannel=rss&ns_source=PublicRSS20-sa"},
{"category": ["software"], "category2": ["none"], "author": [], "headline": ["Human Embryo Genomes Edited For First Time"], "image": ["http://media.skynews.com/media/images/generated/2015/4/23/386541/default/v1/gettyimages-2973545-1-362x204.jpg"], "content": ["<p class=\"story__intro\">Chinese scientists have edited the genomes of human embryos - the first time this procedure has been carried out.</p>", "<p>Their announcement confirms widespread rumours that such experiments had been taking place and is likely to reignite the ethical debate surrounding the issue.</p>", "<p>Gene-function researcher Junjiu Huang, from Sun Yat-sen University in Guangzhou, used \"non-viable\" embryos - which cannot be used in a live birth - from local fertility clinics.</p>", "<p>The team tried to edit the gene responsible for a potentially fatal blood disorder using a gene-editing technique known as CRISPR.</p>", "<p>The technique has already been successfully used on cows, pigs and monkeys.</p>", "<p>But the experiment on human embryos was only partially successful - of the 86 embryos injected, only a fraction contained the replacement genetic material.</p>", "<p>In some of the embryos, the gene editing caused unintended mutations in other genes.</p>", "<p>Mr Junjiu said: \"If you want to do it in normal embryos, you need to be close to 100%.</p>", "<p>\"That’s why we stopped. We still think it’s too immature.\"</p>", "<p>The aim of gene editing is to eradicate genetic diseases before a baby is born.</p>", "<p>But opponents believe it may cross an ethical line.</p>", "<p>Scientists Edward Lanphier told the Nature journal: \"It underlines what we said before: we need to pause this research and make sure we have a broad based discussion about which direction we’re going here.\"</p>"], "link": "http://news.sky.com/story/1470606/human-embryo-genomes-edited-for-first-time"},
{"category": ["mobileTablet"], "category2": ["business"], "author": [], "headline": ["Google Launches Its Own Mobile Phone Network"], "image": ["http://media.skynews.com/media/images/generated/2013/5/16/238173/default/v2/google-sign-1-362x204.jpg"], "content": ["<p class=\"story__intro\">Google is launching its own mobile phone network in the US called Project Fi.</p>", "<p>Subscribers will pay a base fee of $20 (£13.30) a month which will cover unlimited domestic voice calling and texting.</p>", "<p>Data will cost $10 (£6.60) per gigabyte per month, and users will only be charged for what they use. Refunds will be issued for any unused data, the firm says.</p>", "<p>At first, only owners of the Nexus 6 smartphone will be able to sign up to the network.</p>", "<p>Google is renting the voice and data capacity from Sprint and T-Mobile, and will use existing Wi-Fi hotspots to provide the data service.</p>", "<p>Users will be switched between the networks depending on signal strength.</p>", "<p>The idea of a Google-created phone network was first publicly mentioned in February, by Android executive Sundar Pichai, but little detail was provided.</p>", "<p>Google wrote on its blog this week: \"As you go about your day, Project Fi automatically connects you to more than a million free, open wi-fi hotspots we've verified as fast and reliable.</p>", "<p>\"Once you're connected, we help secure your data through encryption. When you're not on wi-fi, we move you between whichever of our partner networks is delivering the fastest speed, so you get 4G LTE in more places.\"</p>", "<p>Sprint reportedly has the right to renegotiate the deal if the popularity of the service grows above a certain size.</p>", "<p> </p>"], "link": "http://news.sky.com/story/1470721/google-launches-its-own-mobile-phone-network"},
{"category": ["software"], "category2": ["none"], "author": [], "headline": ["FBI Warning Over Plane Wi-Fi Hacking Risk"], "image": ["http://media.skynews.com/media/images/generated/2014/12/20/357866/default/v2/cockpit-1-362x204.jpg"], "content": ["<p class=\"story__intro\">The FBI has issued an alert to airlines to look for evidence of passengers attempting to use on-board Wi-Fi networks to access the plane's controls.</p>", "<p>It says there is no evidence to support claims that an attacker could take control of a plane's navigation system through the passenger Wi-Fi network, but says claims that it is possible are being taken seriously.</p>", "<p>The alert was posted to the FBI's InfraGrad site and asks airline staff to be on guard.</p>", "<p>It said: \"Although the media claims remain theoretical and unproven, the media publicity associated with these statements may encourage actors to use the described intrusion methods.</p>", "<p>\"Attempting to gain unauthorised access to the on-board networks of a commercial aircraft violates federal law.\"</p>", "<p>It comes after a security researcher was banned by United Airlines for tweeting that its on-board communications systems could be hacked.</p>", "<p>Chris Roberts said he was repeatedly able to connect his laptop to a box under his seat during a flight, which allowed him to view data from the aircraft's engines, fuel and flight-management systems.</p>", "<p>Last week the US Government Accountability Office said some commercial aircraft may be vulnerable to hacking over their onboard wireless networks.</p>"], "link": "http://news.sky.com/story/1469914/fbi-warning-over-plane-wi-fi-hacking-risk"},
{"category": ["business"], "category2": ["none"], "author": ["By Tom Cheshire, Technology Correspondent"], "headline": ["To Catch A Sock Puppet: Exposing Web Frauds"], "image": ["http://media.skynews.com/media/images/generated/2012/9/7/191812/default/v1/rtr2xolk-1-362x204.jpg"], "content": ["<p class=\"story__byline\">By Tom Cheshire, Technology Correspondent</p>", "<p class=\"story__intro\">As the famous New Yorker cartoon put it: on the internet, no ones knows you're a dog. Or Tory chairman Grant Shapps (allegedly).</p>", "<p>Pretending to be someone else is a practice as old as the internet itself, dating back at least to 1993 and the days of Usenet.</p>", "<p><strong><a href=\"http://jargon-file.org/archive/jargon-4.1.0.dos.txt\">Jargon File</a></strong>, a dictionary of computer programming slang, defined sock puppetry: \"In Usenet parlance, a pseudo through which the puppeteer posts follow-ups to their own original message to give the appearance that a number of people support the views held in the original message.\"</p>", "<p>It also has the helpful etymology: \"From the act of placing a sock over your hand and talking to it and pretending it's talking back.\"</p>", "<p>Sock puppetry existed before the internet - Walt Whitman was outed as writing anonymous reviews of his own work in 1855.</p>", "<p>As the newspaper Daily Times wrote: \"This rowdy knight-errant who tilts against all lies and shams, himself perpetrates a lie and a sham at the very outset of his career.\"</p>", "<p>But sock puppetry really flourished online, where anyone can contribute their own anonymous reviews.</p>", "<p>It should also be differentiated from other online forms of impersonation, such as the catfish, who does more or less the same thing, but to trick people into love.</p>", "<p>In 2010, historian Orlando Figes wrote several pseudonymous reviews on Amazon taking his rivals down a peg, at the same time as praising his own work.</p>", "<p>He was caught out by the Times Literary Supplement, which spotted that the username - \"orlando-birkbeck\" - might have something to do with Figes, a professor at Birkbeck University of London.</p>", "<p>He initially blamed his wife, but nobly took full responsibility a couple of days later. \"I was under intense pressure … I have made some foolish errors.\"</p>", "<p>That pattern - get caught out, deny, blame someone else, admit everything, blame extenuating circumstances - tends to repeat.</p>", "<p>On Wikipedia, Johann Hari used the alias David Rose to praise his own work and to attack his own opponents, calling one anti-Semitic and another a drunk.</p>", "<p>The accusations first began in 2005; Hari denied the claim, but eventually apologised in 2011.</p>", "<p>So how do you catch a sock puppet? Well, inevitably, Wikipedia has a <a href=\"https://en.wikipedia.org/wiki/Wikipedia:Signs_of_sock_puppetry\"><strong>useful article on the subject</strong></a>.</p>", "<p>Warning signs include similar usernames, excessive support for one's cause, editing identical articles, uncivil editing , planned vandalism and a fictitious personality. Naturally.</p>", "<p>The article adds: \"Still, none of the signs are particularly clear, and the only definitive proof is an actual admission.\"</p>", "<p>And that's certainly not what we’ll see from Grant Shapps, <a href=\"http://news.sky.com/story/1469598/shapps-denies-editing-rivals-wikipedia-pages\"><strong>who strongly denies the allegation</strong></a>.</p>"], "link": "http://news.sky.com/story/1469968/to-catch-a-sock-puppet-exposing-web-frauds"},
{"category": ["business"], "category2": ["socialMedia"], "author": [], "headline": ["Facebook Revenue Growth Fails To Impress"], "image": ["http://media.skynews.com/media/images/generated/2015/3/19/378477/default/v2/rtr4c0vb-1-1-362x204.jpg"], "content": ["<p class=\"story__intro\">Facebook shares fell after-hours in New York on Wednesday night after a 46% jump in quarterly revenue to $3.54bn (£2.35bn) failed to impress investors.</p>", "<p>The social network's results for January to March showed continued progress in key areas but profits fell 20% as it spent big on development.</p>", "<p>There was a 13% rise in user numbers to 1.44 billion on the same period a year ago, with 24% more people accessing Facebook via a mobile device at least once a month.</p>", "<p>Facebook showed it had made further strides in mobile advertising to capture that shift in consumer behaviour, with 69% of its advertising revenue now coming from mobile ads.</p>", "<p>But that was where the good news stopped for shareholders, with the company missing Wall Street's expectations on its core financial numbers for the first time since 2013.</p>", "<p>Shares fell more than 2% after the Nasdaq close.</p>", "<p>Analysts had forecast revenue of $3.56bn while profits fell to $642m as its mobile app development spend contributed to an 83% rise in expenses in the period.</p>", "<p>Staff costs also rose - with the company's recruitment soaring 48% on the same period last year to pass the 10,000 mark.</p>", "<p>Facebook, which bought the popular photo-sharing app Instagram and the messaging service WhatsApp, has been coming out with its own stand-alone mobile apps to capture more of the time people spend on phones.</p>", "<p>Besides its Messenger app, Facebook's home-grown efforts have had limited success.</p>", "<p>On Wednesday, the company introduced Hello, a voice-calling app designed for Android phones.</p>", "<p>Analysts will be closely watching whether it takes off following Facebook's inability to persuade users to install its Home app, which lets Facebook take over the home screen on Android.</p>", "<p>Facebook finance chief David Wehner said mobile \"continues to be a key driver\" of the company's growth and it would continue to experiment with apps for mobile.</p>"], "link": "http://news.sky.com/story/1470530/facebook-revenue-growth-fails-to-impress"},
{"category": ["business"], "category2": ["none"], "author": [], "headline": ["Amazon Will Deliver Items To Your Car Boot"], "image": ["http://media.skynews.com/media/images/generated/2013/11/29/273622/default/v2/rtx15p9t-1-362x204.jpg"], "content": ["<p class=\"story__intro\">Amazon will begin delivering packages directly to car boots from next month.</p>", "<p>The online retailer has partnered with delivery firm DHL and Audi to send items to selected Audi-owning Prime customers in Munich.</p>", "<p>The delivery worker will get one-time keyless access to the car boot to drop off a package, and Audi insists there will be no extra insurance issues.</p>", "<p>Amazon said: \"During the checkout process, customers simply indicate the approximate location of their car during the delivery window.</p>", "<p>\"When a carrier driver arrives, the vehicle's car trunk can be momentarily accessed via a unique, order specific digital authorisation.</p>", "<p>\"The delivery agent then simply places the order into the trunk and closes the hatch which locks the car again.\"</p>", "<p>If successful, it could become an alternative to home delivery which can be awkward if you're not at home.</p>", "<p>Drivers who want to take part in the pilot will have to have their cars adapted to enable third-party access.</p>", "<p>Amazon says it wants the feature to be available to all Prime members eventually.</p>", "<p>Amazon is also looking into allowing customers to return items using the same method - leaving a package in their boot for a delivery driver to pick up.</p>", "<p>Volvo is also exploring a similar programme.</p>", "<p>Amazon Prime members pay an annual fee for services such as next-day delivery and streaming television and movies.</p>", "<p>Amazon already delivers items to lockers located in convenience stores and other locations.</p>"], "link": "http://news.sky.com/story/1470651/amazon-will-deliver-items-to-your-car-boot"},
{"category": ["business"], "category2": ["none"], "author": ["By Sean Williams"], "headline": ["Crowdfunding Spotlight: From Website To Market"], "image": ["http://media.skynews.com/media/images/generated/2015/4/22/386316/default/v1/onpaste.20150422-134901-1-362x204.png"], "content": ["<p class=\"story__byline\">By Sean Williams</p>", "<p class=\"story__intro\">Millions of pounds have gone in to thousands of crowdfunding projects, but do the businesses ever come to market?</p>", "<p>Alternative finance has grown in popularity in the past five years. Benefiting many thousands of businesses in need of funds required to grow and prosper.</p>", "<p>But the big question is whether they actually do thrive and become the next big thing.</p>", "<p>Reward-based crowdfunding platforms such as Indiegogo, Kickstarter and the biggest UK platform, Crowdfunder.co.uk have helped thousands of ideas, prototypes and start-ups gain amounts from £100 to £15m.</p>", "<p>Some sceptics see the crowdfunding of quirky ideas and funky tech initiatives as a quick hit.</p>", "<p>But it is an e-commerce mechanism with the rewards part of the cycle essentially selling a product. The most successful being a good demonstration of this.</p>", "<p>The Pebble watch raised almost £7m on Kickstarter in 2012 and essentially guaranteed a raft of pre-orders in the process.</p>", "<p>It rapidly turned into a business success story and has since gone on to crowdfund its recent product launch – raising a further £13m in the process.</p>", "<p>Of course, these are the stand-out examples of crowdfunding and it’s not all multi-millions.</p>", "<p>In fact, the vast majority of businesses raise significantly less but it doesn't stop them from achieving business success.</p>", "<p>This week, Indiegogo crowdfunding project FOBO came to market through UK retailer Maplin.</p>", "<p>Initially a concept from Malaysia, the entrepreneurs behind \"the world’s first Bluetooth tyre pressure gauge\" raised £125,000 to get the first full production under way. Goal achieved.</p>", "<p>Yet more came of crowdfunding than they had expected. It was spotted by UK investors and after some successful negotiations, has now found its way onto the UK's high-street.</p>", "<p>The device helps tackle safety concerns surrounding dangerous under or over-inflated tyres that may lead to an accident.</p>", "<p>According to EU figures, under-inflated tyres are a contributory factor in 9% of all fatal road accidents and 41% of serious injuries on our roads.</p>", "<p>In addition, drivers with unroadworthy tyres can face penalties of up to £2,500 per wheel.</p>", "<p><strong>Other popular crowdfunding campaigns this week</strong></p>", "<p>According to social media research by Opinium, Indiegogo’s Smart Tracker, a device which allows you to track the whereabouts of anything, is the most talked about social media crowdfunding project this week with 3,226 tweets.</p>", "<p>Lynk, a security fob protecting your mobile or tablet data, and Gbreeze, a purifier project on Kickstarter gained 1,120 and 992 global tweets respectively.</p>"], "link": "http://news.sky.com/story/1470095/crowdfunding-spotlight-from-website-to-market"},
{"category": ["business"], "category2": ["software"], "author": [], "headline": ["Google Joins Search For Loch Ness Monster"], "image": ["http://media.skynews.com/media/images/generated/2015/4/21/385975/default/v2/loch.ness.-196-2-1-362x204.jpg"], "content": ["<p class=\"story__intro\">Google has joined the search for the Loch Ness Monster by taking its Street View cameras across the famous Scottish loch.</p>", "<p>It sent teams to take pictures both above and below the waterline to help armchair Nessie hunters to explore the area.</p>", "<p>Google said the development was to mark the anniversary of the release of the Surgeon's Photograph - a 1934 hoax image claiming to show the monster in the misty waters of the lake.</p>", "<p>A post on Google's official blog said: \"Sail across the freshwater lake and take in its haunting beauty, made darker still by the peat particles found in its waters.</p>", "<p>\"Let the Loch unlock the spirit of your imagination, where the rippling water, tricks of the light, and drifting logs bring the legend of Nessie to life.\"</p>", "<p>It took Google around a week to take the photographs, with a diver being used to take the Street View Trekker camera under the waterline, before attaching it to a boat for the above-water shots.</p>", "<p>Loch Ness is the largest Scottish loch by water volume, containing more fresh water than all the lakes of England and Wales combined.</p>", "<p>Google says there are more searches for Loch Ness than the likes of Buckingham Palace.</p>"], "link": "http://news.sky.com/story/1469251/google-joins-search-for-loch-ness-monster"},
{"category": ["gaming"], "category2": ["software"], "author": [], "headline": ["Oz National Park To Be Designed On Minecraft"], "image": ["http://media.skynews.com/media/images/generated/2014/8/21/330753/default/v2/kl6uz6a-1-362x204.png"], "content": ["<p class=\"story__intro\">Students are being asked to design Australia's next multimillion-dollar national park using the popular computer game Minecraft.</p>", "<p>The winning submission will be brought to life using a fund of around £6m which has been set aside by the local government in Adelaide.</p>", "<p>Entrants have been asked to incorporate spaces for activities like hiking and mountain bike trails, scenic vistas, and camp sites.</p>", "<p>Designs must also account for the flora and fauna in the Adelaide and Mount Lofty Ranges.</p>", "<p>Minecraft allows users to construct buildings and landscapes out of textured cubes in a 3D world.</p>", "<p>Environment minister Ian Hunter said: \"Whatever they create on the screen needs to be able to be translated into the real world.</p>", "<p>\"We'd like to see trails and other built features that are creative, practical, usable and sustainable, that complement the natural environment and the plants and animals living in it.\"</p>", "<p>The finalists' flyover videos will be posted on YouTube. The competition closes on 12 June.</p>", "<p>Entrants must use the basic version of Minecraft without any modifications or special texture packs.</p>"], "link": "http://news.sky.com/story/1469835/oz-national-park-to-be-designed-on-minecraft"},
{"category": ["socialMedia"], "category2": ["none"], "author": [], "headline": ["Facebook To Show You More Content From Friends"], "image": ["http://media.skynews.com/media/images/generated/2015/3/19/378477/default/v2/rtr4c0vb-1-1-362x204.jpg"], "content": ["<p class=\"story__intro\">If you're an avid Facebook user, you are about to see more content from your friends and family.</p>", "<p>The social network has tweaked its News Feed algorithms to prioritise content created by people you know.</p>", "<p>It will mean that posts from brands and news organisations will lose out, while photo galleries and status updates from your contacts will be pushed to the fore.</p>", "<p>Facebook says it comes as a result of page owners sharing more and more content.</p>", "<p>In a blog post the company said to page owners: \"The impact of these changes on your page's distribution will vary considerably depending on the composition of your audience and your posting activity.</p>", "<p>\"In some cases, post reach and referral traffic could potentially decline. Overall, pages should continue to post things that people find meaningful and consider these best practices for driving referral traffic.\"</p>", "<p>It comes after a survey of Facebook users found they would like to see more from people close to them.</p>", "<p>The site is also loosening restrictions which currently stop the site from showing multiple posts from the same person in the News Feed.</p>", "<p>It says: \"Now if you run out of content, but want to spend more time in News Feed, you’ll see more (from the same users).\"</p>", "<p>The other change made is that Facebook updates showing friends liking or commenting on a post will appear further down the News Feed, or not at all.</p>"], "link": "http://news.sky.com/story/1470187/facebook-to-show-you-more-content-from-friends"},
{"category": ["socialMedia"], "category2": ["none"], "author": [], "headline": ["Twitter To Let Anyone Send You Direct Messages"], "image": ["http://media.skynews.com/media/images/generated/2013/11/18/271238/default/v2/187243545-1-362x204.jpg"], "content": ["<p class=\"story__intro\">Twitter will now let anyone send you a direct message - not just the people you're following.</p>", "<p>It's a major overhaul for the site which until now has only allowed people who follow each other to exchange messages privately.</p>", "<p>The new feature is turned off by default but can be switched on in the settings menu.</p>", "<p>The feature has been tested before in October 2013, but it was killed off after just a few weeks.</p>", "<p>A prominent direct message button is also being added to the iPhone app to encourage people to use the often neglected feature.</p>", "<p>The move appears to be part of a move by Twitter to muscle in to the lucrative mobile-messaging market, which Facebook has recently made a big push into with its Messenger app.</p>", "<p>The feature will be particularly useful to celebrities and large companies who can now respond to people privately without having established a connection beforehand.</p>", "<p>Users can also send direct messages - known as DMs - to people who follow them, even if they do not follow them back and have not turned on the feature in the settings menu.</p>", "<p>Once a message is sent, the follower can respond.</p>", "<p>A Twitter spokesman said: \"We hope these changes help you connect more easily, and directly, on Twitter with the people, causes and businesses you care about most.\"</p>"], "link": "http://news.sky.com/story/1469125/twitter-to-let-anyone-send-you-direct-messages"},
{"category": ["mobileTablet"], "category2": ["business"], "author": [], "headline": ["Google Search Change Could Cause 'Mobilegeddon'"], "image": ["http://media.skynews.com/media/images/generated/2012/10/16/198438/default/v1/152807961-1-362x204.jpg"], "content": ["<p class=\"story__intro\">Google is due to make a major update to its mobile search algorithm on Tuesday, in a move expected to cause ripples across the web.</p>", "<p>Websites not deemed mobile-friendly will be dropped down the search rankings, dramatically reducing the number of visitors to a site.</p>", "<p>Microsoft and the European Union are among the organisations likely to be negatively affected by the changes to Google's secret search formula.</p>", "<p>People can check whether their website is classed as mobile-friendly by Google by entering the web address <strong><a href=\"https://www.google.com/webmasters/tools/mobile-friendly\">here</a>.</strong></p>", "<p>Some search engine ranking experts have called the potential fallout from the changes \"mobilegeddon\".</p>", "<p>Itai Sadan, from website-building company Duda, told Business Insider: \"I think the people who are at risk are those who don’t know about it.</p>", "<p>\"Come 21 April, a lot of small businesses are going to be really surprised that the number of visitors to their websites has dropped significantly. This is going to affect millions of sites on the web.\"</p>", "<p>Companies spend significant amounts of money and effort to appear high up in Google rankings, with places on the first page of results highly prized.</p>", "<p>Text that is too small to read on a mobile device, plus links that are too close together, are among the reasons some sites will fall down the mobile ranking list.</p>", "<p>Google announced the changes in February, so companies have had just two months to prepare.</p>", "<p>The firm said: \"This change will affect mobile searches in all languages worldwide and will have a significant impact on our search results.\"</p>"], "link": "http://news.sky.com/story/1468513/google-search-change-could-cause-mobilegeddon"},
{"category": ["business"], "category2": ["none"], "author": [], "headline": ["ARM Hails Internet Of Things As Profits Leap"], "image": ["http://media.skynews.com/media/images/generated/2014/2/25/291993/default/v1/cegrab-20140225-204220-0-1-362x204.jpg"], "content": ["<p class=\"story__intro\">ARM Holdings has reported a 33% leap in pre-tax profit, partly due to surging sales of the latest iPhone models.</p>", "<p>The chip designer, which licences its products to the likes of Apple and Samsung, said that first quarter sales rose by 14%, royalties from processor designs jumped 31% but licensing revenue grew at the much slower rate of 3%.</p>", "<p>Profit before tax hit £103.4m while group revenues were £227.5m.</p>", "<p>Unlike its main rival Intel, ARM does not make chips, rather it designs and licenses them to third parties.</p>", "<p>It describes itself as the world's leading semiconductor intellectual property supplier.</p>", "<p>ARM chips sit inside no less than 95% of all smartphones and sales of new products from Apple were a major contributing factor to ARM's performance in the quarter. </p>", "<p>ARM technology will also sit inside the <strong><a href=\"http://news.sky.com/story/1462348/apple-watch-arrives-in-stores-around-the-world\" target=\"_blank\">new Apple watch</a> </strong>which is released on Friday.</p>", "<p>Looking forward, the company said that processors for microcontrollers and smart sensors to support the so-called Internet of Things would help underpin future revenue growth.</p>", "<p>The Internet of Things, which has been described as technology which will help create a new industrial revolution, involves connecting devices including everyday home objects such as fridges, as well equipment and components used in industry and healthcare. </p>", "<p>According to Cisco projections, by 2020 there will more than 50 billion devices connected to the Internet of Things.</p>", "<p>Simon Segars, ARM's chief executive, said: \"In Q1 (first quarter) we licensed ARMv8‑A processors for networking and server applications and Cortex-M processors for microcontrollers and smart sensors for the Internet of Things.</p>", "<p>\"These design wins underpin future royalty revenue growth and enable continued investment in future innovative technology to create long-term superior returns for our shareholders.\"</p>", "<p>Shares in ARM rose 6% in early trading on the FTSE 100 on Tuesday.</p>"], "link": "http://news.sky.com/story/1469259/arm-hails-internet-of-things-as-profits-leap"},
{"category": ["socialMedia"], "category2": ["none"], "author": [], "headline": ["Security Expert Barred By Airline Over Tweet"], "image": ["http://media.skynews.com/media/images/generated/2014/8/26/331873/default/v1/united-1-362x204.jpg"], "content": ["<p class=\"story__intro\">A security researcher who tweeted that an airline's on-board communications systems could be hacked has been barred from boarding a California-bound flight.</p>", "<p>Chris Roberts was removed by the FBI from a United Airlines flight on Wednesday last week after landing in New York. He was questioned for four hours and had his computer equipment confiscated.</p>", "<p>Then late on Saturday he was turned away again despite clearing TSA security checks.</p>", "<p>A spokesman for the airline says he has now been banned from all flights with them.</p>", "<p>The move follows a message posted on Twitter in which he suggested he could take control of some of the plane's computer systems in order to deploy oxygen masks.</p>", "<p>The message was signed off with a smiley face, apparently indicating that it was meant as a light-hearted musing, but the airline and authorities have taken it seriously.</p>", "<p>He has said he was repeatedly able to connect his laptop to a box under his seat during a flight, which allowed him to view data from the aircraft's engines, fuel and flight-management systems.</p>", "<p>The FBI has not commented.</p>", "<p>Mr Roberts has given media interviews in recent weeks in which he has discussed airline system vulnerabilities.</p>", "<p>Last week the US Government Accountability Office said some commercial aircraft may be vulnerable to hacking over their onboard wireless networks. Modern aircraft are increasingly connected to the internet.</p>"], "link": "http://news.sky.com/story/1468574/security-expert-barred-by-airline-over-tweet"},
{"category": ["software"], "category2": ["business"], "author": [], "headline": ["Google April Fools' Day Prank 'Broke Security'"], "image": ["http://media.skynews.com/media/images/generated/2015/4/20/385775/default/v1/com.google-1-362x204.png"], "content": ["<p class=\"story__intro\">Google marked April Fools' Day this year by created a backwards-facing homepage - but may have left itself open to hackers.</p>", "<p>The site - found at the address com.google - featured everything backwards including the site's logo and page text.</p>", "<p>But internet research company Netcraft said the joke compromised user security, potentially allowing hackers to hijack anyone trying out the fake site.</p>", "<p>Malicious hackers could have fooled visitors into visiting malicious websites, as well as changing SafeSearch settings which protect children from seeing adult content.</p>", "<p>A statement from Netcraft said: \"This year's joke inadvertently undermined an important security feature on Google's real homepage, which made it vulnerable to user interface redressing attacks such as click-jacking.</p>", "<p>\"This vulnerability would have allowed a remote attacker to change a user's search settings, including turning off SafeSearch filters.</p>", "<p>\"A carefully constructed clickjacking attack could have gone unnoticed by each victim until it was too late and the settings had already been changed.\"</p>", "<p>They informed Google and the issue was apparently fixed before hackers had a chance to strike.</p>"], "link": "http://news.sky.com/story/1468658/google-april-fools-day-prank-broke-security"},
{"category": ["hardware"], "category2": ["none"], "author": [], "headline": ["Mysterious 'Supervoid' Is Largest Known Object"], "image": ["http://media.skynews.com/media/images/generated/2015/4/21/386008/default/v2/cmb7-wmap-circle-900-1-362x204.jpg"], "content": ["<p class=\"story__intro\">The largest-known structure ever discovered by mankind is a massive supervoid 1.8 billion light years across.</p>", "<p>The empty section of space - which would normally be expected to contain around 10,000 galaxies - was picked up using Hawaii's Pan-STARRS1 (PS1) telescope and Nasa's <strong><a href=\"http://www.nasa.gov/mission_pages/WISE/main/index.html\" target=\"_blank\">Wide Field Survey Explorer</a></strong> satellite.</p>", "<p>István Szapudi, who led the work at the University of Hawaii, said the discovery was \"the largest individual structure ever identified by humanity\".</p>", "<p>It could explain a large cold spot in the universe which has been unexplained for more than a decade.</p>", "<p>Areas of heat and cold are expected in the universe, but not the extent seen at the cold spot.</p>", "<p>But the supervoid only partially accounts for the low temperature, and there may be \"exotic physics\" - effects scientists don't yet understand - at play.</p>", "<p>The supervoid is not a vacuum but is around 20% less dense than a typical region of the universe.</p>", "<p>Scientists say it is an unprecedented find as the universe is evenly distributed at that scale.</p>"], "link": "http://news.sky.com/story/1469309/mysterious-supervoid-is-largest-known-object"},
{"category": ["hardware"], "category2": ["none"], "author": [], "headline": ["FM Radio Signal To Be Turned Off In World First"], "image": ["http://media.skynews.com/media/images/generated/2015/4/20/385642/default/v1/thinkstockphotos-479705117-1-362x204.jpg"], "content": ["<p class=\"story__intro\">Norway is to become the first country in the world to turn off its FM radio signal - and the rest of Europe is likely to follow.</p>", "<p>The country's inhabitants have been among the more eager converts to digital radio, with around half of the population tuning into stations on a digital signal.</p>", "<p>The government believes the move will increase competition and improve emergency services communication. The shutdown will begin within two years.</p>", "<p>Minister of Culture Thorhild Widvey said: \"Listeners will have access to more diverse and pluralistic radio-content, and enjoy better sound quality and new functionality.</p>", "<p>\"Digitisation will also greatly improve the emergency preparedness system, facilitate increased competition and offer new opportunities for innovation and development.\"</p>", "<p>There are only five FM radio stations in Norway, with 22 national channels on DAB digital radio.</p>", "<p>The digital system has the capacity to host a further 20 stations.</p>", "<p>The shutdown will officially begin on 11 January 2017 in Nordland country, and will end with the Troms and Finnmark counties in December of the same year.</p>", "<p>Thor Gjermund Eriksen, head of the Norwegian Broadcasting Corporation, said: \"This is an important day for everyone who loves radio.</p>", "<p>\"The minister's decision allows us to concentrate our resources even more upon what is most important, namely to create high quality and diverse radio-content to our listeners.\"</p>", "<p>The UK completed its television digital switchover in 2012.</p>"], "link": "http://news.sky.com/story/1468459/fm-radio-signal-to-be-turned-off-in-world-first"},
{"category": ["business"], "category2": ["none"], "author": ["By Mark Kleinman, City Editor"], "headline": ["Spotify To Sell Stakes To Global Fund Giants"], "image": ["http://media.skynews.com/media/images/generated/2014/5/8/307591/default/v1/455110553-1-362x204.jpg"], "content": ["<p class=\"story__byline\">By Mark Kleinman, City Editor</p>", "<p class=\"story__intro\">An array of prominent global investors including London-based hedge fund Lansdowne Partners are in advanced talks to acquire multimillion pound stakes in digital music service Spotify.</p>", "<p>Sky News can exclusively reveal the full list of investors who are expected to participate in a $400m (£268m) fundraising that will value Spotify at $8.4bn (£5.6bn).</p>", "<p>The investors, who are betting that loss-making Spotify can ultimately use its loyal customer base to reap handsome profits, will each buy stakes valued at several tens of millions of dollars, with the largest acquiring up to $100m-worth (£72m) of stock, according to insiders.</p>", "<p>The group of shareholders who are injecting the funds includes some existing backers, such as a division of Goldman Sachs, the Wall Street bank, GSV and Technology Crossover Ventures (TCV), which first invested in Spotify in 2013.</p>", "<p>As well as Lansdowne, the new investors with whom Spotify is in discussions are the Abu Dhabi Investment Council, Baillie Gifford, DE Shaw, Discovery Capital Management, Halcyon Asset Management, Northzone, PSAM, Rinkelberg Capital and Senvest Capital, sources said on Monday.</p>", "<p>Lansdowne is one of London's oldest and best-known hedge funds, placing successful bets on the value of bank shares in the aftermath of the financial crisis, and emerging as one of the biggest shareholders in Royal Mail when it was controversially privatised in 2013.</p>", "<p>The funding round, which will be Spotify's seventh since it launched in 2008, is expected to be closed in the next few weeks.</p>", "<p>It is possible that some of those in talks will drop out of the negotiations before signing, sources said, while it was unclear whether the group of investors will formally commit capital until Spotify has agreed a renewal of a licensing contract it has with Universal Music Group, the world's largest music company.</p>", "<p>Insiders described that deal as \"crucial\" and said it would not be signed until the two sides had settled upon \"mutually agreeable terms\".</p>", "<p>As of mid-January this year, Spotify had 60m monthly active users, of whom 15 million were paying subscribers, according to the company.</p>", "<p>At £5.6bn, the company will be valued at more than twice the level at which EMI was broken up and sold for in 2012.</p>", "<p>However, Spotify continues to lose money, with operating losses in 2013 - the last year for which financial performance figures are available - rising 16.4% from just under €80m (£57m) in 2012 to €93.1m (£67.1m).</p>", "<p>News of the latest fundraising comes as it emerged that physical music sales in the UK have rebounded, growing by almost £10m in the first quarter of 2015, and helping HMV to recapture its former status as Britain's biggest music retailer.</p>", "<p>Competition among digital music platforms also continues to intensify, with <a href=\"http://news.sky.com/story/1455811/stars-launch-jay-zs-music-streaming-service\" target=\"_blank\"><strong>Tidal, a service owned by Jay Z and other leading artists, launching earlier this month.</strong></a></p>", "<p>Apple and Google are also developing new services in the space.</p>", "<p>Spotify has launched a string of new services and joint ventures as it seeks to broaden its consumer appeal and revenue base.</p>", "<p>In 2013, it unveiled Spotify Connect, which links mobile devices to home audio equipment, and it has rapidly expanded its international presence, launching in Brazil and Canada recently, to take the number of markets in which it has a presence to 58.</p>", "<p>Spotify's existing shareholders include a host of prominent names from Wall Street and Silicon Valley, including Goldman Sachs, DST, Accel Partners and Kleiner Perkins.</p>", "<p>The Coca-Cola Company became a minor shareholder in Spotify in 2013, underlining the growing trend for major consumer brands to acquire shareholdings in digital ventures.</p>", "<p>It is unclear whether Coca-Cola is to make any further invest as part of the latest funding round.</p>", "<p>The rapid expansion of Spotify, which offers users on-demand access to tens of millions of songs for set monthly fees, has sparked tensions with some artists over royalty payments.</p>", "<p>Spotify and Lansdowne both declined to comment on Monday.</p>"], "link": "http://news.sky.com/story/1468539/spotify-to-sell-stakes-to-global-fund-giants"}]