[{"category": ["mobileTablet"], "category2": ["business"], "author": ["James Peckham"], "headline": ["No Nokia, don't come back until you've got something to add"], "image": ["http://cdn.mos.techradar.com/art/mobile_phones/Nokia/Lumia930/Hands%20on3/Nokia%20Lumia%20930%20review%20(11)-320-80.JPG"], "content": ["<p>It's only ruddy 7 days in phones, and you've been truly spoilt as it's the second this week after the <a href=\"/news/phone-and-communications/mobile-phones/huawei-does-a-tom-hanks-and-goes-big-1291265\">legal furor of the last one.</a> Consider yourself spoilt.</p>", "<p>So without further ado, take my hand, and here we go! Weeeeeeeeeeeeeeeeeee.</p>", "<p>Nokia is picking up the pieces and putting them all back together in a 'Dr Frankenstein' manner to resurrect its smartphone business, or at least that's what we've been led to believe.</p>", "<p>Rumours <a href=\"/news/phone-and-communications/mobile-phones/nokia-might-be-back-with-a-new-phone-in-2016-1291479\">suggest Nokia</a> is planning to jump back into smartphones as soon as the Microsoft deal allows, so it'll be the end of 2016, but do we really need it to return?</p>", "<p>The only reason Nokia went from the worlds biggest smartphone manufacturer to the sad mess it was when Microsoft put it out of its misery was a lack of innovation. </p>", "<p>The platform held onto Symbian for too long and should have switched to Windows Phone quicker, but instead the iPhone and Google popped up and overtook it.</p>", "<p>Microsoft has taken over the Windows Phone-fronted end of the market now so we don't have any real need for another manufacturer doing that. If it doesn't innovate further, there's no reason to see Nokia come back into smartphones at all.</p>", "<p>We've got a long wait to find out what the company is planning but I want something fresh with new ideas to take the Nokia brand to the next level if it's gonna come back.</p>", "<p>Quick, HIDE! It's the Apple Watch… or, maybe the opposite: get out from under that rock and improve yourself. Google is taking that tactic and going balls out with the <a href=\"/news/wearables/android-wear-s-new-update-puts-it-closer-in-line-with-the-apple-watch-1291500\">Android Wear platform</a>. Updating it to the best it has been so far ready for the arrival of the most exciting thing in wristwear - the Apple Watch.</p>", "<p>But most of the additions are things we should have seen months back. Some manufacturers have been making their watches Wi-Fi ready for over a year now and Google hasn't bothered to turn the feature on until now. Although some should have done better... We're looking at you LG G Watch R.</p>", "<p>Google got cocky; where is the maps functionality we should have had? The improvements to voice functionality? More Google based apps?…it all started out well and Google then begun to coast a little over the last few months but has had to buck its ideas up and improve ready for the Apple Watch.</p>", "<p>\"Welcome… to The Council of the Forgotten handsets\" announced an ominous voice shaded in black.</p>", "<p>Winston's knees continued to shake, this time out of nerves rather than the agony of his recently sustained injuries, whilst his voice followed suit.</p>", "<p>\"Wh…wh…why am I here?\" Winston asked. </p>", "<p>The ominous dark figure leaned out from the shadows a little to reveal the tip of his yellow beak. \"Because you have work to do\" the figure declared.</p>", "<p>The shadows around Winston began to retract revealing he wasn't alone with the figure - he was sharing this exchange with the rest of the council surrounding him.</p>", "<p>Paws, claws, teeth, fins, whiskers, tails, scales and all other manner of animal features began to fade into view as Winston span around to take them all in. There must have been 40 members surrounding him, all staring down menacingly upon the confused unicorn.</p>", "<p>Each sat upon a forgotten phone. Despite his confusion Winston managed to make out a BlackBerry Pearl, a Samsung E100, a Sony Ericsson K300, a Siemens A50, a plethora of Nokia handsets including the 5230, 3210, 6600 but there were many more he didn't even recognise.</p>", "<p>The leader sat higher than the rest of The Council upon a half open Motorola Razr V3i, looking down upon his clear subordinates.</p>", "<p>As Winston's spin came to a stop, his eyes met the beady peepers of the bald eagle.</p>", "<p>\"What kind of work? Why me? Who are you people?\" Winston declared.</p>", "<p>\"For you are The Chosen One Winston, and the history of phones need your help.\"</p>", "<p>BlackBerry's John Chen is known for being brutally honest but in this interview from a few months back he gets even more honest than we've ever seen him before.</p>", "<p>You just want to give him a little cuddle.</p>", "<p class=\"youtube-video\"> <object width=\"580\" height=\"356\"> <param name=\"movie\" value=\"http://www.youtube.com/v/Yz2lQJwhQXY&amp;hl=en&amp;fs=1\"><param name=\"allowFullScreen\" value=\"true\"><param name=\"allowscriptaccess\" value=\"always\"><embed src=\"http://www.youtube.com/v/Yz2lQJwhQXY&amp;hl=en&amp;fs=1\" type=\"application/x-shockwave-flash\" allowscriptaccess=\"always\" allowfullscreen=\"true\" width=\"580\" height=\"356\"></embed></object> </p>", "<p>Meet Sally, but don't mess with Sally, Sally is serious. She's serious about the new LG Optimus range. So serious she's worn her best PVC dress for the occasion even though it's the height of summer outside.</p>", "<p>Now which of the LG Series are you going to buy? Buy it, BUY IT NOW. WHY HAVEN'T YOU BOUGHT IT ALREADY?</p>", "<p>You may be shocked to know even in the days before YouTube (which happens to be <a href=\"/news/world-of-tech/stop-what-you-re-doing-and-watch-our-all-time-favourite-youtube-videos-1291876\">10 years old this week</a>) there was an appetite for cat videos. That and You've Been Framed-style humour of things hurting themselves.</p>", "<p>Put them both together, look at it it all through 2003's Nokia 3650 and Finnish company thought it was on to a winner.</p>", "<p>Sadly the advert never actually made it onto TV down to animal cruelty claims – oh, how things have changed. Animals in comedic peril is now the norm in almost every YouTube video you'll watch.</p>", "<p class=\"youtube-video\"> <object width=\"580\" height=\"356\"> <param name=\"movie\" value=\"http://www.youtube.com/v/tBH9VYb0Xhg&amp;hl=en&amp;fs=1\"><param name=\"allowFullScreen\" value=\"true\"><param name=\"allowscriptaccess\" value=\"always\"><embed src=\"http://www.youtube.com/v/tBH9VYb0Xhg&amp;hl=en&amp;fs=1\" type=\"application/x-shockwave-flash\" allowscriptaccess=\"always\" allowfullscreen=\"true\" width=\"580\" height=\"356\"></embed></object> </p>"], "link": "http://www.techradar.com/news/phone-and-communications/mobile-phones/no-nokia-don-t-come-back-until-you-ve-got-something-to-add-1292056"},
{"category": ["wearables"], "category2": ["none"], "author": ["Juan Martinez"], "headline": ["The best business apps for your Apple Watch"], "image": ["http://cdn.mos.techradar.com/art/Watches/Apple%20Watch/Hands%20on%20iWatch/First%20option/Apple%20Watch%20review%20(3)-320-80.JPG"], "content": ["<p>The Apple Watch is a polarizing device. You either love it or hate it. Either way, you probably need to get used to seeing it around. With more than 3000 apps available, Apple has developed a ton of utilities for Watch wearers. </p>", "<p>Included in this long list of apps are several business-focused tools that aim to help improve productivity, organization and communication. We’ve narrowed the list down to some of the most important ones available, and we’ll be sure to continue refining as the list expands. </p>", "<p>You can’t have an enterprise-ready device without somehow tying it back to Salesforce. In partnership with Apple, the CRM giant created a tool, Analytics Cloud for Apple Watch, that offers users the ability to analyze and take action on data. Users can swipe from dashboard to dashboard to explore real-time data, and perform voice-based search to bring up reports and dashboards. </p>", "<p>Additionally, Salesforce1 for Apple Watch is built to provide notifications to employees. Managers can send updates to their teams via the Watch to let them know when goals have been reached, when emergencies have occurred, or when it’s quitting time, among other uses. </p>", "<p>If you’re willing to do the leg work, and you’re a Salesforce customer, you can use the Salesforce Wear Developer Pack to develop your own apps that tie back to Salesforce’s reporting. </p>", "<p>Want to step out for lunch, but you’re afraid to miss that important client call? Unified communications specialist, ShoreTel, has developed a tool that will route your desk phone to your Apple Watch so that you can hear voicemail, transfer calls, and conference into meetings. </p>", "<p>You can also program the app to let you view and respond to unread instant messages, receive meeting notifications, and more. Now you can be “unreachable” on your watch too! </p>", "<p>If you’re one of those managers that likes to be in touch with your employees at all times, Betterworks has developed an app for the Apple Watch that is designed to help teams track and achieve goals. Managers program assignments into the app, where everyone on the team is able to use their Watches to track progress (or lack thereof). Users can also message one another from within the application. </p>", "<p>Similar to Salesforce, but designed for smaller businesses, Bottomline is a sales tracking tool that gives business owners the power to monitor sales, customer requests, inventory, and more. You can also view PDF dashboards on the Watch so that you can better understand which products are outselling others, which stores have more foot traffic, and which salesperson sold more goods, among other uses. </p>", "<p>For consultants and other hourly workers who have a hard time managing when they started which job and when they clocked out, Invoice2go has created an Apple Watch application that lets you clock in and clock out of jobs via your wrist. The Watch app also notifies you when payments have been processed, so you don’t have to constantly check in with your clients’ grumpy payroll managers. </p>"], "link": "http://www.techradar.com/news/wearables/the-best-business-apps-for-your-apple-watch-1292089"},
{"category": ["business"], "category2": ["none"], "author": ["Kate Solomon"], "headline": ["5 tech firms that tried to steal their rivals' thunder"], "image": ["http://cdn.mos.techradar.com/art/Watches/Samsung/Samsung-NextGear-320-80.jpg"], "content": ["<p>Tech firms are notoriously petty - and never more so than when one of their rivals has something big going down. </p>", "<p>There's always a way to steal the thunder, but that doesn't mean you should. Here are five playground tactics that made us think less of our tech overlords:</p>", "<p>You could not make this stuff up. Samsung sponsored Heathrow's Terminal 5 for a while in 2014 - it basically meant that there were adverts for the Samsung Galaxy Terminal 5 (geddit) in every direction, begging for attention while you sipped a gin and tonic at Giraffe before getting on your flight. </p>", "<p>Nokia, then under the Microsoft Devices umbrella, decided that the best thing to do would be dress some out of work actors as astronauts and send them looking for a flight out of the galaxy - see what they did there? No one bought a phone as a result of either party's action.</p>", "<p>The London 2012 Olympics may have been a triumph for sporting endeavours, East London and fans of emotional montages everywhere, but there were strict rules in place to stop any brand who hadn't coughed up sponsorship money from cashing in on the Olympic endorsement. </p>", "<p>That didn't stop Dr Dre, however, who we assume personally masterminded the sending of Union Jack Beats headphones to Team GB before sitting back and watching the sort-of-sponsored sort-of-not social media posts roll in. </p>", "<p>Apple is the grand master of the Dick Move, repeatedly eschewing tech shows like CES, MWC and IFA but messing them up by announcing minor product updates, WWDC dates and software releases just as they're hitting their stride. </p>", "<p>Annoying for brands, yes, but more annoying for your poor, faithful technology journalists who just want to get home to see their families but are stuck writing 10 Things The iOS 8.3.4.2.1 Release Means For Your iPad 2 until the wee small hours after a full day of shovelling press releases into Trash. Might as well be down the mines, amirite?</p>", "<p>Someone somewhere hired an external agency to park a huge coach that said \"Wake Up\" on its side to \"wake\" the iSheeple \"up\". After everyone on the internet muttered \"er, desperate much?\" in Samsung's direction, Samsung Australia released a statement saying that it had \"nothing to do with the Wake-Up Campaign \" and <a href=\"/news/phone-and-communications/mobile-phones/rim-was-behind-apple-store-wake-up-protests-1078237\">RIM (now BlackBerry) was forced to own up to the whole thing</a>.</p>", "<p>It can't have escaped your notice that the <a href=\"/reviews/phones/mobile-phone-accessories/apple-watch-1264567/review\">Apple Watch</a> went on sale today - it certainly didn't escape Samsung's. In a plan you just know has been in the works since before the release date was announced, the Korean company chose today, April 24, Apple Watch Day, to tease a new round-faced Galaxy Gear. </p>", "<p>If this has changed your mind about opting for the Apple Watch over a Gear, please write in to the usual address. </p>"], "link": "http://www.techradar.com/news/world-of-tech/5-tech-firms-that-tried-to-steal-their-rivals-thunder-1292020"},
{"category": ["wearables"], "category2": ["none"], "author": ["David Nield"], "headline": ["Don't try this at home, but the Apple Watch is waterproof after all"], "image": ["http://cdn.mos.techradar.com/art/Watches/Apple%20Watch/Apple%20Watch%20water-320-80.jpg"], "content": ["<p>Thanks to the magic of worldwide time zones, <a href=\"/reviews/phones/mobile-phone-accessories/apple-watch-1264567/review\">Apple Watch</a> users in Australia have had the new wearable on their wrists well before the rest of us. Rather than an unboxing, Australian site FoneFox posted a detailed water test instead.</p>", "<p>First of all: under no circumstances try this yourself. Officially, the Apple Watch is only \"splash and water resistant\", which means it's fine in the rain or the shower but not guaranteed to survive anything more than that.</p>", "<p>FoneFox <a href=\"https://www.youtube.com/watch?v=zW5CxZioIkk\">submerged the Apple Watch in a bucket of water</a> for five minutes before taking it for a 15-minute swim... and it functioned perfectly fine afterwards.</p>", "<p>We wouldn't advise wearing your Apple Watch down to the swimming baths and nor would Apple, but it's reassuring to know that your wearable should survive a drop into the washing up if it happens to slip off your wrist.</p>", "<p>It's been a day filled with Apple Watch unboxing videos and detailed teardowns of the new device - eager punters have been waiting since September to get their hands on the new device, after all.</p>", "<p>As for working out how well the Apple Watch will do in the long-term, we'll have to wait for a future Apple earnings call to find out. Our full review is going to be online soon; in the meantime, here are <a href=\"/reviews/phones/mobile-phone-accessories/apple-watch-1264567/review\">our first hands-on impressions</a>.</p>", "<p class=\"youtube-video\"> <object width=\"580\" height=\"356\"> <param name=\"movie\" value=\"http://www.youtube.com/v/zW5CxZioIkk&amp;hl=en&amp;fs=1\"><param name=\"allowFullScreen\" value=\"true\"><param name=\"allowscriptaccess\" value=\"always\"><embed src=\"http://www.youtube.com/v/zW5CxZioIkk&amp;hl=en&amp;fs=1\" type=\"application/x-shockwave-flash\" allowscriptaccess=\"always\" allowfullscreen=\"true\" width=\"580\" height=\"356\"></embed></object> </p>", "<p class=\"webonly\">Via <a href=\"http://www.macrumors.com/2015/04/24/apple-watch-waterproof-new-test/\">Macrumors</a></p>"], "link": "http://www.techradar.com/news/wearables/don-t-try-this-at-home-but-the-apple-watch-is-waterproof-after-all-1292063"},
{"category": ["hardware"], "category2": ["none"], "author": ["Jamie Hinks"], "headline": ["Oracle giving away 1,000 Raspberry Pi computers to students"], "image": ["http://cdn.mos.techradar.com/art/desktop_pcs_and_macs/Raspberry%20Pi/Raspberry%20Pi%202/raspberry-pi-2-hero-320-80.JPG"], "content": ["<p><a href=\"/news/internet/cloud-services/samsung-to-team-with-oracle-over-cloud-services-1282142\">Oracle</a> and the <a href=\"/reviews/pc-mac/peripherals/raspberry-pi-2-1283369/review\">Raspberry Pi</a> Foundation want to encourage students to take up coding and close the alarming skills gap that is afflicting the IT sector globally through a new program.</p>", "<p>The Oracle Academy Raspberry Pi Weather Station initiative for schools is committed to giving away 1,000 free Raspberry Pi hardware kits to schools globally in order to let them learn how code while at the same time gain skills in meteorology and geography.</p>", "<p>Students between the ages of 11 and 16 are the main target of the initiative that asks them to build a weather station before developing apps to collect data from the instrument and feed all this into a cloud database hosted by Oracle.</p>", "<p>\"Our goal with the Oracle Raspberry Pi Weather Station project is not only to show students how computer science can help them measure, interrogate and understand the world better, but also to give them hands-on opportunities to develop these skills. We believe this is one of the best ways to inspire the next generation to take up the computer science roles that economies around the world need filled,\" said Jane Richardson, EMEA director at the Oracle Academy.</p>", "<p>Raspberry Pi has become an incredibly popular and important school for students across the planet that is teaching them to code and build the gaming titles of the future that will eventually close an acute skills gap being felt globally.</p>", "<p>A similar scheme <a href=\"/news/computing/pc/bbc-handing-out-one-million-free-computers-1288196\">unveiled by the BBC</a> back in March will provide a similar coding device to every child in year 7 free of charge to address the UK's own gap in skills that will total around 1.4 million over the coming five years.</p>"], "link": "http://www.techradar.com/news/computing/oracle-giving-away-1-000-raspberry-pi-computers-to-students-1292088"},
{"category": ["hardware"], "category2": ["business"], "author": ["Duncan Geere"], "headline": ["Formula 1 technology headed to supermarket fridges - yes, really"], "image": ["http://cdn.mos.techradar.com/art/other/Onetimers/williams%20F1%20credit-320-80.jpg"], "content": ["<p>Williams Advanced Engineering, part of the Formula One team, has <a href=\"http://www.williamsf1.com/advanced-engineering/news/supermarketfridgesbecomemoreenergyefficient\">announced</a> that it's partnering with a startup called Aerofoil Energy to stop cold air leaking out of fridges and into the aisles of supermarkets.</p>", "<p>A big chunk of supermarket operating costs is in refrigeration, especially when the fridges have no doors and sit open. Williams estimates that supermarkets and convenience stores account for between five and 10 percent of the UK's energy use, with 60 to 70 percent of that energy used in refrigeration.</p>", "<p>So they've built an aerofoil system, tested using fluid dynamics models and in their F1 factory. It attaches directly onto fridge shelves to redirect airflow and keep the cold confined to the desired area - lowering energy use. </p>", "<p>Williams says that early testing showed savings of between 18 and 42 percent, though the details of how the experiments were conducted hasn't been released. The next step is to roll it on among retailers - including the UK's second-largest supermarket chain, Sainsbury's.</p>", "<p>\"Aerofoils help the airflow around Formula One cars and can improve their performance -- and that's exactly how they help the fridges in our stores, by keeping the cold air in,\" said Sainsbury's head of refrigeration John Skelton. </p>", "<p>[Image credit: Williams F1]</p>"], "link": "http://www.techradar.com/news/car-tech/formula-1-technology-headed-to-supermarket-fridges-yes-really-1292070"},
{"category": ["software"], "category2": ["business"], "author": ["Jamie Hinks"], "headline": ["Windows Server 2003 demise baffles two thirds of UK firms"], "image": ["http://cdn.mos.techradar.com/art/TRBC/microsoft_windows_server_2003-320-80.jpg"], "content": ["<p>When it comes to <a href=\"/news/computing/servers/windows-server-2003-end-of-life-is-the-biggest-security-threat-of-2015-1289390\">Windows Server 2003</a>'s end of life the doom mongers are out in full force and another report has been released showing the unpreparedness of UK enterprises.</p>", "<p>Cloud firm Exponential-e found that 35% of UK companies are not suitably prepared for Windows Server 2003's fast approaching end of life date on July 14 and it has put together a four point plan for enterprises to cope with the transition.</p>", "<p>The survey of UK IT professionals also found that 63% don't know what Windows Server 2003's demise means for their business and this pushed Exponential-e to lay out its plan for companies looking to move on.</p>", "<p>To kick things off enterprises should catalogue software and workloads by noting down exactly what is running in their organisation. Once this is clear, apps and workloads have to be categorised by type and then how critical each one is plus the level of risk or complexity attached to each.</p>", "<p>By finding all this out it will point enterprises in the direction of the best \"target destination\" that will comprise an on-premise solution or cloud deployments across Infrastructure-as-a-Service (IaaS), Platform-as-a-Service (PaaS) and Software-as-a-Service (SaaS). Once all that is done, the migration will kick off using tools and resources that are at the right level to handle it effectively and efficiently.</p>", "<p>Estimates on the amount of enterprises still running Windows Server 2003 vary hugely depending on where you look from a relatively low 2.6 million to a whopping 11 million. For this reason it has been called the \"biggest security threat of 2015\" and right now it's not clear whether firms will cough up to extend support in the same way the UK government did with Windows XP.</p>"], "link": "http://www.techradar.com/news/software/business-software/windows-server-2003-demise-baffles-two-thirds-of-uk-firms-1292076"},
{"category": ["mobileTablet"], "category2": ["none"], "author": ["James Rivington"], "headline": ["50 best mobile phone deals for April 2015"], "image": ["http://cdn.mos.techradar.com/art/mobile_phones/best-mobile-phones-320-80.jpg"], "content": ["<p>This is a mobile phone contract buying guide jam packed full of the UK's best mobile phone deals for the cheapest possible prices.</p>", "<p>We've prioritised the <strong>lowest upfront fees</strong> and the <strong>best data allowances </strong>because we know you like free phones and lots of data.</p>", "<p><strong>The page you're on now</strong> contains the best deals on TechRadar's <a href=\"/news/phone-and-communications/mobile-phones/20-best-mobile-phones-in-the-world-today-645440\">top 10 ranked phones</a>, along with links through to our 'build your own deal' pages where you can create your own customised mobile contracts - <a href=\"/phonestore\">try it by visiting the TechRadar Phone Store</a>!</p>", "<p><strong>Page two</strong> has loads of cheap deals on cheap-yet-awesome budget handsets, and also last year's flagship smartphones that now cost significantly less!</p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"samsung galaxy s6 is the best phone\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn3.mos.techradar.futurecdn.net//art/mobile_phones/Samsung/Galaxy%20S6/Samsung%20Galaxy%20S6-320-80.jpg\" data-srcset=\"http://cdn3.mos.techradar.futurecdn.net//art/mobile_phones/Samsung/Galaxy%20S6/Samsung%20Galaxy%20S6-320-80.jpg 320w, http://cdn3.mos.techradar.futurecdn.net//art/mobile_phones/Samsung/Galaxy%20S6/Samsung%20Galaxy%20S6-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><strong>Simply the best phone in the world this year</strong></p>", "<p>TechRadar's favourite and top-ranked phone right now is the <a href=\"/reviews/phones/mobile-phones/samsung-galaxy-s6-1285636/review\">Samsung Galaxy S6</a>. It's got all the features you'd want in a brand new market-leading smartphone, as well as fantastic looks, super build quality and a really great camera. This is not a cheap phone but if you take a look below you'll see we've found some surprisingly good deals!</p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"mobile phone deals\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg\" data-srcset=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg 320w, http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"iphone 6\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn4.mos.techradar.futurecdn.net//art/mobile_phones/iPhone/iPhone%206/iphone6-whitebg-320-80.jpg\" data-srcset=\"http://cdn4.mos.techradar.futurecdn.net//art/mobile_phones/iPhone/iPhone%206/iphone6-whitebg-320-80.jpg 320w, http://cdn4.mos.techradar.futurecdn.net//art/mobile_phones/iPhone/iPhone%206/iphone6-whitebg-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><strong>Probably the best iPhone Apple has ever produced</strong></p>", "<p>Our second-favourite phone is the <a href=\"/reviews/phones/mobile-phones/iphone-6-1264565/review\">iPhone 6</a> - certainly the best phone Apple has ever created and definitely worth the extra money over an iPhone 5S. The larger screen, better keyboard and improved battery life make it a much more useable device than ever before.</p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"mobile phone deals\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg\" data-srcset=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg 320w, http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"HTC One M9\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn2.mos.techradar.futurecdn.net//art/mobile_phones/HTC/M9/htc%20one%20m9-320-80.jpg\" data-srcset=\"http://cdn2.mos.techradar.futurecdn.net//art/mobile_phones/HTC/M9/htc%20one%20m9-320-80.jpg 320w, http://cdn2.mos.techradar.futurecdn.net//art/mobile_phones/HTC/M9/htc%20one%20m9-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><strong>Looks fantastic and has all the features to match</strong></p>", "<p>The HTC One M8 was our favourite phone for the whole of 2014, but this year's entry the <a href=\"/reviews/phones/mobile-phones/htc-one-m9-1285623/review\">HTC One M9</a> is down at number 3 - still a highly commendable position given the immense competition. The camera is good, though not as brilliant as the two phone above, and everything else about the M9 is right up there with the very best money can buy.</p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"mobile phone deals\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg\" data-srcset=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg 320w, http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"galaxy s6 deals\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn2.mos.techradar.futurecdn.net//art/mobile_phones/Samsung/Galaxy%20S6%20Edge/samsung%20galaxy%20s6%20edge%20press-320-80.jpg\" data-srcset=\"http://cdn2.mos.techradar.futurecdn.net//art/mobile_phones/Samsung/Galaxy%20S6%20Edge/samsung%20galaxy%20s6%20edge%20press-320-80.jpg 320w, http://cdn2.mos.techradar.futurecdn.net//art/mobile_phones/Samsung/Galaxy%20S6%20Edge/samsung%20galaxy%20s6%20edge%20press-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><strong>Sexy looks that'll make everyone stop and take 'note'</strong></p>", "<p>The <a href=\"/reviews/phones/mobile-phones/samsung-galaxy-s6-edge-1286088/review\">Samsung Galaxy S6 Edge</a> is practically the same as the S6 at the top of this page but with a crucial difference - the screen curves down on both sides. It makes the phone look truly stunning and also enables a few nifty new features that aren't possible on flat-screened phones. Check out the deals we've found...</p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"mobile phone deals\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg\" data-srcset=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg 320w, http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"lg g3\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn1.mos.techradar.futurecdn.net//art/mobile_phones/LG/LG%20G3/lg%20g3-320-80.jpg\" data-srcset=\"http://cdn1.mos.techradar.futurecdn.net//art/mobile_phones/LG/LG%20G3/lg%20g3-320-80.jpg 320w, http://cdn1.mos.techradar.futurecdn.net//art/mobile_phones/LG/LG%20G3/lg%20g3-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><strong>LG's flagship phone looks, feels and performs excellently</strong></p>", "<p>We reckon the number 5 smartphone in the world right now is the <a href=\"/reviews/phones/mobile-phones/lg-g3-1250581/review\">LG G3</a>. Like its predecessor, if you're after power and precision (perhaps over design and form) then this is a winner. The camera and battery combo is superb, and the improved user interface will woo you immediately.</p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"mobile phone deals\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg\" data-srcset=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg 320w, http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"sony xperia z3 compact\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn4.mos.techradar.futurecdn.net//art/mobile_phones/Sony/XperiaZ3Compact/sony%20xperia%20z3%20compact-320-80.jpg\" data-srcset=\"http://cdn4.mos.techradar.futurecdn.net//art/mobile_phones/Sony/XperiaZ3Compact/sony%20xperia%20z3%20compact-320-80.jpg 320w, http://cdn4.mos.techradar.futurecdn.net//art/mobile_phones/Sony/XperiaZ3Compact/sony%20xperia%20z3%20compact-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><strong>Has all the features of the Z3 but in a smaller package and price</strong></p>", "<p>If you are looking for a feature-packed phone that looks fantastic and performs brilliantly, then you'll be very pleased with the <a href=\"/reviews/phones/mobile-phones/sony-xperia-z3-compact-1263318/review\">Sony Xperia Z3 Compact</a>. It's actually a smidgen smaller than the iPhone 6, which means it's still packing a good-sized screen but it's more manageable for small hands.</p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"mobile phone deals\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg\" data-srcset=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg 320w, http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"galaxy note 4\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn1.mos.techradar.futurecdn.net//art/mobile_phones/Samsung/Galaxy%20Note%204%20hands%20on/samsung%20galaxy%20note%204-320-80.jpg\" data-srcset=\"http://cdn1.mos.techradar.futurecdn.net//art/mobile_phones/Samsung/Galaxy%20Note%204%20hands%20on/samsung%20galaxy%20note%204-320-80.jpg 320w, http://cdn1.mos.techradar.futurecdn.net//art/mobile_phones/Samsung/Galaxy%20Note%204%20hands%20on/samsung%20galaxy%20note%204-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><strong>Samsung's latest Note is powerful and feature-packed</strong></p>", "<p>The Galaxy Note is the phone that made big screens fashionable and it's still the best phablet available today. The <a href=\"/reviews/phones/mobile-phones/samsung-galaxy-note-4-1263301/review\">Samsung Galaxy Note 4</a>'s 5.7-inch screen is simply gorgeous, extending almost to the edge of the handset so you can still hold it on one hand comfortably.</p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"mobile phone deals\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg\" data-srcset=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg 320w, http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"iphone 6 plus\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn1.mos.techradar.futurecdn.net//art/mobile_phones/iPhone/iPhone%206%20Plus/iphone%206%20plus-320-80.jpg\" data-srcset=\"http://cdn1.mos.techradar.futurecdn.net//art/mobile_phones/iPhone/iPhone%206%20Plus/iphone%206%20plus-320-80.jpg 320w, http://cdn1.mos.techradar.futurecdn.net//art/mobile_phones/iPhone/iPhone%206%20Plus/iphone%206%20plus-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><strong>The biggest iPhone ever is the most visually stunning to date</strong></p>", "<p>The <a href=\"/reviews/phones/mobile-phones/iphone-6-plus-1264566/review\">iPhone 6 Plus</a> is the best looking phablet around. Its specs don't match the Android powerhouses like the HTC One M8 and Samsung Galaxy Note 4, and its sheer size does make it tricky to hold, but there's no denying Apple's beautiful 5.5 incher is a winner.</p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"mobile phone deals\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg\" data-srcset=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg 320w, http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"sony xperia z3\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn1.mos.techradar.futurecdn.net//art/mobile_phones/Sony/sony%20xperia%20z3-320-80.jpg\" data-srcset=\"http://cdn1.mos.techradar.futurecdn.net//art/mobile_phones/Sony/sony%20xperia%20z3-320-80.jpg 320w, http://cdn1.mos.techradar.futurecdn.net//art/mobile_phones/Sony/sony%20xperia%20z3-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><strong>A great all-rounder that offers great performance - and it's waterproof</strong></p>", "<p>Sony has been releasing new phones thick and fast in the last few years, and the latest in a long line of flagship handsets is the <a href=\"/reviews/phones/mobile-phones/sony-xperia-z3-1263309/review\">Sony Xperia Z3</a>. It's got all the high-end specs you'd want, and the screen is the brightest of any in <a href=\"/news/phone-and-communications/mobile-phones/20-best-mobile-phones-in-the-world-today-645440\">our top 10</a>. </p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"mobile phone deals\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg\" data-srcset=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg 320w, http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"nexus6\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn1.mos.techradar.futurecdn.net//art/mobile_phones/Google/Nexus6/nexus6-2-320-80.jpg\" data-srcset=\"http://cdn1.mos.techradar.futurecdn.net//art/mobile_phones/Google/Nexus6/nexus6-2-320-80.jpg 320w, http://cdn1.mos.techradar.futurecdn.net//art/mobile_phones/Google/Nexus6/nexus6-2-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><strong>Google's biggest phone ever is an excellent phablet</strong></p>", "<p>Google chooses a different hardware partner for each yearly refresh of its Nexus flagship smartphone, and the <a href=\"/reviews/phones/mobile-phones/google-nexus-6-1271190/review\">Nexus 6</a> is built expertly by Motorola. It's certainly not a small phone: its near 6-inch display is about as big as it gets when it comes to smartphones and for that reason it's somewhat of an acquired taste, some will find it far too big, others will be absolutely besotted by it. </p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"mobile phone deals\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn1.mos.techradar.futurecdn.net//art/techradar/LINE-320-80.jpg\" data-srcset=\"http://cdn1.mos.techradar.futurecdn.net//art/techradar/LINE-320-80.jpg 320w, http://cdn1.mos.techradar.futurecdn.net//art/techradar/LINE-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p>If you want to dig deeper into choosing the best deals on the best phones, you can check out our regularly-updated mobile phone deals buying guides for individual handsets:</p>", "<p><img class=\"lft\" src=\"http://cdn2.mos.techradar.futurecdn.net//art/mobile_phones/iPhone/iPhone%206/iphone6-whitebg-200-100.jpg\" alt=\"iphone 6\"></p>", "<p>Our guide to picking up Apple's best-ever iPhone on contract for the cheapest possible price.</p>", "<p><strong>Read our guide:</strong> <a href=\"/news/phone-and-communications/mobile-phones/the-best-iphone-6-deals-1265931\">Best iPhone 6 deals</a></p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"the best mobile phone deals\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg\" data-srcset=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg 320w, http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><img class=\"lft\" src=\"http://cdn2.mos.techradar.futurecdn.net//art/mobile_phones/iPhone/iPhone%206%20Plus/iphone%206%20plus-200-100.jpg\" alt=\"iphone 6 plus\"></p>", "<p>Looking for a super-sized iPhone? Check out our phone deals page dedicated to the iPhone 6 Plus</p>", "<p><strong>Read our guide:</strong> <a href=\"/news/phone-and-communications/mobile-phones/the-best-iphone-6-plus-deals-1267314\">Best iPhone 6 Plus deals</a></p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"the best mobile phone deals\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg\" data-srcset=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg 320w, http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><img class=\"lft\" src=\"http://cdn4.mos.techradar.futurecdn.net//art/mobile_phones/iPhone/iPhone%205C/Press/5C-Press-07-200-100.jpg\" alt=\"iphone 5c deals\"></p>", "<p>If a cheap iPhone is what you're after, check out our guide to iPhone 5C deals - they're awesome!</p>", "<p><strong>Read our guide:</strong> <a href=\"/news/phone-and-communications/mobile-phones/the-best-iphone-5c-deals-1250082\">Best iPhone 5C deals</a></p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"the best mobile phone deals\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg\" data-srcset=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg 320w, http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><img class=\"zoomable lft\" src=\"http://cdn3.mos.techradar.futurecdn.net//art/mobile_phones/iPhone/iPhone%205S/iphone%205s%20pressimage-200-100.jpg\" alt=\"mobile phone deals\"></p>", "<p>You could also opt for last year's iPhone flagship - now available with some cheap deals!</p>", "<p><strong>Read our guide:</strong> <a href=\"/news/phone-and-communications/mobile-phones/iphone-5s-deals-1291681\">Best iPhone 5S deals</a></p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"the best mobile phone deals\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg\" data-srcset=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg 320w, http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><img class=\"lft\" src=\"http://cdn3.mos.techradar.futurecdn.net//art/mobile_phones/Samsung/Galaxy%20S6/Samsung%20Galaxy%20S6-200-100.jpg\" alt=\"samsung galaxy s6 is the best phone\"></p>", "<p>Want to pick up Samsung's best ever Galaxy phone? We've got a guide to finding the best deals.</p>", "<p><strong>Read our guide: </strong><a href=\"/news/phone-and-communications/mobile-phones/the-best-samsung-galaxy-s6-deals-in-march-2015-1289708\">Best Samsung Galaxy S6 deals</a></p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"the best mobile phone deals\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg\" data-srcset=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg 320w, http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><img class=\"lft\" src=\"http://cdn1.mos.techradar.futurecdn.net//art/mobile_phones/Samsung/Galaxy%20S6%20Edge/samsung%20galaxy%20s6%20edge%20press-200-100.jpg\" alt=\"s6 edge deals\"></p>", "<p>Want to pick up Samsung's best ever Galaxy phone? We've got a guide to finding the best deals.</p>", "<p><strong>Read our guide: </strong><a href=\"/news/phone-and-communications/mobile-phones/samsung-galaxy-s6-edge-deals-1292011\">Best Samsung Galaxy S6 deals</a></p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"the best mobile phone deals\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg\" data-srcset=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg 320w, http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><img class=\"lft\" src=\"http://cdn2.mos.techradar.futurecdn.net//art/mobile_phones/Samsung/Galaxy%20S5/samsung%20galaxy%20s5-200-100.jpg\" alt=\"galaxy s5 deals\"></p>", "<p>Or if you're looking for last year's Samsung flagship for a lower price, this one could be for you.</p>", "<p><strong>Read our guide:</strong> <a href=\"/news/phone-and-communications/mobile-phones/samsung-galaxy-s5-deals-1291305\">Best Samsung Galaxy S5 deals</a></p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"the best mobile phone deals\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg\" data-srcset=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg 320w, http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><img class=\"lft\" src=\"http://cdn2.mos.techradar.futurecdn.net//art/mobile_phones/HTC/M9/htc%20one%20m9-200-100.jpg\" alt=\"HTC One M9\"></p>", "<p>HTC's amazing new phone is possibly the best looking Android phone ever.</p>", "<p><strong>Read our guide:</strong> <a href=\"/news/phone-and-communications/mobile-phones/the-best-htc-one-m9-deals-in-april-2015-1290081\">Best HTC One M9 deals</a></p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"the best mobile phone deals\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg\" data-srcset=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg 320w, http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><img class=\"lft\" src=\"http://cdn4.mos.techradar.futurecdn.net//art/mobile_phones/HTC/HTC_OneM8/htconem8-200-100.jpg\" alt=\"mobile phone deals\"></p>", "<p>2014's best mobile phone is now available at some great prices. Check out our guide to them here.</p>", "<p><strong>Read our guide:</strong> <a href=\"/news/phone-and-communications/mobile-phones/the-best-htc-one-m8-deals-1238843\">Best HTC One M8 deals</a></p>", "<p><strong>Next page:</strong> <a href=\"/news/phone-and-communications/mobile-phones/mobile-phone-deals-1291413/2\">Great deals on 13 cheap smartphones -----&gt;</a></p>"], "link": "http://www.techradar.com/news/phone-and-communications/mobile-phones/mobile-phone-deals-1291413"},
{"category": ["wearables"], "category2": ["none"], "author": ["Duncan Geere"], "headline": ["'Digital tattoo' can tell machines what you're thinking"], "image": ["http://cdn.mos.techradar.com/classifications/gadgets/future-tech/images/brain-scan-320-80.jpg"], "content": ["<p>Getting computers to do what you want them to can be a tricky task, but an unobtrusive 'digital tattoo' developed by a team of engineers promises to let them read your mind instead.</p>", "<p>Existing brain-scanning equipment, known as <a href=\"http://en.wikipedia.org/wiki/Electroencephalography\">Electroencephalography</a> or EEG for short, is large and bulky - so John Rogers from the University of Illinois set out to build something better. His team has created an EEG system that sticks to the skin behind your ear and discretely monitors your brain activity. </p>", "<p>The device, which is so light that it can stick to the skin without adhesive, can be worn continuously for up to two weeks - until the build-up of dead skin cells underneath makes it drop off. It comprises of a patch of gold electrodes, which read electrical signals from the brain. </p>", "<p>While it's not precise or fast enough to replace our traditional computer input tools yet, volunteers were able to spell the word \"computer\" out on a screen using nothing but their brain's electrical activity during testing.</p>", "<p>Medicine is the first field that the researchers are concentrating on. \"EEG is important in detecting seizures – particularly in premature babies,\" said Rogers in an <a href=\"http://www.newscientist.com/article/mg22630182.200-digital-tattoo-lets-you-control-devices-with-mind-power-alone.html#.VToN-62qpBd\">interview with New Scientist</a>, but he added that many other applications are possible. Especially ones that are more passive than active in nature - like brewing coffee when it detects you're waking up in the morning.</p>", "<p>Down the line, it's possible that it could be used to tell connected devices what we want without consciously doing so. When your phone detects that you're concentrating, it could automatically silence notifications, for example.</p>", "<p>The patch still needs a little work - it was wired up to a computer during tests, but the team believes that wireless transmission of power and data shouldn't be too troublesome, and has already achieved it in other similar devices.</p>"], "link": "http://www.techradar.com/news/wearables/-digital-tattoo-can-tell-machines-what-you-re-thinking-1292014"},
{"category": ["mobileTablet"], "category2": ["none"], "author": ["Ian Morris"], "headline": ["24 best Samsung Galaxy S6 Edge deals in April 2015"], "image": ["http://cdn.mos.techradar.com/art/mobile_phones/Samsung/Galaxy%20S6%20Edge/samsung%20galaxy%20s6%20edge%20press-320-80.jpg"], "content": ["<p>The <a href=\"/reviews/phones/mobile-phones/samsung-galaxy-s6-edge-1286088/review\">Samsung Galaxy S6 Edge</a> is, without doubt, one of the best phones on the market right now. It is also one of the most expensive, with the new curved screen adding to the cost of the device, as well as new memory capacities of 64 and 128GB that have the potential to push up the cost of ownership as well. </p>", "<p>Buying, as an example, your S6 Edge with 64GB of RAM adds £100 to the cost of the 64GB S6. At the moment, Samsung isn't listing the 32GB Edge price, although it will appear at some point with the same price gap. Right now, your cheapest S6 Edge outright buy is £760.</p>", "<p>As a rule, expensive phones like this can work out cheaper on a 24 month tariff than buying the phone and picking up a SIM only deal, so let's check out the best value deal we can find.</p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"samsung galaxy s6 deals\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn1.mos.techradar.futurecdn.net//art/techradar/LINE-320-80.jpg\" data-srcset=\"http://cdn1.mos.techradar.futurecdn.net//art/techradar/LINE-320-80.jpg 320w, http://cdn1.mos.techradar.futurecdn.net//art/techradar/LINE-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><img class=\"lft\" src=\"http://cdn1.mos.techradar.futurecdn.net//art/mobile_phones/Samsung/Galaxy%20S6%20Edge/samsung%20galaxy%20s6%20edge%20press-150-100.jpg\" alt=\"galaxy s6 edge deals\"></p>", "<p><strong>Free phone, unlimited calls, unlimited texts, 10GB of data, £59pm<br></strong>Plenty of data here, but a very steep total cost of ownership. Mind you, if you take of the cash value of the phone maths tells us you're paying £27 per month for this tariff alone.</p>", "<p><strong>Build your own deal:</strong> <a href=\"/reviews/phones/mobile-phones/samsung-galaxy-s6-edge-1286088/price-comparison\">TechRadar's Samsung Galaxy S6 Edge comparison charts</a></p>", "<p><strong>Best Samsung Galaxy S6 Edge deals by network...</strong></p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"samsung galaxy s6 deals\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn1.mos.techradar.futurecdn.net//art/techradar/LINE-320-80.jpg\" data-srcset=\"http://cdn1.mos.techradar.futurecdn.net//art/techradar/LINE-320-80.jpg 320w, http://cdn1.mos.techradar.futurecdn.net//art/techradar/LINE-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><img class=\"lft\" src=\"http://cdn0.mos.techradar.futurecdn.net//art/mobile_phones/Phone%20deals%20UK/Best%20iPhone%206%20deals/ee-150-100.gif\" alt=\"iPhone 6 deals on EE\"></p>", "<p><strong>EE is the network to go to if you want high-speed 4G</strong></p>", "<p><strong>Deal 1: £49.99 phone, unlimited minutes, unlimited texts, 10GB of data, £53.49pm<br></strong>This deal is cheaper than Vodafone's above, but you do have to pay £50 for the phone. The cost is less in total though, and it has a massive amount of included data.</p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"galaxy s6 deals\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg\" data-srcset=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg 320w, http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><strong>Deal 2: £350 phone, unlimited minutes, unlimited texts, 4GB of data, £28.49pm<br></strong>This is a smashing deal, but the up-front cost will put some off. What you get though is low total costs over the 24 month period and a reasonable £28.49 monthly fee. Data allowance is generous too.</p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"galaxy s6 deals\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg\" data-srcset=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg 320w, http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><strong>Deal 3: £200 phone, 1000 minutes, unlimited texts, 2GB, £38.49pm<br></strong>Moderate cost over two years, but has more than enough calls and texts, plus the phone comes in gold, which is a lovely colour if a bit of a fingerprint magnet.</p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"galaxy s6 deals\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg\" data-srcset=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg 320w, http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"samsung galaxy s6 deals\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn1.mos.techradar.futurecdn.net//art/techradar/LINE-320-80.jpg\" data-srcset=\"http://cdn1.mos.techradar.futurecdn.net//art/techradar/LINE-320-80.jpg 320w, http://cdn1.mos.techradar.futurecdn.net//art/techradar/LINE-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><img class=\"lft\" src=\"http://cdn4.mos.techradar.futurecdn.net//art/mobile_phones/Phone%20deals%20UK/Best%20iPhone%206%20deals/o2-150-100.gif\" alt=\"iphone 6 deals on o2\"></p>", "<p><strong>O2 is the network with extras, including the popular O2 Priority service</strong></p>", "<p><strong>Deal 1: £129.99 phone, unlimited minutes, unlimited texts, 10GB of data, £59pm<br></strong>If you want the S6 Edge on O2 you won't be getting the handset for free. This is the cheapest deal we have found so far. Good amount of data included and you get the 128GB handset, so plenty of room for your music and videos.</p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"galaxy s6 deals\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg\" data-srcset=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg 320w, http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><strong>Deal 2: £299.99 phone, unlimited minutes, unlimited texts, 1GB of data, £32.50pm<br></strong>A much cheaper deal than most but requires a £300 up-front payment for the phone. The lifetime cost is one of the lower ones we've seen though and it's a 128GB handset too.</p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"galaxy s6 deals\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg\" data-srcset=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg 320w, http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><strong>Deal 3: £249.99 phone, unlimited minutes, unlimited texts, 10GB of data, £49pm<br></strong>Like the other deals, this is for a 128GB phone so its slightly higher price is somewhat more appealing than other tariffs, most of which are offering the 64GB model.</p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"galaxy s6 deals\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg\" data-srcset=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg 320w, http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"samsung galaxy s6 deals\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn1.mos.techradar.futurecdn.net//art/techradar/LINE-320-80.jpg\" data-srcset=\"http://cdn1.mos.techradar.futurecdn.net//art/techradar/LINE-320-80.jpg 320w, http://cdn1.mos.techradar.futurecdn.net//art/techradar/LINE-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><img class=\"lft\" src=\"http://cdn4.mos.techradar.futurecdn.net//art/mobile_phones/Phone%20deals%20UK/Best%20iPhone%206%20deals/voda-150-100.gif\" alt=\"vodafone\"></p>", "<p><strong>Vodafone prides itself in coverage and quality, it's often a bit mean with data, but there are extras like Spotify and Sky Sports Mobile thrown in. </strong></p>", "<p><strong>Deal 1: Free phone, unlimited minutes, unlimited texts, 10GB of data, £59pm<br></strong>If you want a phone without up-front charges this is your best option on Vodafone. It's a good tariff too, with plenty of data but the lifetime cost is pretty high.</p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"galaxy s6 deals\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg\" data-srcset=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg 320w, http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><strong>Deal 2: £199.99 phone, 1000 minutes, unlimited texts, 1GB of data, £35pm<br></strong>By far the best price for the S6 Edge on Vodafone, but less data than we'd really like to see. There are a choice of colours too, unlike some of the deals.</p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"galaxy s6 deals\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg\" data-srcset=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg 320w, http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><strong>Deal 3: £79.99 phone, unlimited minutes, unlimited texts, 4GB of data, £49pm<br></strong>This deal offers more data than the budget ones, but doesn't come in too expensive over the lifetime of the contract.</p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"galaxy s6 deals\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg\" data-srcset=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg 320w, http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"samsung galaxy s6 deals\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn1.mos.techradar.futurecdn.net//art/techradar/LINE-320-80.jpg\" data-srcset=\"http://cdn1.mos.techradar.futurecdn.net//art/techradar/LINE-320-80.jpg 320w, http://cdn1.mos.techradar.futurecdn.net//art/techradar/LINE-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><img class=\"lft\" src=\"http://cdn4.mos.techradar.futurecdn.net//art/mobile_phones/Phone%20deals%20UK/Best%20iPhone%206%20deals/three-150-100.gif\" alt=\"iphone 6 deals on Three\"></p>", "<p><strong>Three is one of few providers that offers unlimited data, and Feel at Home is amazing for regular travellers. </strong></p>", "<p><strong>Deal 1: £49 phone, unlimited minutes, unlimited texts, 1GB of data, £48pm<br></strong>Three isn't often the cheapest for phone and contract deals, but this offer isn't bad over 24 months. The data allowance is a little mean though.</p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"galaxy s6 deals\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg\" data-srcset=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg 320w, http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><strong>Deal 2: £49 phone, unlimited minutes, unlimited texts, 2GB of data, £50pm<br></strong>The cost of having twice as much data as deal one is about £48 over two years, or two quid per month. You'd be silly not to go for this one really.</p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"galaxy s6 deals\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg\" data-srcset=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg 320w, http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><strong>Deal 3: £49 phone, unlimited minutes, unlimited texts, unlimited data, £55pm<br></strong>The only tariff in the UK with unlimited data doesn't come cheap, but it's also well-priced in comparison to other network deals with much less data. One for the Netflix streamer.</p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"galaxy s6 deals\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg\" data-srcset=\"http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-320-80.jpg 320w, http://cdn0.mos.techradar.futurecdn.net//art/techradar/LINE2-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>"], "link": "http://www.techradar.com/news/phone-and-communications/mobile-phones/samsung-galaxy-s6-edge-deals-1292011"},
{"category": ["hardware"], "category2": ["none"], "author": ["Duncan Geere"], "headline": ["Solar power turns saltwater drinkable"], "image": ["http://cdn.mos.techradar.com/classifications/world%20of%20tech/solar-flare-320-80.jpg"], "content": ["<p>There's more than enough freshwater on Earth for humans to survive - but the problem is that it isn't very well-distributed. Northerly and equatorial countries have loads of it, but those in between are growing increasingly parched.</p>", "<p>To address this issue, the United States Agency for International Development <a href=\"https://www.bostonglobe.com/business/2015/04/16/mit-team-makes-clean-water-from-sun/W7SYjat7GfHAsEGE4TyFOP/story.html\">launched a competition</a> to create an affordable desalination system. Entrants were judged on three criteria - their designs had to be cost-effective, energy-efficient and environmentally sustainable.</p>", "<p>The winners of this competition have <a href=\"http://www.popsci.com/award-winning-team-cleans-water-supplies-power-sun\">now been announced</a>, with a team from MIT taking home the $140,000 first prize. They created a system that uses solar panels to charge batteries, which then are used to draw dissolved salt particles (which have a slight electric charge) out of the water. As well as pulling out the salt, the team exposed the water to ultraviolet light - which destroys bacteria and makes it safer to drink. </p>", "<p>Most desalination plants use a technique called reverse osmosis to remove salt - using high pressure pumps. But this is an inefficient method, wasting 40 percent of the water. With MIT's method, just 5 percent of water is lost.</p>", "<p>The team has built their technique into a single robust unit that can supply enough water every day to either irrigate a small farm or satisfy the drinking and cooking needs of up to 5,000 people. It's powered exclusively by the sun.</p>", "<p>While the unit has been tested extensively in the United States, it hasn't yet been proved in the areas where it's need the most. A pilot project, involving rural farmers in the areas where the US Agency for International Development operates, will be the next step.</p>"], "link": "http://www.techradar.com/news/world-of-tech/solar-power-turns-saltwater-drinkable-1292031"},
{"category": ["software"], "category2": ["business"], "author": ["James Peckham"], "headline": ["Google Maps has just turned into one big Apple troll fest"], "image": ["http://cdn.mos.techradar.com/art/internet/Google/Maps/Android-Pakistan-320-80.jpg"], "content": ["<p>Right now if you head into <a href=\"https://www.google.com/maps/place/33%C2%B030'52.5%22N+73%C2%B003'33.2%22E/@33.5145689,73.0603892,16z/data=!4m2!3m1!1s0x0:0x0?hl=en\">Google Maps</a> and look for the city of Rawlpindi in Pakistan you'll be able to find a rather strange image.</p>", "<p>Just to the south of the city is the iconic Android robot logo peeing on its main competitor, the Apple logo.</p>", "<p>It isn't currently clear why it's there or even why it's been added to Google Maps at all – it's certainly been made by a Google employee as it's in the base terrain information which can't be edited by the public.</p>", "<p>If you head east for a couple of miles you'll also find <a href=\"https://www.google.com/maps/@33.501483,73.1280949,17z\">an image stating</a> \"Google review policy is crap\" with a sad face to the side.</p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"Android logo\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn4.mos.techradar.futurecdn.net//art/internet/Google/Maps/Google-Review-policy-320-80.jpg\" data-srcset=\"http://cdn4.mos.techradar.futurecdn.net//art/internet/Google/Maps/Google-Review-policy-320-80.jpg 320w, http://cdn4.mos.techradar.futurecdn.net//art/internet/Google/Maps/Google-Review-policy-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p>Now the internet is ablaze with those hunting for more hidden messages from the hacker but so far nothing else has been found.</p>"], "link": "http://www.techradar.com/news/internet/google-maps-has-just-turned-into-one-big-apple-troll-fest-1292041"},
{"category": ["hardware"], "category2": ["none"], "author": ["Duncan Geere"], "headline": ["Future of 'killer robots' remains uncertain"], "image": ["http://cdn.mos.techradar.com/art/internet/Google/terminator_robots-320-80.jpg"], "content": ["<p>A lengthy conference aiming to lay down rules on what role lethal autonomous weapons systems can play in future warfare has <a href=\"http://phys.org/news/2015-04-lines-drawn-legality-killer-robots.html\">failed to come to an agreement</a>. </p>", "<p>The week-long meeting in Geneva aimed to agree key definitions that would be necessary to word a protocol to restrict the use of so-called 'killer robots'. While the discussion was deeper than previous attempts to draw up regulations, there was no agreement between nations.</p>", "<p>Activists, including the <a href=\"http://www.stopkillerrobots.org/\">Campaign to Stop Killer Robots</a>, are hoping for a complete ban on the practice. That view is shared by some countries, including Cuba and Ecuador.</p>", "<p>But Britain, which has a national interest in the use of drone technology thanks to BAE systems, is opposed to such a ban and may use its influence to block a protocol completely. The UK argues that existing humanitarian laws are sufficient to regulate the technology.</p>", "<p>A key point of dispute is over whether machines can be programmed to observe the principles of humanitarian law - like <a href=\"https://www.icrc.org/customary-ihl/eng/docs/v1_cha_chapter1_rule1\">distinction</a>, <a href=\"https://www.icrc.org/customary-ihl/eng/docs/v1_cha_chapter4_rule14\">proportionality</a> and <a href=\"https://www.icrc.org/customary-ihl/eng/docs/v1_cha_chapter5_rule15\">precautions</a>. The UK believes that one day they will, and so research into the technology should not be banned. </p>", "<p>Most countries agree that autonomous weapons that operate without \"meaningful human control\" are unwelcome, but no-one can agree on how that phrase should be defined - let alone what \"autonomous\" means.</p>", "<p>While the conference did move the debate forward on how we'll be waging wars in the future, there's still a long way to go.</p>"], "link": "http://www.techradar.com/news/world-of-tech/future-tech/future-of-killer-robots-remains-uncertain-1292050"},
{"category": ["hardware"], "category2": ["none"], "author": ["Jeremy Laird"], "headline": ["10 best graphics cards in the world today"], "image": ["http://cdn.mos.techradar.com/art/Best%20Ofs/GraphicsCards-320-80.jpg"], "content": ["<p>Are you a PC gamer? Then trust us on this: there is no other component nearly as important as the graphics card.</p>", "<p>Yes, your monitor and even your mouse matter. But nothing has more impact on both frame rates and fun than your graphics card. Problem is, at any moment there are scores of cards to choose from and they typically all claim to have pixel-pushing perfection.</p>", "<p>The simple solution is to buy the very best. But that also means the most expensive. For most of us, then, it's all about bang-for-buck at a given budget. Just remember to think carefully about how you match your graphics card with the rest of your PC.</p>", "<p>If you have a super-high resolution monitor, for instance, you're going to need a high-end graphics card to make the most of it. But, equally, there's little point unloading on the finest GPU money can buy if its being bottlenecked by an old CPU or feeding a feeble screen.</p>", "<p>With all that in mind, here's our guide to not only the fastest, but also the best value PC graphics you can buy.</p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"Best Graphics Cards\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn3.mos.techradar.futurecdn.net//art/Best%20Ofs/Best%20Video%20Cards/Titan_x-320-80.jpg\" data-srcset=\"http://cdn3.mos.techradar.futurecdn.net//art/Best%20Ofs/Best%20Video%20Cards/Titan_x-320-80.jpg 320w, http://cdn3.mos.techradar.futurecdn.net//art/Best%20Ofs/Best%20Video%20Cards/Titan_x-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><strong>The fastest and the finest single-GPU graphics card on the planet</strong></p>", "<p><strong>Price:</strong> around £870</p>", "<p>What was that we were saying about excessively expensive graphics cards? The Titan X ain't cheap. Not even nearly. But then the best never is. And make no mistake, the Titan X is clearly, undeniably, indisputably the best single-GPU graphics card you can buy. This time around, Nvidia has given us a Titan card that's purely for gaming and it's all the better for it. Yes, there are cards with two GPUs on board that can better it in some tests. But they are also less reliable. Money no object, it's the board we'd buy – except we'd have two of 'em!</p>", "<p><strong>Which board to buy:</strong></p>", "<p>Unless you go for an exotic custom-cooled effort, Titan X's are all the same, so you may as well grab something like <a href=\"http://www.overclockers.co.uk/showproduct.php?prodid=GX-207-OK&amp;groupid=701&amp;catid=1914&amp;subcat=1576\" rel=\"nofollow\">Overclockers UK own-brand effort</a>, which is about a cheap as they come, if you can call £870 cheap.</p>", "<p><strong>All the graphics grunt you'll ever actually need</strong></p>", "<p><strong>Price:</strong> Around £255</p>", "<p>Diminishing returns are an occupational hazard for every PC gamer when it comes to buying a graphics card. And the Nvidia GeForce GTX 970 is the point beyond which things go south. This is a stupendously powerful graphics card based on what we think is the best 3D tech currently available – Nvidia Maxwell architecture. There are faster cards. But especially if you are playing games at 1080p or even 1440p, most of the time, you won't notice the difference. And if you've heard about the whole 3.5GB versus 4GB fracas with the 970, don't let it bother you. It was inelegant of Nvidia, but it doesn't change what we think about the 970.</p>", "<p><strong>Which board to buy:</strong></p>", "<p>The 970 isn't exactly cheap. But it's still something of a value proposition. So we like the look of the aggressively priced <a href=\"http://www.amazon.co.uk/Gainward-GTX970-Maxwell-Express-Graphics/dp/B00NQ85T1S/ref=sr_1_2?ie=UTF8&amp;qid=1427873956&amp;sr=8-2&amp;keywords=gainward+gtx+970\" rel=\"nofollow\">Gainward model on Amazon</a>.</p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"Best Graphics Cards\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn1.mos.techradar.futurecdn.net//art/Best%20Ofs/Best%20Video%20Cards/AMD%20R9%20290-320-80.jpg\" data-srcset=\"http://cdn1.mos.techradar.futurecdn.net//art/Best%20Ofs/Best%20Video%20Cards/AMD%20R9%20290-320-80.jpg 320w, http://cdn1.mos.techradar.futurecdn.net//art/Best%20Ofs/Best%20Video%20Cards/AMD%20R9%20290-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><strong>A proper high-end GPU at a price you can (possibly) afford</strong></p>", "<p><strong>Price:</strong> around £220</p>", "<p>if you want a simple rule for buying graphics cards, it's this. Grab a slightly cut-down version of a flagship GPU a year or so after it goes on sale. That way you get all the high end features for both less than the price of the very top model and after the original launch price has inevitably cooled off. Enter, therefore the AMD Radeon R9 290. It's one rung down in AMD graphics hierarchy after the mighty 290X. But it's still a proper high-end bruiser, complete with a monster 512-bit memory bus and 4GB of graphics memory – all the better for running at high resolutions providing a bit of future proofing.</p>", "<p><strong>Which board to buy:</strong></p>", "<p>The reference cooler that AMD cooked up for the 290 was a bad joke. So go with something like <a href=\"http://www.amazon.co.uk/Sapphire-Radeon-Graphics-Express-Display/dp/B00IWFKEL0/ref=sr_1_6?ie=UTF8&amp;qid=1427162021&amp;sr=8-6&amp;keywords=radeon+r9+290+sapphire\" rel=\"nofollow\">Sapphire's Tri-X</a> and its super-silent fans and factory overclock.</p>", "<p><strong>It's an oldie, but for 1080p gaming it's still a goodie</strong></p>", "<p><strong>Price:</strong> around £150</p>", "<p>Sticking with the cut-down flagship theme, our next candidate comes from what is effectively AMD's previous generation of graphics cards. What was once the Radeon HD 7970 has been, in effect, rebranded R9 280. But here's the thing. AMD hasn't changed its graphics tech for a few years. So in terms of features, you miss out on little to nothing. What you do get is no fewer than 1,792 stream processors, a 384-bit memory bus that even Nvidia's GTX 980 can't match and a decent 3GB lump of graphics memory. And all for an eminently reasonable £150. A great choice for slick 1080p gaming. It's not a bad choice for 1440p gaming on the cheap, too. </p>", "<p><strong>Which board to buy:</strong></p>", "<p>Luckily, pretty much all 280s now come with fancy custom coolers. That includes<a href=\"http://www.overclockers.co.uk/showproduct.php?prodid=GX-251-MS&amp;groupid=701&amp;catid=56&amp;subcat=1842\" rel=\"nofollow\"> MSI's Radeon R9 280 Gaming</a>, which just squeaks in under the £150 barrier.</p>", "<p>Read our full <a href=\"/reviews/pc-mac/pc-components/graphics-cards/asus-radeon-r9-280-directcu-ii-top-1250654/review\">AMD Radeon R9 280 review</a></p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"Best Graphics Cards\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn0.mos.techradar.futurecdn.net//art/Best%20Ofs/Best%20Video%20Cards/NVIDIA_GeForce_GTX_770-3qtr-320-80.jpg\" data-srcset=\"http://cdn0.mos.techradar.futurecdn.net//art/Best%20Ofs/Best%20Video%20Cards/NVIDIA_GeForce_GTX_770-3qtr-320-80.jpg 320w, http://cdn0.mos.techradar.futurecdn.net//art/Best%20Ofs/Best%20Video%20Cards/NVIDIA_GeForce_GTX_770-3qtr-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><strong>Grab a graphics bargain while you still can</strong></p>", "<p><strong>Price:</strong> around £220</p>", "<p>If you like the look of the Nvidia GeForce GTX 770, and we can understand why you would, get your skates on. It won't be available for much longer. Like AMD's 280 chipset, the GTX 770 falls into that cut-down, previous-gen flagship slot that usually serves up such good value. At launch a couple of years ago, the 770 was priced well above £300 and was very nearly as quick as PC graphics got. Today, it remains a seriously speedy card, but it's yours for not much more than £200. On the downside, it lacks Nvidia's awesome new Maxwell architecture. But it still offers great performance at standard clockspeeds and usually overclocks like a monster, too.</p>", "<p><strong>Which board to buy:</strong></p>", "<p>It makes sense to keep the 770 as cheap as possible, so <a href=\"http://www.amazon.co.uk/GeForce-DirectCU-Graphics-Express-Display/dp/B00D3F7CFK/ref=sr_1_1?ie=UTF8&amp;qid=1427162878&amp;sr=8-1&amp;keywords=gtx+770\" rel=\"nofollow\">Asus's Direct CU</a> for £220 makes a lot of sense. Just be aware that the 2GB frame buffer isn't ideal for really high resolutions.</p>", "<p><strong>So nearly a gaming great, shame about that pesky memory bus</strong></p>", "<p><strong>Price: </strong>around £150</p>", "<p>From hear on in, our recommendations come with an increasing number of qualifiers. The Nvidia GeForce GTX 960 is one of those cards we desperately wanted to like. After all, it's a more affordable version of its killer Maxwell graphics architecture, but still absolutely aimed at full-featured gaming, right down to its 1,024 CUDA cores. There is, however, a snag. Nvidia has seen fit to bequeath the 960 with a stingy 128-bit memory bus. That makes it a very hard sell for high resolution gaming including anything beyond 1080p. We also worry about how well the 960 will hold up when even more bandwidth-hungry games are inevitably launched in future.</p>", "<p><strong>Which card to buy:</strong></p>", "<p>A factory overclocked 960 card for just under £155? What's not to like about the <a href=\"http://www.pixmania.co.uk/graphics-card/gainward-geforce-gtx-960-oc-graphics-card-2-gb-gddr5-pci-express-3-0-gw-gtx960-2gb-3392/22447866-a.html?ectrans=1&amp;gclid=CjwKEAjwru6oBRDDp4jRj4bL_xASJADJ2obyYNnp-BU24CDncKE5u2kn4SapeD7bszJU61BcretHBhoCl0Dw_wcB#merch=1&amp;srcid=11270\" rel=\"nofollow\">Gainward GTX 960 2GB</a>?</p>", "<p><strong>Budget pricing, console-crushing graphics performance.</strong></p>", "<p><strong>Price:</strong> around £115</p>", "<p>Like it or loathe it, the latest games consoles from Sony and Microsoft set the minimum standard for most games developers. But the good news is that you can have a graphics based on exactly the same AMD technology as seen in both of the latest gaming boxes for not a great deal more than £100. Except this AMD board packs 1,280 of those all-important shaders, to the Sony PS4's 1,152 and the <a href=\"/xbox\" title=\"Xbox\">Xbox</a> One's measly 768 cores. Nice. What's more, the 270 gets one over on Nvidia's GTX 960, too, thanks to its pukka 256-bit memory bus. All round, it's a very nice little package for the price. Our only real worry is whether 2GB of graphics memory is truly good enough these days.</p>", "<p><strong>Which board to buy:</strong></p>", "<p>While we'd like to recommend a 270 with more memory, they're much more pricey, too. So a <a href=\"http://www.overclockers.co.uk/showproduct.php?prodid=GX-169-PC&amp;groupid=701&amp;catid=56&amp;subcat=1982\" rel=\"nofollow\">Powercolor TurboDUO 2GB</a> it is.</p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"Best Graphics Cards\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn2.mos.techradar.futurecdn.net//art/Best%20Ofs/Best%20Video%20Cards/amd%20r9%20280-320-80.jpg\" data-srcset=\"http://cdn2.mos.techradar.futurecdn.net//art/Best%20Ofs/Best%20Video%20Cards/amd%20r9%20280-320-80.jpg 320w, http://cdn2.mos.techradar.futurecdn.net//art/Best%20Ofs/Best%20Video%20Cards/amd%20r9%20280-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><strong>A seriously sweet card, assuming you can afford it.</strong></p>", "<p><strong>Price:</strong> around £430</p>", "<p>Nvidia's Maxwell graphics technology is almost too good for our liking. Take the GTX 980 board. It's one hell of a graphics card, beaten only by Nvidia's own Titan X beast, a card that costs almost twice as much. And yet, at its heart, the 980 is really a mid-range graphics chip. It's just so darned good, Nvidia can get away with charging well over £400. Most of the time, that probably doesn't matter. If the 980 is quick, who cares how that is achieved. However, the telltale that gives away the 980 arguable mid-range status is a relatively stingy 256-bit memory bus, a feature AMD matches on its lowly R9 270 board for a quarter the price. Ouch.</p>", "<p><strong>Which board to buy:</strong></p>", "<p>Most 980 boards rock in around £430 or more. But the custom-cooled <a href=\"http://www.amazon.co.uk/Palit-GeForce-Jetstream-Graphics-Express/dp/B00O9EVSO0/ref=sr_1_6?ie=UTF8&amp;qid=1427165721&amp;sr=8-6&amp;keywords=gtx+980\" rel=\"nofollow\">Palit GTX 980 Jetstream</a> can currently be had for £400.</p>", "<p><strong>A bonkers dual-GPU board that might just make sense</strong></p>", "<p><strong>Price: </strong>around £500</p>", "<p>Normally, any suggestion that a £500 graphics card is a bit of a bargain would seem a bit bonkers. But try this for size. The AMD Radeon R9 295 X2 is over £300 cheaper than Nvidia's mighty new Titan X board. But it beats it in most benchmarks. The explanation, of course, is that the 295 X2 is a dual-GPU card and uses AMD's CrossfireX technology to get them working together to produce mega frame rates. The problem, which isn't unique to AMD but is also shared by Nvidia's similar SLI tech, is that running multiple GPUs doesn't always work. And when that happens, you suddenly have a £500 card that's giving your about £250's worth of performance.</p>", "<p><strong>Which board to buy:</strong></p>", "<p>The 295 X2 comes water cooled as standard, so you may as well buy the cheapest, one of which is <a href=\"http://www.overclockers.co.uk/showproduct.php?prodid=GX-350-SP&amp;groupid=701&amp;catid=56&amp;subcat=1515\" rel=\"nofollow\">Sapphire's sub-£500 effort</a>.</p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"Best Graphics Cards\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn4.mos.techradar.futurecdn.net//art/Best%20Ofs/Best%20Video%20Cards/Nv%20750Ti-320-80.jpg\" data-srcset=\"http://cdn4.mos.techradar.futurecdn.net//art/Best%20Ofs/Best%20Video%20Cards/Nv%20750Ti-320-80.jpg 320w, http://cdn4.mos.techradar.futurecdn.net//art/Best%20Ofs/Best%20Video%20Cards/Nv%20750Ti-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><strong>The little card that started a big revolution in graphics</strong></p>", "<p><strong>Price:</strong> around £100</p>", "<p>This, arguably, is where proper PC gaming starts. The Nvidia GeForce GTX 750Ti is no big-bandwidth beast with a memory bus a mile wide. But it was the very first card to appear with Nvidia's incredible Maxwell graphics tech. And that means it definitely punches above its weight. For a card with just 640 CUDA cores (remember, the new Titan X has over 3,000), it does one hell of a job. Definitely don't try gaming beyond 1080p and definitely don't expect to play with every eye-candy option cranked up. But if you keep your expectations realistic, you might just be surprised at the amount of gaming grunt on offer for just £100.</p>", "<p><strong>Which board to buy:</strong></p>", "<p>We're suckers for a fancy looking cooler and some factory overclocking. So why not grab the <a href=\"http://www.amazon.co.uk/EVGA-1176MHz-1255MHz-5400MHz-Graphics/dp/B00IGQ4Z3S/ref=sr_1_2?ie=UTF8&amp;qid=1427168632&amp;sr=8-2&amp;keywords=gtx+750+ti\" rel=\"nofollow\">EVGA GTX 750TI SC</a> for a mere £110.</p>"], "link": "http://www.techradar.com/news/computing-components/graphics-cards/best-graphics-cards-1291458"},
{"category": ["hardware"], "category2": ["none"], "author": ["James Peckham"], "headline": ["We've seen Edward Snowden's laptop and you should too"], "image": ["http://cdn.mos.techradar.com/art/other/Edward-Snowden's-Laptop-320-80.jpg"], "content": ["<p>I spent yesterday evening at showing of the V&amp;A Museum's latest exhibition entitled <a href=\"http://www.vam.ac.uk/content/exhibitions/all-of-this-belongs-to-you/all-of-this-belongs-to-you/\">All of This Beings to You</a> – and there is one highlight I'd recommend any technology fan checks out.</p>", "<p></p>", "<p>That exact <a href=\"/macbook-air\" title=\"MacBook Air\">MacBook Air</a> is now on display in all its damaged glory after The Guardian journalists took to it with angle grinders and drills in a display to British security agency GCHQ.</p>", "<p>The act was called \"a peculiarly pointless piece of symbolism\" by Editor of The Guardian, Alan Rusbridger.</p>", "<p>It's a curious piece of modern history and this little computer undeniably changed the world and the way we trust Western government.</p>", "<p>The exhibition is designed to \"explore the role of design and architecture in defining civic identity, technology, security, citizenship, democracy, the public realm and urban experience.\"</p>", "<p>It was opened up for the evening to promote the new <a href=\"/news/mobile-computing/tablets/silent-circle-introduces-ultra-secure-tablet-and-blackphone-2-1286755\">BlackPhone 2</a> as the original <a href=\"/reviews/phones/mobile-phones/blackphone-1228305/review\">BlackPhone</a> also features in the exhibit alongside the Onion Pi, Cryptophone, the WikiLeaks scarf and the phenomenon of the selfie stick.</p>", "<p>The exhibit will be running until July 19 this year – plus it's free to enter – so get down there now to check it out.</p>"], "link": "http://www.techradar.com/news/computing/we-ve-seen-edward-snowden-s-laptop-and-you-should-too-1292022"},
{"category": ["software"], "category2": ["none"], "author": ["Kate Solomon"], "headline": ["Spotify knows when you've hit your midlife crisis"], "image": ["http://cdn.mos.techradar.com/art/internet/Music/Spotify/spotify_playlists_browse-320-80.jpg"], "content": ["<p>You don't really know who you are until you hit your thirties - that's the finding from Spotify's latest data-crunching project. </p>", "<p>Looking at music tastes across the ages of its listeners and relating them to the popularity of the artists they listen to, the music service <a href=\"http://skynetandebert.com/2015/04/22/music-was-better-back-then-when-do-we-stop-keeping-up-with-popular-music/\">came up with</a> the shocking revelation that that the older we get, the less we listen to pop music. Its teenage users listen to popular music almost exclusively, and its middle-aged male users listen to the most obscure stuff.</p>", "<p>Men tend to skip out on pop music more quickly than women with a sharp decline into lesser-known acts happening quite quickly in their 20s, while women seem more likely to mix and match between chart music and less well-known stuff. </p>", "<p>Spotify reckons this is down to the fact you don't really know your tastes until you're in your thirties: \"For the average listener, by their mid-30s, their tastes have matured, and they are who they're going to be.\"</p>", "<p>Interestingly, both women and men dip back into more popular artists when they hit their 40s - to which we say, put some Carly Rae on and just embrace that mid-life crisis. </p>", "<p class=\"youtube-video\"> <object width=\"580\" height=\"356\"> <param name=\"movie\" value=\"http://www.youtube.com/v/qV5lzRHrGeg&amp;hl=en&amp;fs=1\"><param name=\"allowFullScreen\" value=\"true\"><param name=\"allowscriptaccess\" value=\"always\"><embed src=\"http://www.youtube.com/v/qV5lzRHrGeg&amp;hl=en&amp;fs=1\" type=\"application/x-shockwave-flash\" allowscriptaccess=\"always\" allowfullscreen=\"true\" width=\"580\" height=\"356\"></embed></object> </p>"], "link": "http://www.techradar.com/news/internet/spotify-knows-when-you-ve-hit-your-midlife-crisis-1292001"},
{"category": ["hardware"], "category2": ["none"], "author": ["Duncan Geere"], "headline": ["Bored of 3D printing? Get ready for 4D printing"], "image": ["http://cdn.mos.techradar.com/art/Randoms/4dprinting-320-80.jpg"], "content": ["<p>The ever expanding world of object printing has just added another dimension. Researchers at the University of Wollongong <a href=\"http://media.uow.edu.au/releases/UOW191978.html?ssSourceSiteId=UOW_Main\">are building 3D printers</a> that can create objects that change over time - a technique they're calling '4D printing'.</p>", "<p>In a normal 3D printer, structures are built up layer by layer into a pre-programmed shape. Normally plastic is used, but other substances can also be printed too - like sugar, or <a href=\"/news/world-of-tech/future-tech/scientists-have-3d-printed-heart-and-liver-organoids-that-could-save-your-life-1291548\">cellular material</a>.</p>", "<p>The Australian team chose tough hydrogels that change their properties when exposed to heat and moisture, and used them to 3D-print a smart valve that can control water flow. Cold water flows through normally, but it closes when hot water is detected.</p>", "<p>The immediate application for the work will be in the field of soft robotics, but it's thought that similar techniques could be used in medicine, construction, and automation.</p>", "<p>\"The cool thing about it is that it's a working, functioning device that you just pick up from the printer,\" said one of the researchers - Marc in het Panhuis. \"There's no other assembly required. It's an autonomous valve, there's no input necessary other than water.\"</p>", "<p>Their research was published in <a href=\"http://onlinelibrary.wiley.com/doi/10.1002/marc.201500079/abstract\">Macromolecular Rapid Communications</a>.</p>"], "link": "http://www.techradar.com/news/world-of-tech/bored-of-3d-printing-get-ready-for-4d-printing-1292005"},
{"category": ["hardware"], "category2": ["none"], "author": ["Rod Lawton"], "headline": ["10 best compact cameras of 2015"], "image": ["http://cdn.mos.techradar.com/art/cameras/Sony/RX10/RX10_Zoom_Flat-320-80.jpg"], "content": ["<p>Compact cameras come in so many different types and sizes that it's hard to choose the right one, or even know where to start. </p>", "<p>A 'compact' camera, to most people, is one you can slip into a pocket, though technically it's any digital camera with a non-removable lens – so that includes DSLR-style superzoom 'bridge' cameras and high-powered expert cameras for enthusiasts. </p>", "<p>There are so many choices it quickly gets confusing – so we've picked out what we think are the top 10 best compact cameras on the market, in all price brackets, and why.</p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"Panasonic LX100\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn2.mos.techradar.futurecdn.net//art/cameras/Panasonic/Panasonic%20LX100/Press%20shots/Panasonic_LX100_16x9-320-80.jpg\" data-srcset=\"http://cdn2.mos.techradar.futurecdn.net//art/cameras/Panasonic/Panasonic%20LX100/Press%20shots/Panasonic_LX100_16x9-320-80.jpg 320w, http://cdn2.mos.techradar.futurecdn.net//art/cameras/Panasonic/Panasonic%20LX100/Press%20shots/Panasonic_LX100_16x9-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><strong>A compact masterpiece, with a, big sensor, classic controls, fast zoom and even a viewfinder</strong></p>", "<p><strong>Sensor:</strong> Micro Four Thirds, 12.8MP | <strong>Lens:</strong> 24-75mm, f/1.7-2.8 | <strong>Monitor:</strong> 3-inch, 921K dots | <strong>Viewfinder:</strong> Yes | <strong>Continuous shooting: </strong>11fps | <strong>Movies:</strong> 4K | <strong>User level:</strong> Expert</p>", "<p>Keen photographers usually go for a DSLR or a compact system camera, but they also want something that will slip in a pocket for those days when the big camera needs to stay at home. Usually, that means putting up with a smaller sensor – but not this time. Somehow, Panasonic has shoehorned a CSC-sized Micro Four Thirds sensor into a compact camera body. Not only that, it's added an aperture ring on the lens, a shutter speed dial on the top AND an electronic viewfinder. It has a specially-designed super-compact wide-aperture lens and it can shoot 4K too. Expensive, but amazing and unique.</p>", "<p><strong>Read:</strong> <a href=\"/reviews/cameras-and-camcorders/cameras/compact-cameras/panasonic-lx100-1264690/review\">Panasonic LX100 review</a></p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"Fuji X30\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn4.mos.techradar.futurecdn.net//art/cameras/Fujifilm/Fuji%20X30/Fuji_X30_Silver_Front_Left-320-80.jpg\" data-srcset=\"http://cdn4.mos.techradar.futurecdn.net//art/cameras/Fujifilm/Fuji%20X30/Fuji_X30_Silver_Front_Left-320-80.jpg 320w, http://cdn4.mos.techradar.futurecdn.net//art/cameras/Fujifilm/Fuji%20X30/Fuji_X30_Silver_Front_Left-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><strong>A compact camera for enthusiasts that's packed with features and style but still affordable</strong></p>", "<p><strong>Sensor:</strong> 2/3-inch X-Trans, 12MP | <strong>Lens: </strong>28-112mm, f/2.0-2.8 | <strong>Monitor:</strong> 3-inch tilting, 920K dots | <strong>Viewfinder: </strong>EVF | <strong>Continuous shooting: </strong>12fps | <strong>Movies:</strong> 1080 | <strong>User level: </strong>Intermediate/Expert</p>", "<p>But you don't have to pay a fortune for a top-quality high-end compact camera. We like the Sony RX100 III with its 1-inch sensor, but we're actually going to go for the Fuji X30, and for two reasons: it's very good value for money for what it delivers, and the 2/3-inch Fuji X-Trans sensor punches well above its weight, with excellent film simulation modes, dynamic range expansion and shadow/highlight contrast control. It's nicely made, too, with a solid-feeling body, traditional manual zoom ring and a very good electronic viewfinder.</p>", "<p><strong>Read:</strong> <a href=\"/reviews/cameras-and-camcorders/cameras/compact-cameras/fujifilm-x30-1262034/review\">Fuji X30 review</a></p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"Fuji X100T\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn2.mos.techradar.futurecdn.net//art/cameras/Fujifilm/Fuji%20X100T/fuji-x100t-320-80.jpg\" data-srcset=\"http://cdn2.mos.techradar.futurecdn.net//art/cameras/Fujifilm/Fuji%20X100T/fuji-x100t-320-80.jpg 320w, http://cdn2.mos.techradar.futurecdn.net//art/cameras/Fujifilm/Fuji%20X100T/fuji-x100t-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><strong>Fuji took a chance with this retro-themed fixed lens compact – and made its reputation</strong></p>", "<p><strong>Sensor: </strong>APS-C X-Trans, 16.3MP | <strong>Lens:</strong> 35mm, f/2 | <strong>Monitor:</strong> 3-inch, 1040K dots | <strong>Viewfinder:</strong> Hybrid optical/EVF | <strong>Continuous shooting:</strong> 6fps | <strong>Movies:</strong> 1080 | <strong>User level:</strong> Expert</p>", "<p>The X100T is a beauty both to look and and to use, but it's not for everyone! It's a relatively large, retro-styled camera with a fixed focal length 35mm equivalent f/2.0 lens, and designed for photographers who hanker after the weighty feel and manual external controls of traditional 35mm rangefinder cameras. It's a relatively specialised camera you'll use for a certain type of subject (street photography, for example) and most owners are likely to have other cameras too. The original X100 revived Fuji's fortunes and gave its rivals the jolt they needed to develop their own classically-designed cameras.</p>", "<p><strong>Read:</strong> <a href=\"/reviews/cameras-and-camcorders/cameras/compact-cameras/fuji-x100t-1265388/review\">Fuji X100T review</a></p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"Sony RX10\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn2.mos.techradar.futurecdn.net//art/cameras/Sony/RX10/sony_rx10_169-320-80.jpg\" data-srcset=\"http://cdn2.mos.techradar.futurecdn.net//art/cameras/Sony/RX10/sony_rx10_169-320-80.jpg 320w, http://cdn2.mos.techradar.futurecdn.net//art/cameras/Sony/RX10/sony_rx10_169-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><strong>Hard to categorise and easily overlooked, the RX10 scores with a brilliant lens and a big sensor</strong></p>", "<p><strong>Sensor: </strong>1-inch CMOS, 20.2MP | <strong>Lens: </strong>24-200mm, f/2.8 | <strong>Monitor: </strong>3-inch tilting, 1440K dots | <strong>Viewfinder:</strong> EVF | <strong>Continuous shooting:</strong> 10fps | <strong>Movies: </strong>1080 | <strong>User level:</strong> Intermediate/Expert</p>", "<p>Actually, that 'big' sensor is relative. DSLR and mirrorless camera owners would sneer at a 1-inch sensor, but it's much bigger than the sensors used in regular compact cameras and bridge cameras and this has a big impact on picture quality. The problem for the RX10 is that its 8.3x zoom range is too short for it to be considered a 'bridge' camera so people don't know how to categorize it. But that 24-200mm lens is remarkable – its constant f/2.8 maximum aperture is unheard of in a compact camera with this kind of zoom range.</p>", "<p><strong>Read:</strong> <a href=\"/reviews/cameras-and-camcorders/cameras/compact-cameras/sony-rx10-1189945/review\">Sony RX10 review</a></p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"Panasonic FZ1000\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn1.mos.techradar.futurecdn.net//art/cameras/Panasonic/Panasonic%20FZ1000/Product_Shots/Panasonic_FZ100015-320-80.jpg\" data-srcset=\"http://cdn1.mos.techradar.futurecdn.net//art/cameras/Panasonic/Panasonic%20FZ1000/Product_Shots/Panasonic_FZ100015-320-80.jpg 320w, http://cdn1.mos.techradar.futurecdn.net//art/cameras/Panasonic/Panasonic%20FZ1000/Product_Shots/Panasonic_FZ100015-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><strong>Bridge cameras usually match yucky, small sensors with crazy big zooms... but not this time</strong></p>", "<p><strong>Sensor: </strong>1-inch, 20.1 megapixels | <strong>Lens: </strong>25-400mm, f/2.8-4 | <strong>Monitor:</strong> 3-inch articulating, 921K dots | <strong>Viewfinder:</strong> EVF | <strong>Continuous shooting:</strong> 12fps | <strong>Movies:</strong> 4K | <strong>User level:</strong> Intermediate</p>", "<p>The Sony RX10 is impressive enough, but the Panasonic FZ1000 takes it a step further. Bridge cameras are very popular because they offer a colossal zoom range at a modest cost. To design a big zoom, though, the makers have to use a tiny sensor – and here Panasonic took the wise choice to sacrifice zoom range for better quality. Like the Sony RX10, the Panasonic FZ1000 uses a 1-inch sensor, and while the zoom tops out at 400mm equivalent, that's still plenty for all but the most extreme uses. If you want both zoom power and quality, the FZ1000 is the answer.</p>", "<p><strong>Read:</strong> <a href=\"/reviews/cameras-and-camcorders/cameras/compact-cameras/panasonic-lumix-fz1000-1252777/review\">Panasonic FZ1000 review</a></p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"Canon SX60 HS\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn1.mos.techradar.futurecdn.net//art/cameras/Canon/SX60/canon-powershot-sx60-320-80.jpg\" data-srcset=\"http://cdn1.mos.techradar.futurecdn.net//art/cameras/Canon/SX60/canon-powershot-sx60-320-80.jpg 320w, http://cdn1.mos.techradar.futurecdn.net//art/cameras/Canon/SX60/canon-powershot-sx60-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><strong>Big-zoom bridge cameras don't deliver the best quality, but the SX60 HS is best-of-breed</strong></p>", "<p><strong>Sensor: </strong>1/2.3-inch back-illuminated CMOS, 16.1MP | <strong>Lens:</strong> 21-1365mm, f/3.4-6.5 | <strong>Monitor:</strong> 3-inch articulating, 922K dots | <strong>Viewfinder: </strong>EVF | <strong>Continuous shooting: </strong>6.4fps | <strong>Movies:</strong> 1080 | <strong>User level:</strong> Basic/Intermediate</p>", "<p>Having just complained that regular bridge cameras use small sensors that compromise the quality, we're still going to recommend the Canon SX60 HS. The Panasonic FZ1000 is big and expensive, and the Canon is much more manageable in both respects. Its 1/2.3-inch sensor has a back-illuminated design for better light gathering, and while its 65x zoom has now been beaten by the 83x zoom on the Nikon P900, it's still right up there with the biggest on the market. You get an articulating LCD, full manual controls and the ability to shoot raw files, so the SX60 is about as good as regular bridge cameras get.</p>", "<p><strong>Read:</strong> <a href=\"/reviews/cameras-and-camcorders/cameras/compact-cameras/canon-powershot-sx60-hs-1267153/review\">Canon SX60 HS review</a></p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"Panasonic TZ70 ZS50\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn2.mos.techradar.futurecdn.net//art/cameras/Panasonic/Panasonic%20TZ70/Press%20shots/Panasonic-TZ70-320-80.jpg\" data-srcset=\"http://cdn2.mos.techradar.futurecdn.net//art/cameras/Panasonic/Panasonic%20TZ70/Press%20shots/Panasonic-TZ70-320-80.jpg 320w, http://cdn2.mos.techradar.futurecdn.net//art/cameras/Panasonic/Panasonic%20TZ70/Press%20shots/Panasonic-TZ70-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><strong>Travel cameras combine big zoom ranges with pocket-sized bodies, and the TZ70 is the best</strong></p>", "<p><strong>Sensor:</strong> 1/2.3-inch CMOS, 12.1 | <strong>Lens: </strong>24-720mm, f/3.3-6.4 | <strong>Monitor:</strong> 3-inch, 1040K dots | <strong>Viewfinder:</strong> EVF | <strong>Continuous shooting:</strong> 10fps | <strong>Movies: </strong>1080 | <strong>User level:</strong> Basic/Intermediate</p>", "<p>Most of us like to travel light, and this has led to a big market in versatile 'travel', or 'long-zoom' compacts. Panasonic kicked off this whole camera genre with its TZ-series, and these are still the best. The latest model, the TZ70, has a 30x zoom and some remarkably powerful features, including full manual exposure modes, the ability to shoot raw files and even an electronic viewfinder. The small sensor is a necessary evil for this type of camera, but Panasonic has bravely dropped the resolution to 12 megapixels to give better sensitivity and all-round quality.</p>", "<p><strong>Read: </strong><a href=\"/reviews/cameras-and-camcorders/cameras/compact-cameras/panasonic-tz70-zs50-1278976/review\">Panasonic TZ70/ZS50 review</a></p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"Olympus TG 4\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn3.mos.techradar.futurecdn.net//art/cameras/Olympus/Olympus%20TG-4/DI_TG-4_red__Product_000-1-320-80.jpg\" data-srcset=\"http://cdn3.mos.techradar.futurecdn.net//art/cameras/Olympus/Olympus%20TG-4/DI_TG-4_red__Product_000-1-320-80.jpg 320w, http://cdn3.mos.techradar.futurecdn.net//art/cameras/Olympus/Olympus%20TG-4/DI_TG-4_red__Product_000-1-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><strong>If you like to live on the wild side, the TG-4 can take as much punishment as you can</strong></p>", "<p><strong>Sensor:</strong> 1/2.3-inch CMOS, 16MP | <strong>Lens:</strong> 25-100mm, f/2.0-4.9 | <strong>Monitor:</strong> 3-inch, 460K dots | <strong>Viewfinder:</strong> No | <strong>Continuous shooting:</strong> 5fps | <strong>Movies:</strong> 1080 | <strong>User level: </strong>Basic/Intermediate</p>", "<p>We haven't yet had Olympus's latest TG-4 in for review, but we've tested the TG-3 and we like it a lot. You normally think of cameras as delicate electronic devices, but the TG-4 is as tough as they come. It's shockproof to a height of 2.1m (the height you can drop it from), crushproof (resisting a force of 100kg), waterproof (down to a depth of 15m) and freezeproof (down to -10 degrees centigrade). You also get a surprisingly fast 4x zoom lens – f/2.0 at its widest focal length – and built-in GPS, so that you can follow your adventures on a map.</p>", "<p><strong>Read:</strong> <a href=\"/reviews/cameras-and-camcorders/cameras/compact-cameras/olympus-stylus-tg-3-1255927/review\">Olympus TG-3 review</a></p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"Canon PowerShot D30\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn1.mos.techradar.futurecdn.net//art/cameras/Canon/Powershot%20D30/press%20shots/PowerShot%20D30%20BLUE%20FSL_tcm14-1131597-320-80.jpg\" data-srcset=\"http://cdn1.mos.techradar.futurecdn.net//art/cameras/Canon/Powershot%20D30/press%20shots/PowerShot%20D30%20BLUE%20FSL_tcm14-1131597-320-80.jpg 320w, http://cdn1.mos.techradar.futurecdn.net//art/cameras/Canon/Powershot%20D30/press%20shots/PowerShot%20D30%20BLUE%20FSL_tcm14-1131597-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><strong>Tough and smart-looking at the same time, the D30 is waterproof down to an amazing 25m</strong></p>", "<p><strong>Sensor:</strong> 1/2.3-inch back-illuminated CMOS, 12.1 megapixels | <strong>Lens:</strong> 28-140mm, f/3.9-4.8 |<strong> Monitor:</strong> 3-inch, 461K dots | <strong>Viewfinder:</strong> No | <strong>Continuous shooting:</strong> 1.9fps | <strong>Movies: </strong>1080 | <strong>User level:</strong> Basic</p>", "<p>Still on the subject of tough cameras, we also like the Canon PowerShot D30. It's a lot cheaper than the Olympus TG-4 and a little less aggressive in its styling. It goes even deeper, too, with a depth rating of 25m, and all this combines to make it a tough and practical family camera. But while the D30 does have GPS, like the Olympus, there's no Wi-Fi – and there's no 'crushproof' rating either. The image quality isn't quite on a par with the Olympus's (which also shoots raw files, by the way) and the macro mode can be a bit hit and miss, but you can't fault its value.</p>", "<p><strong>Read:</strong> <a href=\"/reviews/cameras-and-camcorders/cameras/compact-cameras/canon-powershot-d30-1258397/review\">Canon D30 review</a></p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"Sony W800\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn3.mos.techradar.futurecdn.net//art/cameras/Sony/W800/Sony%20Cyber-shot%20DSC-W800%20press%20shots/pSNYNA-DSCW800_alternate3_v786-copy-320-80.jpg\" data-srcset=\"http://cdn3.mos.techradar.futurecdn.net//art/cameras/Sony/W800/Sony%20Cyber-shot%20DSC-W800%20press%20shots/pSNYNA-DSCW800_alternate3_v786-copy-320-80.jpg 320w, http://cdn3.mos.techradar.futurecdn.net//art/cameras/Sony/W800/Sony%20Cyber-shot%20DSC-W800%20press%20shots/pSNYNA-DSCW800_alternate3_v786-copy-650-80.jpg 650w\" data-sizes=\"auto\"></figure></p>", "<p><strong>It's cheap, it's simple and it still gives you a 5x zoom – the Sony is our top low-cost buy</strong></p>", "<p><strong>Sensor: </strong>1/2.3-inch, 20.1MP | <strong>Lens:</strong> 26-130mm, f/3.2-6.4 | <strong>Monitor:</strong> 2.7-inch, 230K dots | <strong>Viewfinder:</strong> No | <strong>Continuous shooting:</strong> 0.5fps | <strong>Movies: </strong>720 | <strong>User level:</strong> Basic</p>", "<p>If price is the biggest factor, then you can hardly do better than the Sony W800. At this end of the market you have to tread a careful line between 'cheap' and 'rubbish', and the W800 keeps you firmly on the side of 'cheap'. Its 20MP 1/2.3-inch sensor and 5x zoom lens deliver perfectly satisfactory quality for a budget point-and-shoot camera, and both the build quality and the styling are a cut above what you might expect at this price. It's small, light, easy to use and gives you just enough manual control to cope with the occasional tricky situation. </p>", "<p><strong>Read:</strong> <a href=\"/reviews/cameras-and-camcorders/cameras/compact-cameras/sony-cyber-shot-w800-1281513/review\">Sony W800 review</a></p>", "<p><strong>See also:</strong> <a href=\"/cameras\">Camera reviews</a>, <a href=\"/news/photography-video-capture/cameras/best-cheap-camera-10-for-under-200-987655\">Best cheap camera</a>, <a href=\"/news/photography-video-capture/cameras/best-advanced-compact-camera-1258405\">Best high-end compact</a>, <a href=\"/news/photography-video-capture/cameras/best-bridge-camera-1259503\">Best bridge camera</a>, <a href=\"/news/photography-video-capture/cameras/best-travel-or-superzoom-camera-1259446\">Best travel camera</a>, <a href=\"/news/photography-video-capture/cameras/best-waterproof-compact-camera-1260610\">Best waterproof camera</a></p>"], "link": "http://www.techradar.com/news/photography-video-capture/cameras/best-compact-camera-2013-34-reviewed-963985"},
{"category": ["mobileTablet"], "category2": ["none"], "author": ["TechRadar"], "headline": ["Week in Tech: Sneaky Xperia Z4, Wi-Fi wonders and days of Google past"], "image": ["http://cdn.mos.techradar.com/art/other/Week%20in%20tech/New%20Week%20In%20Tech/Week%20in%20Tech%20April%2024%202015-320-80.jpg"], "content": ["<p>It's been a weird week in our world of tech: Sony's latest smartphone launch was more apologetic than awesome, Google made it possible to see everything we've ever searched for with predictably hilarious results, and scientists have found a way to spot trolls before they start trolling. Who's that trip-trapping over your bridge?</p>", "<p>When is a launch not a launch? When it's a <a href=\"/news/phone-and-communications/mobile-phones/sony-quietly-launches-the-xperia-z4-in-japan-1291438\">Sony flagship smartphone launch</a>. The <a href=\"/news/phone-and-communications/mobile-phones/sony-xperia-z4-what-we-want-to-see-1268100\">Xperia Z4</a> has been released quietly in Japan, with none of the fanfare we've come to expect from smartphone launches. While it's available on Sony's home turf \"later this summer\" there's no word of an international release. When – and we hope it's when, not if – it happens, Sony might keep it so quiet that nobody notices. That's a shame, because it appears to be a perfectly good evolution of a really nice phone. </p>", "<p>The <a href=\"/news/wearables/apple-iwatch-release-date-news-and-rumours-1131043\">Apple Watch</a> starts shipping this week, but its rival <a href=\"/reviews/phones/android-wear-1260150/review\">Android Wear</a> is a moving target: this week it got an <a href=\"/news/wearables/android-wear-s-new-update-puts-it-closer-in-line-with-the-apple-watch-1291500\">update</a> that makes Android Wear watches even more compelling. There's an always-on screen for apps as well as faces, Wi-Fi support (if the watch has the hardware) and emojis too. The update has already started to roll out and should reach all Android Wear watches in the next few weeks. </p>", "<p>Never mind fitness tracking: <a href=\"/news/world-of-tech/future-tech/emotional-data-from-the-likes-of-the-apple-watch-is-this-the-next-boom--1291151\">devices such as the Apple Watch could monitor your emotions</a>. That's what Jamie Carter says, and he's got the experts to back him up. They're careful not to over-hype the potential, but it's clear that computers will soon be able to know more about us than ever before. The big question is, do we want them to?</p>", "<p>Good news for mobile workers and Starbucks-based <a href=\"/reviews/audio-visual/av-accessories/netflix-1065801/review\">Netflix</a> binge viewers: public Wi-Fi is about to get a whole lot faster, and by \"a whole lot\" we mean \"10 times\". Researchers at Oregon State University have invented a <a href=\"/news/networking/wi-fi/wi-fi-tech-makes-public-hotspots-usable-with-10x-speed-boost-1291760\">new LED-based technology</a> that delivers up to 10 times more bandwidth, and it's called WiFO. While it has the same peak speed as existing users, it would deliver at least 50Mbps per user instead of the piffling speeds we're used to in public spaces. It can't come soon enough.</p>", "<p>File this one under \"what could possibly go wrong?\": Google has made it possible to <a href=\"/news/internet/your-embarrassing-google-search-history-is-now-downloadable-1291568\">download an archive of every single thing you've ever searched for</a>, if you browse while logged into your Google Account and don't use private browsing. As Kate Solomon says: \"Your Google Search history can be quite revealing – it's not something you want your parents or potential mates to ever read. Every minor but embarrassing ailment you've ever had, every terrible film, questionable celebrity crush and vaguely illegal activity you've ever looked into laid out like a map around your psyche.\"</p>", "<p>About that 2015 launch for the <a href=\"/reviews/gaming/gaming-accessories/oculus-rift-1123963/review\">Oculus Rift VR</a> headset: <a href=\"/news/wearables/facebook-earnings-call-reveals-oculus-rift-will-not-ship-this-year-1291795\">it ain't gonna happen</a>. Speaking during Facebook's quarterly earnings call, Oculus's new owner confirmed that the Rift won't have \"large shipment volumes\" this year. Facebook tech boss Mike Schroepfer has clarified a previous comment: when he said VR would be coming this year he meant VR-capable hardware, not the consumer version of the Oculus Rift.</p>", "<p>Facebook's new app, <a href=\"/news/phone-and-communications/facebook-s-hello-app-wants-you-to-say-goodbye-to-your-android-dialer-1291775\">Hello</a>, wants you to say goodbye to your Android dialler: it's a free app that enables you to make free voice calls over Wi-Fi, and the latest attempt by Facebook to keep you locked in its warm and faintly sinister embrace. Not that most of us need much encouragement: the <a href=\"/news/internet/this-is-the-staggering-amount-of-people-who-use-facebook-1291789\">latest Facebook stats</a> say that it has 936 million active daily users sending 45 billion messages and watching 4 billion cat videos a day. </p>", "<p>Bad news for the kind of troll that doesn't live under a bridge and threaten goats: US researchers are working on <a href=\"/news/internet/web/trollbusters-this-algorithm-can-predict-if-you-re-going-to-get-banned-1291402\">troll-busting algorithms</a> in a kind of Minority Report system to predict outbreaks of idiocy. The researchers have discovered that the internet's mouth-breathers write in a completely different way, and they've built a model that can predict with 80% accuracy whether a user would go on to be banned based on reading just five of their posts. They also found that tough moderation made trolling worse, and \"a light touch was more effective than throwing out the banhammer.\"</p>"], "link": "http://www.techradar.com/news/phone-and-communications/mobile-phones/week-in-tech-sneaky-xperia-z4-wi-fi-wonders-and-days-of-google-past-1291897"},
{"category": ["wearables"], "category2": ["none"], "author": ["Cameron Faulkner"], "headline": ["Apple Watch heart rate sensor: everything you need to know"], "image": ["http://cdn.mos.techradar.com/art/Watches/Apple%20Watch/heart%20rate%20sensor/apple-watch-heart-hero-320-80.jpg"], "content": ["<p>If you peel back the layers of the <a href=\"/reviews/phones/mobile-phone-accessories/apple-watch-1264567/review\">Apple Watch</a>, tossing its premium look and features like the Force Touch screen and the Digital Crown to the side, you'll eventually be left with one piece of tech that's par for the course in most of today's smartwatches: a heart rate sensor.</p>", "<p>Not to be outdone by the <a href=\"/reviews/wearables/microsoft-band-1283262/review\">Microsoft Band</a>, <a href=\"/reviews/phones/mobile-phone-accessories/basis-peak-1275437/review\">Basis Peak</a> and other competition in the wearables category, Apple Watch can track your heart rate with the sensor located on the flipside of its watch face. But the main attraction isn't how Apple Watch interprets the heartbeat data, but (read this in your best Jony Ive voice) how Apple is trying to power a wrist-sized evolution in the way we communicate through technology.</p>", "<p>Before we get too ahead of ourselves, let's do an overview of how the Apple Watch's heart rate sensor works.</p>", "<p>Fitness isn't the sole focus of the Apple Watch, but don't count it out. Its sensor, which rests in the circular back of the watch, is a tag-team effort comprised of infrared light blasters and green LEDs. They work together to employ a tried and true (but difficult to pronounce) technique called photoplethysmography to give users an accurate heart rate reading. </p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"Apple Watch heart rate sensor\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn4.mos.techradar.futurecdn.net//art/Watches/Apple%20Watch/heart%20rate%20sensor/apple-watch-sensor-320-80.jpg\" data-srcset=\"http://cdn4.mos.techradar.futurecdn.net//art/Watches/Apple%20Watch/heart%20rate%20sensor/apple-watch-sensor-320-80.jpg 320w, http://cdn4.mos.techradar.futurecdn.net//art/Watches/Apple%20Watch/heart%20rate%20sensor/apple-watch-sensor-650-80.jpg 650w\" data-sizes=\"auto\"><figcaption>Try to not to look at the lights too long</figcaption></figure></p>", "<p>Apple's support documents explain the complicated process for tracking your heartbeat:</p>", "<p>\"Blood is red because it reflects red light and absorbs green light. Apple Watch uses green LED lights paired with light‑sensitive photodiodes to detect the amount of blood flowing through your wrist at any given moment. When your heart beats, the blood flow in your wrist - and the green light absorption - is greater. Between beats, it's less. By flashing its LED lights hundreds of times per second, Apple Watch can calculate the number of times the heart beats each minute - your heart rate.\"</p>", "<p>Wouldn't flashing the green LEDs \"hundreds of times per second\" plague the <a href=\"/news/wearables/apple-watch-battery-life-how-many-hours-does-it-last--1291435\">Apple Watch battery life</a> to die in a jiffy? Yes, it would. But the green LEDs kick on only when they're needed. For the rest of the work, the infrared light comes into play. This low-power tracking mode sends your heart rate to the Health app every 10 minutes, which compiles the data into a graph for you to study, if you choose.</p>", "<p>But if this method of heart rate monitoring isn't producing consistent, reliable data, the green LEDs will kick back into gear as a failsafe.</p>", "<p>Apple Watch packs guts capable enough to track several types of workouts, but like most trackers, it has limitations. </p>", "<p>Apple is upfront about the likelihood that, for some users, the heart rate sensor just might not work very well – or at all – even under favorable conditions. In the same support document, Apple stresses that wearing the smartwatch correctly on your wrist is key, but you probably guessed that much. The heart rate sensor can't detect much of anything if the Apple Watch isn't \"snug and comfortable.\"</p>", "<p><figure><img src=\"http://cdn0.beta.static.techradar.futurecdn.net/media/img/missing-image.svg\" alt=\"Apple Watch heart rate sensor\" class=\" lazy-image lazy-image-loading lazyload optional-image\" onerror=\"this.parentNode.replaceChild(window.missingImage(),this)\" sizes=\"auto\" data-src=\"http://cdn2.mos.techradar.futurecdn.net//art/Watches/Apple%20Watch/heart%20rate%20sensor/sending-heartbeat-320-80.jpg\" data-srcset=\"http://cdn2.mos.techradar.futurecdn.net//art/Watches/Apple%20Watch/heart%20rate%20sensor/sending-heartbeat-320-80.jpg 320w, http://cdn2.mos.techradar.futurecdn.net//art/Watches/Apple%20Watch/heart%20rate%20sensor/sending-heartbeat-650-80.jpg 650w\" data-sizes=\"auto\"><figcaption>You'll need a friend with an Apple Watch to take advantage of some cool features</figcaption></figure></p>", "<p>Still not getting a good reading? As it turns out, there are also a host of other factors that could be to blame for a lousy reading. Some are environment-related: for example, if it's cold outside, the Apple Watch will have a hard time giving you a reading when circulation to your wrist is reduced. That said, if circulation to your extremities is an ongoing issue for you even in a warm room, an external Bluetooth heart rate monitor will give you better, more consistent results.</p>", "<p>Lastly, Apple points out that the Watch might be choosy when it comes to tracking during your preferred activities. \"Rhythmic movements, such as running or cycling, give better results compared to irregular movements, like tennis or boxing.\" Sorry, jousters and parkour athletes.</p>"], "link": "http://www.techradar.com/news/wearables/apple-watch-heart-rate-sensor-everything-you-need-to-know-1291948"}]