[{"category": ["hardware"], "category2": ["none"], "author": ["Tim Schiesser"], "headline": ["Latest atomic clock smashes records with 15 billion year accuracy"], "image": ["http://www.techspot.com/images2/news/bigimage/2015-04-21-image-19.jpg"], "content": ["<p>Atomic clocks are some of the most important measuring devices on Earth, as they are used for master clocks that essentially dictate the time standard used pretty much everywhere. See the time on your computer or smartphone? That has almost certainly been synchronized with an atomic clock in the past day or so.</p>", "<p>While atomic clocks are already unbelievably accurate, a new atomic clock has been developed <a href=\"http://jila.colorado.edu/news-highlights/about-time\">by JILA researchers</a> that has set a world record for accuracy and stability. This new clock is a factor of three more accurate than the previous world record holder, meaning that it won't lose or gain more than a second after 15 billion years of operation.</p>", "<p>In other words, this clock could continue to \"tick\" for longer than the current age of the universe, and it would barely lose any time at all.</p>", "<p>The way this atomic clock works is <a href=\"http://www.nature.com/ncomms/2015/150421/ncomms7896/full/ncomms7896.html\">rather complicated</a>. Inside the clock mechanism, an optical lattice is formed by strong lasers, which hold a bunch of strontium atoms in place. A red laser then forces these atoms to switch between different energy levels, and each switch corresponds to the tick of a clock.</p>", "<p>This new record-breaking atomic clock managed to improve upon accuracy and stability by using a new and much more stable laser, more precise control over the clock's temperature, and improved measurement techniques. The clock is now so sensitive that it's affected by changes in gravity: moving the clock up in height by just 2cm would affect its output.</p>", "<p>The researchers hope that this clock can not just be used to keep ultra-accurate time, but also to conduct further research into quantum behavior and gravity variations.</p>"], "link": "http://www.techspot.com/news/60447-atomic-clock-smashes-records-15-billion-year-accuracy.html"},
{"category": ["hardware"], "category2": ["none"], "author": ["Shawn Knight"], "headline": ["Leaked specs for upcoming Intel Skylake CPUs reveal high clock rates, 95W TDP and more"], "image": ["http://www.techspot.com/images2/news/bigimage/2015-04-20-image-4.jpg"], "content": ["<p><a href=\"http://www.kitguru.net/components/cpu/anton-shilov/possible-specifications-of-unlocked-intel-skylake-processors-leak/\">Leaked specifications</a> from a pair of upcoming Intel Skylake processors have hit the web. If accurate, we could see Intel pumping out CPUs with high clock rates on par with the company’s existing <a href=\"http://www.techspot.com/review/837-intel-core-i7-4790k-devils-canyon/\">Devil’s Canyon</a> offering.</p>", "<p>The chips in question are the Intel Core i7-6700K and the Core i5-6600K, both being unlocked with overclocking in mind as evident by the “K” designation.</p>", "<p>The faster i7-6700K is said to consist of four cores with Hyper-Threading clocked at 4.0GHz (Turbo Boost up to 4.2GHz), 8MB of last-level cache, a dual-channel DDR3/DDR4 memory controller, 95W TDP and Intel HD Graphics 5000-series, all on an LGA1151 packaging.</p>", "<p>The slightly slower (albeit less expensive) i5-6600K will ship with a standard operating frequency of 3.5GHz (Turbo Boost up to 3.9GHz). It’ll also include 6MB of last-level cache as well as the same dual-channel DDR3/DDR4 memory controller, 95W TDP and Intel HD Graphics 5000-series on the LGA1151 package.</p>", "<p><img alt=\"intel skylake core processors specifications leaked tdp 2ghz boo intel skylake\" src=\"http://www.techspot.com/images2/news/bigimage/2015-04-20-image-3.jpg\"></p>", "<p>Skylake will represent a “tock” in Intel’s Tick Tock design model, meaning it’ll be built on the same 14-nanometer manufacturing process as Haswell but will feature a new microarchitecture. With microarchitecture advancements, Intel generally seeks to improve energy efficiency and performance as well as functionality and density of features.</p>", "<p>It’s worth reiterating that these are simply leaks and haven’t yet been confirmed. As such, one should take this information with a healthy dose of salt.</p>"], "link": "http://www.techspot.com/news/60419-leaked-specs-upcoming-intel-skylake-cpus-reveal-high.html"},
{"category": ["gaming"], "category2": ["business"], "author": ["Shawn Knight"], "headline": ["Valve now lets modders sell their content on Steam Workshop"], "image": ["http://www.techspot.com/images2/news/bigimage/2015-04-23-image-27.jpg"], "content": ["<p>One of the great things about gaming on the PC is the option to tinker. More often than not, it’s the modding community – not the original game developer – that’s responsible for taking an average game and transforming it into something spectacular (or simply adding in features that should have been included from the get-go).</p>", "<p>Aside from a bit of community recognition, modders often get nothing in return for their hours upon hours of hard work.</p>", "<p>Valve is looking to change that by adding new functionality to the Steam Workshop that affords modders the option to <a href=\"http://store.steampowered.com/news/?feed=steam_press&amp;headlines=1#\">sell their creations</a> directly to gamers.</p>", "<p>Valve’s Tom Bui said they think this is a great opportunity to help support the incredible creative work done by mod makers in the Steam Workshop. He adds that user-generated content is an increasingly significant component of many games and opening new avenues to help financially support contributors will drive the level of content to new heights.</p>", "<p>The Elder Scrolls V: Skyrim is the first game to support paid mods. As of writing, there are nearly 20 paid mods up for sale ranging in price from $0.25 to $4.99.</p>", "<p>Reactions to the move <a href=\"https://www.change.org/p/valve-remove-the-paid-content-of-the-steam-workshop\">haven’t exactly been favorable</a> thus far. Many believe Valve has simply erected a paywall to mods and that modding is a hobby, not a career. Others, however, don’t seem to mind paying a few bucks in return for a quality mod that adds true value to the game.</p>", "<p>Personally, I’d be interested in hearing what modders have to say. Do they truly do it for the community or would they like to make some extra money for their hard work? And how do they feel about the revenue share (modders only get <a href=\"http://steamcommunity.com/workshop/about/?appid=72850\">25 percent</a> of what each Skyrim mod sells for – publisher Bethesda gets the rest)?</p>"], "link": "http://www.techspot.com/news/60471-valve-steam-workshop.html"},
{"category": ["hardware"], "category2": ["none"], "author": ["Shawn Knight"], "headline": ["Garmin's newest GPS includes a built-in dash cam"], "image": ["http://www.techspot.com/images2/news/bigimage/2015-04-23-image-26.jpg"], "content": ["<p>Standalone GPS navigation devices were all the rage a decade ago but once smartphones were capable of performing the same job, their popularity receded and it became apparent that manufacturers would need to bring more to the table to regain lost market share.</p>", "<p>Garmin’s latest may do just that as it combines a couple of emerging trends with proven GPS navigation.</p>", "<p>The <a href=\"https://buy.garmin.com/en-US/US/prod168820.html#gallery-dialog\">NuviCam LMTHD</a> features a 6-inch, pinch-to-zoom display and the industry’s first built-in dash cam. In addition to the obvious ability to record your commute each day, the camera’s software can provide audible and visual forward collision and lane departure warnings.</p>", "<p>The system also includes augmented reality functions. For example, it can overlay numeric addresses and add an arrow-shaped indicator to help locate your exact destination when you get close. The unit can even link up to your smartphone via Bluetooth for hands-free calling and pair with Garmin’s optional backup camera to use as a display.</p>", "<p>All of this is of course in addition to its primary GPS functionality which includes detailed maps of North America that are updated free for life and recognizable landmarks to make navigation feel more natural. The unit also offers voice-activated navigation meaning you can simply speak your destination or other commands without having to take your hands off the wheel.</p>", "<p>The Garmin NuviCam will go on sale next month at a price of $399.99.</p>"], "link": "http://www.techspot.com/news/60469-garmin-newest-gps-includes-built-dash-cam.html"},
{"category": ["hardware"], "category2": ["none"], "author": ["Shawn Knight"], "headline": ["The Event is poised to become China's first homegrown electric sports car"], "image": ["http://www.techspot.com/images2/news/bigimage/2015-04-23-image-17.jpg"], "content": ["<p>Tesla may be <a href=\"http://www.techspot.com/news/58388-tesla-unveils-awd-model-s-dual-motors-new.html\">turning heads</a> in the US with its small fleet of electric vehicles but in China, EV enthusiasts’ eyes are focused on what could be the country’s first homegrown electric sports car.</p>", "<p>Recently shown off at the Shanghai auto show, the car is simply known as the Event from CH-Auto. The brainchild of former Jeep executive Lu Qun, the Event is powered by a 48kWh battery capable of a range of 155 miles. It can go from zero to 100 kilometers (to 0-62 mph) in 4.6 seconds. That’s not quite as fast as Tesla’s <a href=\"http://www.techspot.com/news/59270-tesla-model-s-p85d-hits-road-drag-racing.html\">Model S P85D</a> but it’s still quite zippy.</p>", "<p><img alt=\"executive shows china home-grown electric sports car china tesla electric car sports car event ev ev sports car electric sports car ch-auto lu qun the event\" src=\"http://www.techspot.com/images2/news/bigimage/2015-04-23-image-18.jpg\"></p>", "<p>China’s air pollution problem could greatly benefit from a successful electric vehicle. The government has pledged support to the development of EVs with sales climbing to 18,000 units last year but breaking into the market has proven especially difficult.</p>", "<p>Like anywhere else, the success of an electric vehicle largely hinges on the availability of recharging stations. China’s dense population and large landmass aren’t exactly ideal when it comes to building out supporting infrastructure.</p>", "<p>To make headway, Qun will initially target the high-end market. Once the brand and its dragonfly logo have been established, CH-Auto will turn its attention to high-volume, affordable vehicles (<a href=\"http://www.techspot.com/news/57431-teslas-musk-confirms-model-3-a-smaller-and-cheaper-electric-vehicle.html\">sound familiar?</a>). If everything goes as planned, the Event could enter production as early as late 2016.</p>", "<p>Pricing wasn't revealed although industry analysts tell <a href=\"http://www.wsj.com/articles/executive-shows-chinas-first-home-grown-electric-sports-car-1429739673\">The Wall Street Journal</a> they expect it to come in around the $115,000 mark.</p>", "<p>What are your thoughts on the overall styling? The Event loosely resembles the Veyron IMO although I think that's just due to the two-tone paint job playing tricks on my mind.</p>", "<p class=\"grey\">Images via <a href=\"http://www.wsj.com/articles/executive-shows-chinas-first-home-grown-electric-sports-car-1429739673\">WSJ</a>, <a href=\"http://www.carnewschina.com/2014/04/22/ch-auto-event-concept-debuts-on-the-beijing-auto-show/\">CarNewsChina</a></p>"], "link": "http://www.techspot.com/news/60466-event-poised-become-china-first-homegrown-electric-sports.html"},
{"category": ["tvs"], "category2": ["business"], "author": ["Tim Schiesser"], "headline": ["Game of Thrones is being pirated more than ever before"], "image": ["http://www.techspot.com/images2/news/bigimage/2015-04-22_09-02-52.jpg"], "content": ["<p>Despite Game of Thrones being more accessible than ever before thanks to the launch of HBO Now, the extremely popular fantasy TV show is also being pirated more than ever before, according to media intelligence company <a href=\"http://torrentfreak.com/game-of-thrones-piracy-surges-to-new-high-150422/\">Tru Optik, who provided data to TorrentFreak</a>.</p>", "<p>Due to four episodes leaking online well before their air date, Game of Thrones was reportedly downloaded more than 32 million times from 18 million IP addresses during the first week of its airing. 13 million of these downloads were for the first episode, which is a significant increase on the amount of downloads for the first episode of the previous season during a similar timeframe.</p>", "<p>While the leaked Game of Thrones episodes were only released in standard definition, after the first episode officially aired, the majority of downloads (43.5 percent) were of 720p copies. 480p made up 35.1 percent of downloads, while the highest-quality 1080p copies took up the remaining 31.4 percent.</p>", "<p><img src=\"http://www.techspot.com/images2/news/bigimage/2015-04-22_09-03-56.jpg\"></p>", "<p>As usual, Australia topped the charts for the most downloads per capita, with the country also recording a relatively high ratio of pirates to legal viewers. But the United States lays claim to the highest number of illegal Game of Thrones downloads overall, followed by France and Brazil.</p>", "<p>TorrentFreak expects that Game of Thrones will once again be the most pirated TV show of the year, following on from its 'victories' in the past three years. If the piracy rate from just the first week continues, it could win in a landslide.</p>"], "link": "http://www.techspot.com/news/60448-game-thrones-pirated-more-than-ever-before.html"},
{"category": ["hardware"], "category2": ["mobileTablet"], "author": ["Shawn Knight"], "headline": ["Independent testing confirms Snapdragon 810 SoC runs hot and throttles early, often and severely"], "image": ["http://www.techspot.com/images2/news/bigimage/2015-04-24-image-8.jpg"], "content": ["<p>Samsung elected to <a href=\"http://www.techspot.com/news/59473-samsung-reportedly-ditch-qualcomm-processors-favor-own-chip.html\">skirt</a> Qualcomm’s Snapdragon 810 SoC in favor of its in-house Exynos solution to power the <a href=\"http://www.techspot.com/news/59899-here-new-samsung-galaxy-s6-galaxy-s6-edge.html\">Galaxy S6 and S6 Edge</a>. The rumor mill claimed the chip <a href=\"http://www.techspot.com/news/59558-qualcomm-large-customer-wont-use-snapdragon-810.html\">ran too hot</a> for Samsung’s liking, an accusation that has since been independently corroborated by <a href=\"http://arstechnica.com/gadgets/2015/04/in-depth-with-the-snapdragon-810s-heat-problems/\">Ars Technica</a>.</p>", "<p>With help from the team at <a href=\"http://www.primatelabs.com/\">Primate Labs</a>, the publication found that when running at its full potential in both the HTC One M9 and LG’s G Flex 2, the Snapdragon 810 is indeed faster than its predecessors, the Snapdragon 800, 801 and 805.</p>", "<p>That performance is short-lived, however, as throttling – a technique used by many smartphones and tablets to avoid overheating – occurs early and often due to the fact that the 810 does indeed run warm. But just how bad is it?</p>", "<p><img alt=\"tests snapdragon qualcomm samsung smartphone cpu soc chip throttling exynos overheating snapdragon 810 galaxy s6 lg g flex 2 htc one m9 galaxy s6 edge 810 soc exynos 7420 arm cortex a53 arm cortex a57\" src=\"http://www.techspot.com/images2/news/bigimage/2015-04-24-image-7.jpg\"></p>", "<p>This chart really drives home the point. In comparing the “.big” ARM Cortex A57 cores from the Exynos 7420 inside the Galaxy S6 to the Snapdragon 810’s “big” in the LG G Flex 2, the difference becomes painfully obvious (the gaps represent when the SoC switched to its “.LITTLE” ARM Cortex A53 cores).</p>", "<p>While both exhibited throttling, the 810 dropped down below 900MHz after just a few minutes of sustained workload and switched to the .LITTLE cores on a somewhat consistent basis. The Exynos, meanwhile, only touched the .LITTLE cores a few times and maintained much faster clock speeds throughout the 15-minute test period.</p>", "<p>All things considered, the data – which mirrors our own testing of the <a href=\"http://www.techspot.com/review/980-htc-one-m9/\">HTC One M9</a> and the <a href=\"http://www.techspot.com/review/985-lg-g-flex-2/\">LG G Flex 2</a> – proves that phones using the Snapdragon 810 are ultimately slower and have worse battery life. The heating issues are likely a result of using TSMC’s 20-nanometer manufacturing process (Samsung’s Exynos is built on the 14-nanometer process). It’s also possible that Samsung simply has more experience implementing Cortex CPU cores into its designs.</p>", "<p>Fortunately, Qualcomm’s next in line – the <a href=\"http://www.techspot.com/news/60427-qualcomm-shunning-tsmc-favor-samsung.html\">Snapdragon 820</a> – is expected to be built on the smaller and more efficient 14-nanometer process. Along with its custom-designed 64-bit “Kryo” architecture, it should alleviate the issues found in 810.</p>", "<p class=\"grey\">Chart via <a href=\"http://arstechnica.com/gadgets/2015/04/in-depth-with-the-snapdragon-810s-heat-problems/\">Ars Technica</a></p>"], "link": "http://www.techspot.com/news/60477-independent-testing-confirms-snapdragon-810-soc-runs-hot.html"},
{"category": ["hardware"], "category2": ["none"], "author": ["Justin Kahn"], "headline": ["Colorado police charge man for \"killing his computer\" with a handgun"], "image": ["http://www.techspot.com/images2/news/bigimage/2015-04-22-image-14.jpg"], "content": ["<p>We have all been there at some point or another. Our computers freeze up or some error occurs and we lose hours (or even days) of work. This is usually followed by a series of loud expletives and physical threats towards the machine. Rarely do these physical threats come to fruition, but the Colorado Police Department have recently arrested a man for getting a little <a href=\"http://news.yahoo.com/colorado-man-cited-killing-uncooperative-computer-handgun-191856963.html\">too violent</a> with his troublesome computer.</p>", "<p>In fact, after what sounds like a long and arduous battle with the system, the man reportedly carried it out to a nearby alleyway and blasted it with 8 rounds from his handgun. You can see the damage done in the image above courtesy of the <a href=\"https://twitter.com/CSPDPIO\">Springs Police (@CSPDPIO) Twitter account</a>.</p>", "<p>\"He took the computer into the back alley and fired eight shots into the computer with a handgun, effectively disabling it,\" police said.</p>", "<p>Based on data from a police statement officially entitled \"Man Kills His Computer,” Colorado law enforcement officers responded to a “shots fired” call from local residence on Monday evening before charging Lucas Hinch for using a firearm within city limits. The police investigation revealed that Hinch had been in a months-long battle with his machine before he decided to put it out of its misery. </p>", "<p>The 37-year old Hinch wasn’t aware he was breaking the law, according to reports, and will face a judge before any penalties are handed out. While certainly not as effective as a gun, it’s hard to imagine a baseball bat not being able to handle the job just as well. </p>", "<p class=\"grey\"><a href=\"http://www.techspot.com/tag/found/\">Found</a> is a TechSpot feature where we share clever, funny or otherwise interesting stuff from around the web.</p>"], "link": "http://www.techspot.com/news/60452-colorado-police-charge-man-killing-computer-handgun.html"},
{"category": ["gaming"], "category2": ["hardware"], "author": ["Tim Schiesser"], "headline": ["Batman: Arkham Knight will require flagship GPU for Ultra quality"], "image": ["http://www.techspot.com/images2/news/bigimage/2015-04-24-image-1.jpg"], "content": ["<p>The system requirements for <em>Batman: Arkham Knight</em> <a href=\"http://www.geforce.com/games-applications/pc-games/batman-arkham-knight/system-requirements\">have been published</a>, and if you want to play this game on the highest possible graphics settings, you'll need to be packing a flagship graphics card such as the Nvidia GeForce GTX 980.</p>", "<p>Equivalent AMD graphics cards haven't been listed in the system requirements, though we expect a Radeon R9 270X (or Radeon HD 7870) will meet the minimum requirements, while an R9 290X will be needed to run the game on Ultra graphics settings.</p>", "<p>Interestingly, <em>Arkham Knight</em> has two listed storage requirements: 45 GB and 55 GB. This could indicate that the game will come with a high-resolution textures pack, similar to <em>Middle-earth: Shadow of Mordor</em>, which would take up an extra 10 GB of space.</p>", "<p>Judging by the system requirements, <em>Arkham Knight</em> will need a pretty decent gaming PC to run on when it launches on June 23. Going on past releases in the series, if you have the horsepower to do so, cranking the graphics settings all the way up will produce a stunningly beautiful game.</p>"], "link": "http://www.techspot.com/news/60472-batman-arkham-knight-require-flagship-gpu-ultra-quality.html"},
{"category": ["business"], "category2": ["none"], "author": ["Shawn Knight"], "headline": ["Amazon turns your car into a mobile delivery address for packages"], "image": ["http://www.techspot.com/images2/news/bigimage/2015-04-23-image-13.jpg"], "content": ["<p><a href=\"http://www.techspot.com/news/54864-amazon-reveals-plans-to-deliver-packages-using-autonomous-drones.html\">Drones</a> aren’t the only experimental delivery method Amazon is interested in. In addition to standard doorstep and <a href=\"http://www.techspot.com/news/56234-amazon-is-now-taking-returns-through-its-locker-system.html\">locker delivery</a>, the e-commerce giant will soon be trialing a program in which packages will be left in the trunk of your car.</p>", "<p>Testing gets under way next month for select Amazon Prime subscribers living in Munich that also happen to drive an Audi. As the <a href=\"http://www.ft.com/intl/cms/s/0/53247f78-e8da-11e4-87fe-00144feab7de.html?siteedition=uk#axzz3Y34uaOWh\">Financial Times</a> notes, Amazon is partnering with courier <a href=\"http://www.dpdhl.com/en/media_relations/press_releases/2015/car_becomes_mobile_delivery_address_for_parcels.html\">DHL</a> on the pilot in which drivers will get one-time keyless access to the trunk of a customer's car.</p>", "<p>Because the delivery driver won’t have access to the rest of the car (nevermind the fact that many cars have trunk access through the back seating area), additional insurance by Amazon won’t be necessary.</p>", "<p>Customers will give a rough approximation of where their car is located and provide a desired drop-off time (while you’re picking up groceries or at work, for example). Once located and the trunk is popped, DHL workers will place the shipment in the trunk and pick up any other boxes marked for return to Amazon.</p>", "<p>The service is being limited to Audi vehicles primarily for the fact that they offer third-party access to the trunk area. If the method catches on, it’s likely that we could see other automakers add the feature to new models or perhaps offer to retrofit existing vehicles.</p>"], "link": "http://www.techspot.com/news/60465-amazon-turns-car-mobile-delivery-address-packages.html"},
{"category": ["software"], "category2": ["business"], "author": ["Justin Kahn"], "headline": ["German court rules in favor of ad-blocking software over media outlets"], "image": ["http://www.techspot.com/images2/news/bigimage/2015-04-23-image-20.png"], "content": ["<p>As many of us are aware, online publications and media outlets rely heavily on the revenue generated by displaying ads throughout their content. We also know there are products out there that allow us to block those pesky ads. Recently a group of media outlets in Germany took AdBlock Plus <a href=\"http://www.bbc.com/news/technology-32409952\">to court</a> because it was threatening their business.</p>", "<p>The group, which consisted of publications including Die Zeit, Handelsblatt and others, said to judges in Hamburg the AdBlock Plus web browser extension is anti-competitive and should be shut down. </p>", "<p>Unfortunately for the publications, Germans will continue to be able to avoid advertising online as the court ruled in favor of AdBlock Plus. \"Now that the legalities are out of the way, we want to reach out to other publishers and advertisers and content creators and encourage them to work with Adblock Plus rather than against us, “ Project Manager from AdBlock Ben Williams said.</p>", "<p>However, it appears that won’t be the case. Publishers have indicated that an appeal is underway and that they will continue to fight against ad-blockers: “we are still convinced that AdBlock Plus is an illegal and anti-competitive practice.” The group feels ad-blocking technology “infringes” on the freedom of the press and will “examine the prospects” of an appeal.</p>", "<p>While it’s hard to imagine that giving users the choice as to whether or not they will support the publications they visit is a bad thing, AdBlock has also come under fire regarding what some are calling a whitelisting racket. The group has reportedly been accepting money from advertisers in order to have their ads pass through AdBlock, but the company has recently denied those claims.</p>"], "link": "http://www.techspot.com/news/60464-german-court-rules-favor-ad-blocking-software-over.html"},
{"category": ["wearables"], "category2": ["none"], "author": ["Tim Schiesser"], "headline": ["iFixit tears down the Apple Watch, finds tightly-packed internals"], "image": ["http://www.techspot.com/images2/news/bigimage/2015-04-24_02-44-38.jpg"], "content": ["<p>Today is that day that the Apple Watch begins arriving at the doorsteps of those lucky enough to have pre-ordered a first-round unit. iFixit has already received a 38mm Sport model with a blue Sports Band, and as usual, they've decided to give the smartwatch <a href=\"https://www.ifixit.com/Teardown/Apple+Watch+Teardown/40655\">the full teardown treatment</a>.</p>", "<p>To access the innards of the Apple Watch, iFixit first removed the display, revealing a small 205 mAh battery that occupies around half of the internal space. Above the battery is Apple's Taptic Engine, which is a linear actuator that provides haptic feedback paired with a subtle speaker.</p>", "<p>Behind the Taptic Engine and the battery is where the Apple S1 processor can be found, housing basically all of the chips required for the smartwatch's operation including the CPU, GPU, RAM, NAND and wireless radios. iFixit notes that the S1 is actually pretty difficult to remove, and it's unlikely that this will be an upgradeable part as was originally rumored.</p>", "<p><img src=\"http://www.techspot.com/images2/news/bigimage/2015-04-24_02-45-57.jpg\"></p>", "<p>Underneath the S1 is a range of sensors, and around the edges are connectors for the clever digital crown, and the side button. Many of the components are well integrated and sealed, as the Apple Watch is IPX7 water resistant, allowing submersion in 1 meter of fresh water for up to 30 minutes.</p>", "<p>Several of the Apple Watch's components appear to be quite difficult to access and replace, especially in the 38mm model that iFixit tore down. The 42mm model is expected to have a slightly larger battery, but an internal layout that's largely the same. If you need to replace something from inside the smartwatch, it might be best to leave it to Apple.</p>"], "link": "http://www.techspot.com/news/60473-ifixit-tears-down-apple-watch.html"},
{"category": ["software"], "category2": ["none"], "author": ["Shawn Knight"], "headline": ["YouTube celebrates 10-year anniversary, check out the first video ever uploaded"], "image": ["http://www.techspot.com/images2/news/bigimage/2015-04-23-image-9.jpg"], "content": ["<p>The first-ever YouTube video was uploaded 10 years ago today. Titled “Me at the zoo,” the 18-second clip shows co-founder Jawed Karin discussing “all there is to say” about the elephant exhibit behind him at the San Diego zoo.</p>", "<p>That single, unassuming video – still available with more than 19 million views to date – arguably signaled the beginning of the online video revolution (we just didn’t know it at the time). Well, some of us might have had a hint as Google scoped up the video sharing website a year later for $1.65 billion but even the search giant’s backing didn’t guarantee success.</p>", "<p>The early vision for YouTube certainly doesn’t match the star-generating powerhouse that exists today. Instead, its creators saw it as more of a digital locker where users could easily share videos – not necessarily a destination to view videos from other people.</p>", "<p>But over the years, that’s exactly what YouTube has become. As the top video sharing destination on the web, YouTube enjoys the level of traffic and brand recognition that others can only dream of. In the 18 seconds it takes to watch the very first YouTube video, users around the world will have collectively consumed seven years worth of video on the site. That is to be expected with <a href=\"http://www.techspot.com/news/52021-youtube-celebrates-one-billion-monthly-unique-users.html\">more than a billion</a> users visiting each month.</p>", "<p>Yet in the fast-paced world of technology, no company is safe – even those at the top of the hill. Increased pressure from rivals <a href=\"http://www.techspot.com/news/59347-could-facebook-first-real-challenger-youtube.html\">Facebook</a> (and perhaps in the long run, <a href=\"http://www.techspot.com/news/60150-vessel-exits-beta-offers-free-year-subscription-if.html\">Vessel</a>) is forcing the Google-owned company to <a href=\"http://www.techspot.com/news/60054-youtube-flips-switch-360-degree-videos-image-quality.html\">innovate</a> and come up with <a href=\"http://www.techspot.com/news/60310-youtube-ad-free-subscription-service-imminent-content-creators.html\">new ways</a> to <a href=\"http://www.techspot.com/news/58805-google-unveils-youtube-music-key-subscription-service-launching.html\">generate revenue</a> – especially if it wants the next decade to resemble the last.</p>", "<p class=\"grey\">Image via Janet, <a href=\"https://www.flickr.com/photos/13698839@N00/13925027313/\">Flickr</a></p>"], "link": "http://www.techspot.com/news/60461-youtube-celebrates-10-year-anniversary-check-out-first.html"},
{"category": ["software"], "category2": ["business"], "author": ["Tim Schiesser"], "headline": ["Microsoft launches new Windows 10 Preview build with range of improvements"], "image": ["http://www.techspot.com/images2/news/bigimage/2015-04-23-image-1.jpg"], "content": ["<p>Microsoft has <a href=\"https://www.thurrott.com/windows/windows-10/3093/microsoft-delivers-windows-10-technical-preview-2-build-10061\">released a new version</a> of the Windows 10 Preview, build 10061, to members of the Insider program for beta testing and feedback. Compared to <a href=\"http://www.techspot.com/news/60211-microsoft-unleashes-spartan-latest-windows-10-preview-build.html\">the previous Preview build</a>, this new build features a number of general improvements, additions and fixes across the board.</p>", "<p>The biggest addition to Windows 10 in this build are updated Mail and Calendar apps, which bring improved performance, more streamlined interfaces, and new features. The Mail app in particular has received a ton of new stuff, such as swipe gestures for flagging and deleting emails, and a revamped authoring experience that \"leverages the familiar and rich capability of Word\".</p>", "<p>Microsoft has also improved Continuum, which is Windows 10's way of modifying system behavior depending on whether a device is being used in a tablet mode with a touchscreen, or in a laptop/desktop mode with a keyboard and mouse. In the latest build of Windows, Microsoft has tweaked Continuum to make certain UI elements more touchable when in tablet mode.</p>", "<p>There are several new theming features in the latest Windows 10 build, including a black system theme, transparency for the Start menu and Taskbar, the ability to resize the Start menu, and new coloring options. On top of this, Microsoft has made some minor visual changes to Task View, and improved the Virtual Desktop experience.</p>", "<p>Windows Insiders in the Fast ring can now download build 10061 through Windows Update. Expect to hear more updates about Windows 10 this time next week as Microsoft's Build 2015 conference kicks off in San Francisco.</p>"], "link": "http://www.techspot.com/news/60457-microsoft-launches-new-windows-10-preview-build-range.html"},
{"category": ["software"], "category2": ["none"], "author": ["Shawn Knight"], "headline": ["Sideclick transforms your media streamer remote into a universal remote in seconds"], "image": ["http://www.techspot.com/images2/news/bigimage/2015-04-24-image-2.jpg"], "content": ["<p>Streaming set-top boxes are the go-to solution for <a href=\"http://www.techspot.com/article/981-cord-cutter-experience/\">cord cutters</a> yet as with any new audio / video device, it means adding another remote control to the mix. True Bloom has come up with a clever solution to the set-top box conundrum – an add-on accessory for your existing media streamer remote that’ll allow you to put away your television controller (and perhaps others, too).</p>", "<p><a href=\"http://www.sideclickremotes.com/\">Sideclick</a> snaps onto your existing streaming remote, adding additional buttons that can be used to control your television and external audio source (if applicable).</p>", "<p><iframe frameborder=\"0\" height=\"465\" scrolling=\"no\" src=\"https://www.kickstarter.com/projects/1895389752/sideclick-streamline-your-streaming-experience/widget/video.html\" width=\"620\"></iframe></p>", "<p>There are four models available, one for each of the four most popular streaming devices: Roku, Amazon Fire TV, Amazon Fire TV Stick and Apple TV. Each version allows the primary streaming remote to snap right into place and through the use of IR learning technology, the add-on remote can be programmed in less than a minute.</p>", "<p>Again, it can be programmed to control multiple devices meaning you can power up your television then your stereo receiver or sound bar to control the volume. Each Sideclick is designed to resemble the remote it will be paired with and best yet, it’s much cheaper than most universal remotes.</p>", "<p>Pricing starts at $25 on <a href=\"https://www.kickstarter.com/projects/1895389752/sideclick-streamline-your-streaming-experience/\">Kickstarter</a> for a single Sideclick (you specify the model). The campaign has already raised more than $80,000 but still has a long way to go to reach its $150,000 funding goal. With 27 days remaining, however, there’s a solid chance that this could get funded.</p>"], "link": "http://www.techspot.com/news/60470-httpwwwtechspotcomnews60470-html.html"},
{"category": ["software"], "category2": ["business"], "author": ["Tim Schiesser"], "headline": ["AMD CEO accidentally reveals Windows 10 will launch in late July"], "image": ["http://www.techspot.com/images2/news/header/2014-10-01.png"], "content": ["<p>Microsoft has continued to be relatively vague about when Windows 10 will launch, repeatedly saying that the OS is coming \"this summer.\" However it appears as though AMD CEO Lisa Su has spoiled Microsoft's surprise, revealing <a href=\"http://www.neowin.net/news/windows-10-to-launch-at-the-end-of-july-according-to-amd\">a more specific launch timeframe</a> for Windows 10: the end of July.</p>", "<p>Su <a href=\"http://seekingalpha.com/article/3076866-advanced-micro-devices-amd-ceo-lisa-su-on-q1-2015-results-earnings-call-transcript?page=4&amp;p=qanda&amp;l=last\">revealed the launch timeframe</a> while responding to a question during AMD's latest earnings call. Speaking about inventory plans, Su said that \"with the Windows 10 launch at the end of July, we are watching sort of the impact of that on the back-to-school season, and expect that it might have a bit of a delay to the normal back-to-school season inventory build-up.\"</p>", "<p>The launch timing makes sense, as Microsoft and its OEM partners could be looking to boost Windows system sales during the back-to-school period with the launch of the new OS on new devices. By many reports Microsoft has also already entered the feature lockdown stage for Windows 10, indicating the OS is well on its way towards being shipped.</p>", "<p>However, a July launch frame is only three months away, and judging by the latest Technical Preview builds, Microsoft still has a long way to go before Windows 10 is polished and bug-free. No doubt the company is working hard on cleaning up the code and ensuring it works smoothly, but there is still a lot of work to be done if they do intend to launch the OS at the end of July.</p>"], "link": "http://www.techspot.com/news/60415-amd-ceo-accidentally-reveals-windows-10-launch-late.html"}]